{
    "id": 1,
    "raw_text": "Data Scientist\r\nBengaluru, Karnataka, India · 3 days ago · Over 100 applicants\r\nPromoted by hirer · No response insights available yet\r\n\r\n\r\nOn-site\r\n\r\nFull-time\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Data Scientist at Alaan الآن\r\nData Scientist\r\nAlaan الآن · Bengaluru, Karnataka, India (On-site)\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Data Scientist at Alaan الآن\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nAbout the job\r\nAbout Alaan\r\n\r\nAlaan is the SuperCard™ for businesses and the most loved fintech in the Middle East. Our mission is to simplify finance for businesses so they can save time and money.\r\nAlaan provides everything businesses need to manage and control expenses, including the SuperCard™, AI-powered automation and insights, streamlined accounting, and centralized dashboards, all in one place.\r\n\r\n\r\nOver 1500 businesses in the UAE and KSA, from startups to enterprises, use Alaan to control spending and save costs.\r\n\r\n\r\nBacked by Y Combinator and top global investors- including founders and executives of leading startups - Alaan is built by a world-class team from McKinsey, BCG, Goldman Sachs, Barclays, Zomato, Careem, Rippling, and other high-growth companies.\r\n\r\n\r\nWe’re not just building software. We’re reimagining how finance works for modern businesses across the region.\r\n\r\n\r\nAbout the role\r\n\r\nAt Alaan, we’re building the modern financial stack for businesses across MENA—empowering companies to manage cards, payments, and expenses with intelligence and automation. A key part of this vision is our ML-powered product features, which drive smarter decisions, faster processes, and better customer experiences.\r\n\r\n\r\nWe’re looking for a strategic, senior-level Data Scientist to own the entire lifecycle of our machine learning features - from concept to production - and to act as the bridge between data science, engineering, and product. This is not just a modeling role - you’ll be setting the vision, defining the strategy, and ensuring that every AI-driven feature in our product is impactful, robust, and continuously improving.\r\n\r\n\r\nIf you’re excited by the idea of taking a feature from 80% to 90%+ accuracy, love working cross-functionally, and want to lead high-impact AI initiatives in fintech, this is the role for you.\r\n\r\n\r\nWhat you'll do\r\n\r\nDefine the Data Science Strategy: Translate product goals into clear, testable data science problems and technical requirements. Own the “what” and the “why” for ML initiatives.\r\nOversee the Modeling Lifecycle: Lead the team through Proof-of-Concepts (POCs), benchmarking, and productionization. Provide expert feedback on model selection, feature engineering, and validation.\r\nSet Success Criteria: Define robust metrics, benchmarks, and offline/online evaluation methods to measure success across the lifecycle.\r\nDrive Iterative Improvement: Monitor in-production performance, run A/B tests, and formulate experiments to push accuracy, efficiency, and user impact to the next level.\r\nEnsure Technical Excellence: Act as the quality gatekeeper—ensuring models are well-architected, scalable, and production-ready before deployment.\r\nLead Cross-Functional Delivery: Collaborate with Data Scientists, ML Engineers, Analysts, and Backend Engineers to ensure seamless execution and alignment with business goals.\r\n\r\n\r\nWhat we are looking for\r\n\r\n5+ years of experience in data science, with a proven record of delivering ML features to production.\r\nDeep ML expertise and strong grasp of the entire ML lifecycle - model design, training, validation, deployment, monitoring, and iteration.\r\nStrategic thinking ability to connect business needs to data science solutions, and prioritize based on impact.\r\nLeadership & mentorship experience of guiding teams, providing constructive technical feedback, and raising the quality bar.\r\nCommunication ability to explain complex technical topics clearly to both technical and non-technical audiences.\r\nLifecycle mastery and first-hand experience taking models from concept to production, troubleshooting failures, and leading improvements.\r\nPrior experience as a Tech Lead or Principal Data Scientist.\r\nExpertise in MLOps tools and best practices.\r\nFintech domain experience.\r\n\r\n\r\n What's in it for you\r\n\r\nContribute to building the Middle East’s most beloved fintech brand from the ground up\r\nBenefit from a role with significant ownership and accountability\r\nThrive in a flexible hybrid culture with ample work-life balance\r\nParticipate in exciting offsite events\r\nCompetitive salary and equity\r\nEnjoy additional perks like travel allowances, gym memberships, and more\r\n\r\n\r\n\r\nJob search faster with Premium\r\nAccess company insights like strategic priorities, headcount trends, and more\r\n\r\n\r\n\r\n\r\nMillions of members use Premium\r\n\r\nTry Premium for ₹0\r\n1 month free. Easy to cancel. No penalties or fees.\r\n\r\n",
    "timestamp": "2026-01-11T12:44:43.866923"
},
{
    "id": 2,
    "raw_text": "Data Science INTERN \r\nBengaluru, Karnataka, India · 3 days ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn\r\n\r\n\r\nOn-site\r\n\r\nFull-time\r\n\r\nApply\r\n\r\nSave\r\nSave Data Science INTERN  at Microsoft\r\nData Science INTERN\r\nMicrosoft · Bengaluru, Karnataka, India (On-site)\r\n\r\nApply\r\n\r\nSave\r\nSave Data Science INTERN  at Microsoft\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nAbout the job\r\nOverview\r\n\r\nCome build community, explore your passions and do your best work at Microsoft with thousands of University interns from every corner of the world. This opportunity will allow you to bring your aspirations, talent, potential—and excitement for the journey ahead.\r\n\r\nAs a Data Scientist Intern at Microsoft, you will use machine learning, statistics, experiments, and more to build and improve great products while making business impact. As a Data Scientist intern you will collaborate with stakeholders, formulate approaches to solve problems and use algorithms and data sources in the context of business and engineering needs. You will also be able to combine your engineering abilities with analytical skills to make customer experiences better. Our Data Scientists use innovative methods, algorithms and tools daily to drive results throughout Microsoft devices, operating systems, products, and services and provide novel insights into business and customer scenarios.\r\n\r\nAt Microsoft, Interns work on real-world projects in collaboration with teams across the world, while having fun along the way. You’ll be empowered to build community, explore your passions and achieve your goals. This is your chance to bring your solutions and ideas to life while working on cutting-edge technology.\r\n\r\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\r\n\r\nResponsibilities\r\n\r\nFormulate approaches to solve problems using well defined algorithms and data sources\r\nIncorporate an understanding of product functionality and customer perspective to provide context for those problems.\r\nUse data exploration techniques to discover new questions or opportunities within your problem area and propose applicability and limitations of the data.\r\nInterpret the results of their analysis, validate their approach, and learn to monitor, analyze, and iterate to continuously improve.\r\nEngage with peer stakeholders to produce clear, compelling, actionable insights that influence product and service improvements that will impact millions of customers.\r\nParticipate in the peer review process and act on feedback while learning innovative methods, algorithms, and tools to increase the impact and applicability of your results.\r\n\r\nQualifications\r\n\r\nCurrently pursuing a Bachelors Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field.\r\nMust have at least one additional quarter/semester of school remaining following the completion of the internship\r\n\r\nThis position will be open for a minimum of 5 days, with applications accepted on an ongoing basis until the position is filled.\r\n\r\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance with religious accommodations and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\r\n\r\nJob search faster with Premium\r\nAccess company insights like strategic priorities, headcount trends, and more\r\n\r\n\r\n\r\n\r\nMillions of members use Premium\r\n\r\nTry Premium for ₹0\r\n1 month free. Easy to cancel. No penalties or fees.\r\n\r\nAbout the company\r\nMicrosoft company logo\r\nMicrosoft\r\n27,287,934 followers\r\n\r\nFollow\r\nSoftware Development  10,001+ employees  226,453 on LinkedIn\r\nEvery company has a mission. What's ours? To empower every person and every organization to achieve more. We believe technology can and should be a force for good and that meaningful innovation contributes to a brighter world in the future and today. Our culture doesn’t just encourage curiosity; it embraces it. Each day we make progress together by showing up as our authentic selves. We show up with a learn-it-all mentality. We show up cheering on others, knowing their success doesn't diminish our own. We show up every day open to learning our own biases, changing our behavior, and inviting in differences. Because impact matters.\r\n\r\nMicrosoft operates in 190 countries and is made up of approximately 228,000 passionate employees worldwide.\r\n…\r\nshow more\r\n\r\nCommitments\r\n\r\nEnvironmental sustainability\r\nMicrosoft has public, time-bound commitments to become carbon negative, water positive, and zero waste in our operations by 2030. Microsoft is accelerating progress toward a more sustainable future by measuring and reducing our environmental footprint, accelerating research, helping our customers build sustainable solutions, and advocating for policies that benefit the environment.\r\n…\r\nShow more\r\nSocial impact\r\nWe have an enormous opportunity and responsibility to ensure that the technology we create benefits everyone on the planet, as well as the planet itself. As we drive economic growth, we must also commit to creating a more inclusive, equitable, sustainable, and trusted future for everyone. To help people and organizations everywhere achieve more, we focus on four commitments: support inclusive economic growth, protect fundamental rights, create a sustainable future, and earn trust.\r\n…\r\nShow more\r\nDiversity, equity, and inclusion\r\nAt Microsoft, we strive to create an environment where people with different backgrounds, experiences, and perspectives thrive. Our journey and our learnings are ongoing, but we are clear about our goals: We want every employee to feel like we can be our authentic selves, in alignment with our company values, so we can do our best work. We’re focused on increasing representation, from interns all the way through to the boardroom. Our accountability starts at the highest levels of our organization and extends to every role. We aim to influence systemic and sustainable change, which requires us to do the micro and macro motions every single day that impact employees’ experiences and transform the systems that drive access, opportunity, and greater equality. We have a long history at Microsoft of applying our growth mindset to address some of the world’s most complex challenges. We put the same relentless focus and willingness to learn to work in confronting the realities of inequity in our industry and beyond—not because we have all the answers, but because we are uniquely positioned to make a difference when we innovate for inclusion.\r\n…\r\nShow more\r\nCareer growth and learning\r\nAt Microsoft, we believe a career is more than a job. It’s about who you are and who you want to become. It’s an ongoing experience—and with a growth mindset guiding the way, you can shape that experience into just about anything you can imagine. We know that interests can shift and careers evolve over time. That’s why Microsoft is committed to helping our employees discover their passions, grow the skills they need to realize them, and connect with people who can support them throughout their career. We support our employees’ development by focusing on three pillars of the career experience: discovery, connection, and growth. If they’re looking for inspiration, we provide resources that can help them discover new interests and engage with them in meaningful ways. We connect employees with the One Microsoft community and empower them to make the most of everything Microsoft’s global network has to offer. And we have an entire ecosystem of learning opportunities and experiences designed to help our employees grow professionally and personally.\r\n…\r\nShow more\r\nWork-life balance\r\nMicrosoft is dedicated to providing comprehensive wellbeing benefits that help employees regenerate energy, at work and at home. While Microsoft as an organization is consistently taking a learn-it-all approach to better support its employees, a few examples of this dedication to employee wellbeing include: A hybrid workplace model that allows employees to determine the working preferences that support how they work best. It’s understood and expected that employee preferences and needs may change over time—and that’s OK. Comprehensive annual paid time off offerings and enhanced paid parental and family caregiver leave globally. Access to mental health resources via our EAP, using our top-notch health plan, and on the Be Well platform—including digital therapy, self-directed sessions, prerecorded sessions with experts on resilience, physical activity contests, and more.\r\n…\r\nShow more\r\nLearn more\r\nInterested in working with us in the future?\r\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company\r\n\r\n\r\n",
    "timestamp": "2026-01-11T12:45:11.877388"
},
{
    "id": 3,
    "raw_text": "Data Scientist Intern\r\nIndia · 23 hours ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn\r\n\r\n\r\nRemote\r\n\r\nFull-time\r\n\r\nApply\r\n\r\nSave\r\nSave Data Scientist Intern at Skillzenloop\r\nData Scientist Intern\r\nSkillzenloop · India (Remote)\r\n\r\nApply\r\n\r\nSave\r\nSave Data Scientist Intern at Skillzenloop\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nAbout the job\r\nData Scientist Intern\r\nCompany: SkillzenLoop\r\nLocation: Remote\r\nEmployment Type: Internship (Full-time)\r\nDuration: 1–3 Months\r\nStipend: ₹15,000 per month\r\nRole Description\r\nSkillzenLoop is looking for an intellectually curious Data Scientist Intern to help us extract value from our data. In this role, you will go beyond simple analysis to build predictive models, design experiments, and apply advanced statistical techniques to solve complex business problems. You will work at the intersection of mathematics, technology, and business strategy to drive innovation.\r\nPrimary Responsibilities\r\n• Statistical Modeling: Apply various statistical and machine learning techniques to identify trends and build predictive prototypes.\r\n• Data Wrangling: Clean and integrate large, complex datasets from multiple sources to prepare them for modeling.\r\n• Algorithm Development: Assist in developing and testing custom algorithms to improve product features and user experience.\r\n• Insight Communication: Interpret and communicate data insights to stakeholders through compelling storytelling and advanced visualization.\r\n• Experimental Design: Assist in designing and analyzing A/B tests to measure the impact of new features or business strategies.\r\nRequirements\r\n• Education: Currently pursuing or a recent graduate of a Master’s or PhD in Data Science, Statistics, Physics, Mathematics, or a related quantitative field (Bachelors with strong projects also considered).\r\n• Programming Skills: Expert-level proficiency in Python or R, specifically for data science applications.\r\n• Mathematical Foundation: Deep understanding of linear algebra, calculus, and advanced probability/statistics.\r\n• Tools: Experience with SQL and data science libraries (Scikit-learn, Pandas, Statsmodels, or PyTorch/TensorFlow).\r\n• Curiosity: A strong desire to ask \"why\" and the persistence to find answers within complex datasets.\r\nInternship Benefits\r\n• Stipend: A monthly payment of ₹15,000.\r\n• Certification: Official Internship Completion Certificate from SkillzenLoop.\r\n• Professional Growth: Performance-based Letter of Recommendation (LoR).\r\n• Mentorship: Work directly with senior Data Scientists on high-level strategic projects.\r\n• Impact: Your models and insights will directly influence company decision-making.\r\n\r\n",
    "timestamp": "2026-01-11T12:45:39.878763"
},
{
    "id": 4,
    "raw_text": "Data Scientist \r\nNoida, Uttar Pradesh, India · Reposted 2 weeks ago · Over 100 applicants\r\nPromoted by hirer · Actively reviewing applicants\r\n\r\n\r\nFull-time\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Data Scientist  at EXL\r\nData Scientist\r\nEXL · Noida, Uttar Pradesh, India\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Data Scientist  at EXL\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nAbout the job\r\nSenior Data Scientists lead data analysis projects and provide strategic insights. Responsibilities include designing complex models, mentoring junior data scientists, and ensuring the quality of analytical work. You will work closely with business leaders to understand needs and deliver actionable insights. Extensive experience in data science and leadership skills are required.\r\n\r\n\r\nDesired Skills and Experience\r\nAdapting To Change , Attention To Consistency , Big Data Optimization , Cloud Security Management , Data Backup and Recovery , Data Strategy , Interpersonal Dynamics with Coworkers , Results Orientation , Stakeholder Engagement , Time Management Skills , Working under Pressure , Writing Communication Skills\r\n\r\nJob search faster with Premium\r\nAccess company insights like strategic priorities, headcount trends, and more\r\n\r\n\r\n\r\n\r\nMillions of members use Premium\r\n\r\nTry Premium for ₹0\r\n1 month free. Easy to cancel. No penalties or fees.\r\n\r\nAbout the company\r\nEXL company logo\r\nEXL\r\n1,874,895 followers\r\n\r\nFollow\r\nBusiness Consulting and Services  10,001+ employees  50,133 on LinkedIn\r\nChoosing a digital partner is about more than capabilities — it’s about collaboration and character.\r\n\r\nUnrealistic overhauls and off-the-shelf products ignore what matters most — your unique needs, culture, goals, and your legacy data and technology environments.\r\n\r\nAt EXL, our collaboration is built on ongoing listening and learning to adapt our methodologies. We’re your business evolution partner—tailoring solutions that make the most of data to make better business decisions and drive more intelligence into your increasingly digital operations.\r\n\r\nWhether your goals are scaling the use of AI and digital, redesign operating models, or driving better and faster decisions, we’re here to partner with you to help you gain—and maintain—competitive advantage with efficient, sustainable models at scale.\r\n\r\nOur expertise in transformation, data science, and change management helps make your business more efficient and effective, improve customer relationships and enhance revenue growth. Instead of focusing on multi-year, resource- and time-intensive platform designs or migrations, we look deeper at your entire value chain to integrate strategies with impact.\r\n\r\nWe use our specialization in analytics, digital interventions, and operations management—alongside deep industry expertise — to deliver solutions that help you outperform the competition.\r\n\r\nAt EXL, it’s all about outcomes—your outcomes—and delivering success on your terms. Share your goals with us and together, we’ll optimize how you leverage data to drive your business forward.\r\n\r\nFor more information, visit www.exlservice.com.\r\n…\r\nshow more\r\n\r\nInterested in working with us in the future?\r\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company\r\n\r\n\r\n",
    "timestamp": "2026-01-11T12:46:07.851822"
},
{
    "id": 5,
    "raw_text": "Data Scientist \r\nNoida, Uttar Pradesh, India · Reposted 2 weeks ago · Over 100 applicants\r\nPromoted by hirer · Actively reviewing applicants\r\n\r\n\r\nFull-time\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Data Scientist  at EXL\r\nData Scientist\r\nEXL · Noida, Uttar Pradesh, India\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Data Scientist  at EXL\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nAbout the job\r\nSenior Data Scientists lead data analysis projects and provide strategic insights. Responsibilities include designing complex models, mentoring junior data scientists, and ensuring the quality of analytical work. You will work closely with business leaders to understand needs and deliver actionable insights. Extensive experience in data science and leadership skills are required.\r\n\r\n\r\nDesired Skills and Experience\r\nAdapting To Change , Attention To Consistency , Big Data Optimization , Cloud Security Management , Data Backup and Recovery , Data Strategy , Interpersonal Dynamics with Coworkers , Results Orientation , Stakeholder Engagement , Time Management Skills , Working under Pressure , Writing Communication Skills\r\n\r\nJob search faster with Premium\r\nAccess company insights like strategic priorities, headcount trends, and more\r\n\r\n\r\n\r\n\r\nMillions of members use Premium\r\n\r\nTry Premium for ₹0\r\n1 month free. Easy to cancel. No penalties or fees.\r\n\r\nAbout the company\r\nEXL company logo\r\nEXL\r\n1,874,895 followers\r\n\r\nFollow\r\nBusiness Consulting and Services  10,001+ employees  50,133 on LinkedIn\r\nChoosing a digital partner is about more than capabilities — it’s about collaboration and character.\r\n\r\nUnrealistic overhauls and off-the-shelf products ignore what matters most — your unique needs, culture, goals, and your legacy data and technology environments.\r\n\r\nAt EXL, our collaboration is built on ongoing listening and learning to adapt our methodologies. We’re your business evolution partner—tailoring solutions that make the most of data to make better business decisions and drive more intelligence into your increasingly digital operations.\r\n\r\nWhether your goals are scaling the use of AI and digital, redesign operating models, or driving better and faster decisions, we’re here to partner with you to help you gain—and maintain—competitive advantage with efficient, sustainable models at scale.\r\n\r\nOur expertise in transformation, data science, and change management helps make your business more efficient and effective, improve customer relationships and enhance revenue growth. Instead of focusing on multi-year, resource- and time-intensive platform designs or migrations, we look deeper at your entire value chain to integrate strategies with impact.\r\n\r\nWe use our specialization in analytics, digital interventions, and operations management—alongside deep industry expertise — to deliver solutions that help you outperform the competition.\r\n\r\nAt EXL, it’s all about outcomes—your outcomes—and delivering success on your terms. Share your goals with us and together, we’ll optimize how you leverage data to drive your business forward.\r\n\r\nFor more information, visit www.exlservice.com.\r\n…\r\nshow more\r\n\r\nInterested in working with us in the future?\r\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company\r\n\r\n\r\n",
    "timestamp": "2026-01-11T12:46:35.825024"
},
{
    "id": 6,
    "raw_text": "Artificial Intelligence Intern \r\nIndia · 17 hours ago · Over 100 applicants\r\nPromoted by hirer · Company review time is typically 1 week\r\n\r\n\r\nRemote\r\n\r\nInternship\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Artificial Intelligence Intern  at Zetheta Algorithms Private Limited\r\nArtificial Intelligence Intern\r\nZetheta Algorithms Private Limited · India (Remote)\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Artificial Intelligence Intern  at Zetheta Algorithms Private Limited\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nMeet the hiring team\r\nAvani Shah\r\nAvani Shah  \r\n 3rd\r\nCo-Founder at ZeTheta Algorithms Private Limited\r\nJob poster\r\n\r\nMessage\r\nAbout the job\r\nAbout the Company\r\n\r\nZeTheta Algorithms Private Limited (www.zetheta.com) is a FinTech start-up which has been recently set up and is developing innovative AI tools.\r\nhttps://www.instagram.com/zetheta.official/\r\n\r\n\r\nAbout the Role\r\n\r\nWe are seeking a talented and motivated student/ fresher intern to develop AI models from scratch within a 2 month timeframe. This is an extraordinary opportunity for a self-driven, technically skilled student to build a complete enterprise-grade system that incorporates cutting-edge AI technologies including deep learning.\r\n\r\n\r\nResponsibilities\r\n\r\nDesign and implement the complete AI Models following provided specifications\r\nDevelop both frontend and backend components of the platform\r\nCreate and integrate AI modules\r\nDesign and optimize database schema and queries\r\nEnsure system security, especially for sensitive identity verification data\r\nDeploy the solution using zero-cost cloud services\r\nDocument code, APIs, and system architecture\r\nComplete the entire project within the 2 month timeline\r\n\r\n\r\nQualifications\r\n\r\nNo experience required. Preferably, a student who is currently pursuing or fresh graduate who has recently completed a degree in Computer Science, AI/ML, or related field.\r\n\r\n\r\nRequired Skills (permitted to use all LLMs)\r\n\r\nStrong programming skills in Python and JavaScript\r\nUnderstanding of React.js for frontend development and Node.js for backend\r\nKnowledge of FastAPI or similar Python web frameworks\r\nFamiliarity with database design and SQL (particularly PostgreSQL with Supabase)\r\nDeployment on AWS with CD/ CI Pipelines and Manual Environment in EC2 instance, S3\r\nUnderstanding of basic machine learning concepts\r\nSelf-motivated with ability to work independently\r\n\r\n\r\nPreferred Skills (permitted to use all LLMs)\r\n\r\nSound knowledge of AI/ML libraries (TensorFlow, Keras, HuggingFace Transformers)\r\nFamiliarity with computer vision techniques using OpenCV\r\nKnowledge of natural language processing concepts\r\nSound knowledge of facial recognition or emotion detection systems\r\nUnderstanding of identity verification methodologies\r\nDocker containerization experience\r\nPrior work with cloud deployment (AWS)\r\n\r\n\r\nWho Should Apply?\r\n\r\nStudent or fresh graduate from any academic discipline.\r\nStrong analytical and problem-solving skills.\r\nBasic knowledge of Microsoft Office.\r\nWillingness to self-learn and work in a fast-paced environment.\r\n\r\n\r\nInternship Details\r\n\r\nDuration: Self paced, options for 15days or 1,2,3,4 or 6 months.\r\nType: Unpaid\r\n\r\nAbout the company\r\nZetheta Algorithms Private Limited company logo\r\nZetheta Algorithms Private Limited\r\n367,953 followers\r\n\r\nFollow\r\n",
    "timestamp": "2026-01-11T12:47:03.848421"
},
{
    "id": 7,
    "raw_text": "Associate - Data Scientist \r\nGurugram, Haryana, India · 2 days ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn\r\n\r\n\r\nFull-time\r\n\r\nApply\r\n\r\nSave\r\nSave Associate - Data Scientist  at United Airlines\r\nAssociate - Data Scientist\r\nUnited Airlines · Gurugram, Haryana, India\r\n\r\nApply\r\n\r\nSave\r\nSave Associate - Data Scientist  at United Airlines\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nAbout the job\r\nAchieving our goals starts with supporting yours. Grow your career, access top-tier health and wellness benefits, build lasting connections with your team and our customers, and travel the world using our extensive route network.\r\n\r\nCome join us to create what’s next. Let’s define tomorrow, together.\r\n\r\nDescription\r\n\r\nUnited's Digital Technology team designs, develops, and maintains massively scaling technology solutions brought to life with innovative architectures, data analytics, and digital solutions.\r\n\r\nJob Overview And Responsibilities\r\n\r\nThe Analytics and Innovation (Ai) team at United Airlines works to innovate, transform, and solve complex business problems resulting in significant and measurable enterprise impact through the application of deep cross-functional business expertise and advanced analytics. We work with business and technology partners across the enterprise (e.g. Airport Operations, Contact Centers, Network Planning, Revenue Management, Digital Products, Human Resources, etc.) to influence strategic decisions, enterprise strategy, business process, and to help connect the dots across the enterprise. We aim to be an organization with whom and within everyone loves to work!\r\n\r\nData Scientists within Ai partner with business and technology leaders across the company to deploy AI & ML powered solutions to support and automate business processes. The team works closely with other teams in digital technology with complementing skills and capabilities. The key objectives are to drive incremental revenue, boost customer engagement and to automate manual processes by leveraging state-of-the-art ML techniques. Data Scientists contribute to developing smart and innovative solutions across many of United’s departments.\r\n\r\nWork with other data scientists and a variety of stakeholders (IT, DE, business etc.) to deliver high-quality models\r\nGathering and analyzing data of United’s various operations to make fact-based, data-driven recommendations\r\nExecute solutions to business problems using data analysis, machine learning and optimization tools \r\nEnable data transfer between platforms and monitor model performance for scalable project deployments\r\nResearch latest machine learning approaches and share the knowledge across the team\r\nEffectively structure communication of insights from work streams and deliver clear and professional presentations to the team/team leaders/managers\r\nPartner and engage with data engineering and operations teams to inform and support business stakeholders with day-to-day project updates.\r\n\r\nThis position is offered on local terms and conditions. Expatriate assignments and sponsorship for employment visas, even on a time-limited visa status, will not be awarded. This position is for United Airlines Business Services Pvt. Ltd - a wholly owned subsidiary of United Airlines Inc.\r\n\r\nQualifications\r\n\r\nWhat’s needed to succeed (Minimum Qualifications):\r\n\r\nBachelor’s degree \r\nEngineering, Technology, Computer Science, Statistics, Operations Research, Industrial Engineering, Applied Mathematics, Economics\r\n0 – 3 years experience\r\n Excellent analytical and problem-solving skills\r\n Proficiency in Programming Languages (Python/R), SQL, Excel and other Microsoft Office products\r\n Intermediate knowledge in machine learning algorithms like Bagging (Decision Trees, RF), Boosting (XGBoost, GBM) , Clustering (KMeans)\r\n Proven comfort and an intellectual curiosity for working with very large sets of data\r\n Understanding of probability & statistics\r\n Ability to bridge business context with technical details and explain and discuss mathematical and machine learning technicalities to a business audience\r\n Strong interpersonal skills with a focus on teamwork\r\n\r\nWhat will help you propel from the pack (Preferred Qualifications):\r\n\r\n Knowledge of deep learning/neural networks and experience with NLP/CV \r\n Hands on experience in using AWS/Azure etc \r\nData Science, Business Analytics, Engineering, Technology, Computer Science, , Statistics, Operations Research, Applied Mathematics, Economics\r\n\r\nJob search faster with Premium\r\nAccess company insights like strategic priorities, headcount trends, and more\r\n\r\n\r\n\r\n\r\nMillions of members use Premium\r\n\r\nTry Premium for ₹0\r\n1 month free. Easy to cancel. No penalties or fees.\r\n\r\nAbout the company\r\nUnited Airlines company logo\r\nUnited Airlines\r\n1,196,605 followers\r\n\r\nFollow\r\nAirlines and Aviation  10,001+ employees  73,106 on LinkedIn\r\n",
    "timestamp": "2026-01-11T12:47:31.852964"
},
{
    "id": 8,
    "raw_text": "Associate Data Scientist\r\nIndia · 5 days ago · Over 100 applicants\r\nPromoted by hirer · Actively reviewing applicants\r\n\r\n\r\nRemote\r\n\r\nFull-time\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Associate Data Scientist at v4c.ai\r\nAssociate Data Scientist\r\nv4c.ai · India (Remote)\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Associate Data Scientist at v4c.ai\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nAbout the job\r\nOverview:\r\nThe Associate Data Scientist supports the development and implementation of data models, focusing on Machine Learning, under the supervision of more experienced scientists, contributing to the team’s innovative projects.\r\nJob Description:\r\n\r\n\r\nAssist in the development of Machine Learning models and algorithms, contributing to the design and implementation of data-driven solutions.\r\nPerform data preprocessing, cleaning, and analysis, preparing datasets for modeling and supporting higher-level data science initiatives.\r\nLearn from and contribute to projects involving Deep Learning and General AI, gaining hands-on experience under the guidance of senior data scientists.\r\nEngage in continuous professional development, enhancing skills in Python, Machine Learning, and related areas through training and practical experience.\r\nCollaborate with team members to ensure the effective implementation of data science solutions, participating in brainstorming sessions and project discussions.\r\nSupport the documentation of methodologies and results, ensuring transparency and reproducibility of data science processes.\r\nQualifications:\r\n\r\n\r\nBachelor's degree in Computer Science, Statistics, Mathematics, or a related field, with a strong interest in Machine Learning, Deep Learning, and AI.\r\nExperience in a data science role, demonstrating practical experience and strong Python programming skills.\r\nExposure to Business Intelligence (BI) & Data Engineering concepts and tools.\r\nFamiliarity with data platforms such as Dataiku is a bonus.\r\nSkills:\r\n\r\n\r\nSolid understanding of Machine Learning principles and practical experience in Python programming.\r\nFamiliarity with data science and machine learning libraries in Python (e.g., scikit-learn, pandas, NumPy).\r\nEagerness to learn Deep Learning and General AI technologies, with a proactive approach to acquiring new knowledge and skills.\r\nStrong analytical and problem-solving abilities, capable of tackling data-related challenges and deriving meaningful insights.\r\nBasic industry domain knowledge, with a willingness to deepen expertise and apply data science principles to solve real-world problems.\r\nEffective communication skills, with the ability to work collaboratively in a team environment and contribute to discussions.\r\nv4c.ai is an equal opportunity employer. We value diversity and are committed to creating an inclusive environment for all employees, regardless of race, color, religion, gender, sexual orientation, national origin, age, disability, or veteran status.\r\nWe believe in the power of diversity and strive to foster a culture where every team member feels valued and respected. We encourage applications from individuals of all backgrounds and experiences.\r\nIf you are passionate about diversity and innovation and thrive in a collaborative environment, we invite you to apply and join our team.\r\n\r\nSee curated AI tools for your job search\r\nGet hired faster with the help of AI tools built by verified companies like Kickresume, Exponent Interview Prep, and more.\r\n\r\nGet started\r\n",
    "timestamp": "2026-01-11T12:47:59.862000"
},
{
    "id": 9,
    "raw_text": "Associate Data Scientist\r\nIndia · 5 days ago · Over 100 applicants\r\nPromoted by hirer · Actively reviewing applicants\r\n\r\n\r\nRemote\r\n\r\nFull-time\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Associate Data Scientist at v4c.ai\r\nAssociate Data Scientist\r\nv4c.ai · India (Remote)\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Associate Data Scientist at v4c.ai\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nAbout the job\r\nOverview:\r\nThe Associate Data Scientist supports the development and implementation of data models, focusing on Machine Learning, under the supervision of more experienced scientists, contributing to the team’s innovative projects.\r\nJob Description:\r\n\r\n\r\nAssist in the development of Machine Learning models and algorithms, contributing to the design and implementation of data-driven solutions.\r\nPerform data preprocessing, cleaning, and analysis, preparing datasets for modeling and supporting higher-level data science initiatives.\r\nLearn from and contribute to projects involving Deep Learning and General AI, gaining hands-on experience under the guidance of senior data scientists.\r\nEngage in continuous professional development, enhancing skills in Python, Machine Learning, and related areas through training and practical experience.\r\nCollaborate with team members to ensure the effective implementation of data science solutions, participating in brainstorming sessions and project discussions.\r\nSupport the documentation of methodologies and results, ensuring transparency and reproducibility of data science processes.\r\nQualifications:\r\n\r\n\r\nBachelor's degree in Computer Science, Statistics, Mathematics, or a related field, with a strong interest in Machine Learning, Deep Learning, and AI.\r\nExperience in a data science role, demonstrating practical experience and strong Python programming skills.\r\nExposure to Business Intelligence (BI) & Data Engineering concepts and tools.\r\nFamiliarity with data platforms such as Dataiku is a bonus.\r\nSkills:\r\n\r\n\r\nSolid understanding of Machine Learning principles and practical experience in Python programming.\r\nFamiliarity with data science and machine learning libraries in Python (e.g., scikit-learn, pandas, NumPy).\r\nEagerness to learn Deep Learning and General AI technologies, with a proactive approach to acquiring new knowledge and skills.\r\nStrong analytical and problem-solving abilities, capable of tackling data-related challenges and deriving meaningful insights.\r\nBasic industry domain knowledge, with a willingness to deepen expertise and apply data science principles to solve real-world problems.\r\nEffective communication skills, with the ability to work collaboratively in a team environment and contribute to discussions.\r\nv4c.ai is an equal opportunity employer. We value diversity and are committed to creating an inclusive environment for all employees, regardless of race, color, religion, gender, sexual orientation, national origin, age, disability, or veteran status.\r\nWe believe in the power of diversity and strive to foster a culture where every team member feels valued and respected. We encourage applications from individuals of all backgrounds and experiences.\r\nIf you are passionate about diversity and innovation and thrive in a collaborative environment, we invite you to apply and join our team.\r\n\r\nSee curated AI tools for your job search\r\nGet hired faster with the help of AI tools built by verified companies like Kickresume, Exponent Interview Prep, and more.\r\n\r\nGet started\r\n",
    "timestamp": "2026-01-11T12:48:27.860239"
},
{
    "id": 10,
    "raw_text": "Data Science Intern\r\nIndia · 1 hour ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn\r\n\r\n\r\nRemote\r\n\r\nInternship\r\n\r\nApply\r\n\r\nSave\r\nSave Data Science Intern at Dexter's Tech\r\nData Science Intern\r\nDexter's Tech · India (Remote)\r\n\r\nApply\r\n\r\nSave\r\nSave Data Science Intern at Dexter's Tech\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nMeet the hiring team\r\nSanket Patil\r\nSanket Patil  \r\n 3rd+\r\nFounder & CEO at Unified Mentor\r\nJob poster\r\n\r\nMessage\r\nAbout the job\r\nData Science Intern (Paid)\r\nCompany: Dexter’s Tech\r\nLocation: Remote\r\nDuration: 3 Months\r\nOpportunity & Benefits\r\n💰 Performance-based stipend up to ₹7,499\r\n🎁 Swags and goodies\r\n📜 Internship Certificate\r\n✉️ Letter of Recommendation (based on performance)\r\n🌟 Potential full-time role based on performance\r\n📈 Hands-on experience with real-world data science projects\r\nAbout Dexter’s Tech\r\nDexter’s Tech empowers aspiring data professionals by providing practical, industry-relevant experience in data science. The internship focuses on building strong foundations in analytics, statistics, and machine learning through live projects aligned with real-world business and technology challenges.\r\nRoles & Responsibilities\r\nCollect, preprocess, and analyze large datasets\r\nPerform Exploratory Data Analysis (EDA) to uncover meaningful insights\r\nBuild predictive models and machine learning algorithms\r\nCreate data visualizations and dashboards for effective storytelling\r\nCollaborate with cross-functional teams to deliver data-driven solutions\r\nRequirements\r\nCurrently enrolled in or graduated from Data Science, Computer Science, Statistics, or related fields\r\nProficiency in Python or R for data analysis and modeling\r\nFamiliarity with scikit-learn, TensorFlow, or PyTorch (preferred)\r\nExperience with visualization tools such as Tableau, Power BI, or Matplotlib\r\nStrong analytical, problem-solving, and communication skills\r\nWhat You Will Gain\r\nReal-world exposure to data science workflows\r\nPerformance-based stipend up to ₹7,499\r\nSwags and goodies\r\nInternship Certificate upon completion\r\nLetter of Recommendation based on performance\r\nOpportunity to build a strong data science portfolio\r\nPotential full-time role based on performance\r\nHow to Apply\r\nSubmit your resume and cover letter with the subject line:\r\n“Data Science Intern Application”\r\n\r\n📅 Application Deadline: 12th January 2026\r\n\r\nEqual Opportunity Statement\r\nDexter’s Tech is an equal opportunity organization and encourages applications from candidates of all backgrounds.\r\n\r\nJob search faster with Premium\r\nAccess company insights like strategic priorities, headcount trends, and more\r\n\r\n\r\n\r\n\r\nMillions of members use Premium\r\n\r\nTry Premium for ₹0\r\n1 month free. Easy to cancel. No penalties or fees.\r\n\r\n",
    "timestamp": "2026-01-11T12:48:55.837066"
},
{
    "id": 11,
    "raw_text": "Data Scientist \r\nIndia · 5 days ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn\r\n\r\n\r\nRemote\r\n\r\nFull-time\r\n\r\nApply\r\n\r\nSave\r\nSave Data Scientist  at Talentica Software\r\nData Scientist\r\nTalentica Software · India (Remote)\r\n\r\nApply\r\n\r\nSave\r\nSave Data Scientist  at Talentica Software\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nMeet the hiring team\r\nMeenaakshi Patil\r\nMeenaakshi Patil  \r\n 3rd+\r\nTalent Acquisition Head at Talentica Software\r\nJob poster\r\n\r\nMessage\r\nAbout the job\r\nThe Company \r\n\r\nTalentica Software is a boutique software development company started by ex-IITB grads and industry veterans. It is a privately held company. The company is 18 years old and 500+ employees work exclusively for startups as Tech Partners taking them from a Series-A position to Series-B position and possible acquisition (ex- Citrus Pay, Mist).\r\nWe have built products for over 150 startups, most of them are based in the Bay Area or Europe. These startups come to us primarily because we know the issues that plague startup product development and the solutions for the same, thereby improving their success chances. Owing to the unique space we are in, we deal extensively with cutting edge technology.\r\nData Science Team \r\n\r\nThe data science team works under the purview of the Technology Excellence Group at Talentica Software. The goal of this team is to solve problems and build algorithms that are typically data driven. Hence, problems involving statistics, optimization, computer vision, machine learning, and natural language processing are of interest to this group.\r\nScope for Hiring\r\n\r\nWe are looking to hire a Data Scientist with experience in different areas of Machine learning and is flexible to work in wide areas of ML.\r\nHere is what we are looking for in prospective candidates: Mandatory\r\n· Excellent programming skills and must be able to implement complex algorithms in Python\r\n· Extensive understanding of ML and statistical algorithms\r\n· Hands-on experience with use of standard machine learning libraries such as OpenCV, Tensorflow, Keras etc.\r\n· Big data experience and should have worked in SQl/NoSQL DBs like Mongo/Cassandra/PostgreSQL/Neo4J\r\n· Capability of converting PoC to production quality code and subsequent, deployment\r\nHere is what we are looking for in prospective candidates: Good to have\r\n· Credited courses focused on linear algebra, stochastic models, pattern recognition, design and analysis of algorithms, machine learning\r\n· Interest in applications of Deep learning like computer vision algorithms for video, shape recognition, matching & retrieval\r\n· Some exposure to statistical modeling\r\nExperience:\r\n· Should have worked in the industry for at least 2+ years.\r\n· Should like to work in a startup environment.\r\n· Should be capable of converting theory to practice by reading relevant papers.\r\n· Should be capable of conceiving original ideas and coding them as working algorithms.\r\n· Should have taken at least 2 products to production end-to-end.\r\n\r\n\r\nBE/B.Tech from IIT, NIT, BITS Pilani, COEP (Pune), VJTI, IIT-BHU or ISM.\r\n\r\n\r\n",
    "timestamp": "2026-01-11T12:49:23.817281"
},
{
    "id": 12,
    "raw_text": "Machine Learning Intern\r\nIndia · 2 hours ago · 58 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn\r\n\r\n\r\nRemote\r\n\r\nInternship\r\n\r\nApply\r\n\r\nSave\r\nSave Machine Learning Intern at Zenithbyte\r\nMachine Learning Intern\r\nZenithbyte · India (Remote)\r\n\r\nApply\r\n\r\nSave\r\nSave Machine Learning Intern at Zenithbyte\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nMeet the hiring team\r\nSanket Patil\r\nSanket Patil  \r\n 3rd+\r\nFounder & CEO at Unified Mentor\r\nJob poster\r\n\r\nMessage\r\nAbout the job\r\nMachine Learning Intern (Paid)\r\nCompany: ZenithByte\r\nLocation: Remote\r\nDuration: 3 Months\r\n📅 Application Deadline: 12th January 2026\r\n\r\nOpportunity & Benefits\r\n💰 Performance-based stipend up to ₹7,499\r\n🎁 Swags and goodies\r\n📜 Certificate of Internship\r\n✉️ Letter of Recommendation (based on performance)\r\n🌟 Potential full-time role based on performance\r\n🤝 Expert mentorship & live project exposure\r\nAbout ZenithByte\r\nZenithByte is committed to empowering students and graduates by providing real-world exposure to Machine Learning and Data Science. The organization bridges the gap between academic learning and industry expectations through live projects, expert mentorship, and performance-driven career opportunities.\r\nRole Overview\r\nAs a Machine Learning Intern, you will work with real datasets to design predictive models and explore modern AI and ML tools. This role focuses on strengthening analytical and technical skills while contributing to automation and data-driven decision-making initiatives.\r\nRoles & Responsibilities\r\nDesign, train, and optimize machine learning models for real-world applications\r\nPerform data preprocessing, feature engineering, and model evaluation\r\nDevelop predictive algorithms and data-driven solutions\r\nWork with ML frameworks such as TensorFlow, PyTorch, and Scikit-learn\r\nDocument insights, experiments, and model performance in technical reports\r\nRequirements\r\nCurrently enrolled in or recently graduated from Computer Science, AI, Data Science, or related fields\r\nStrong understanding of machine learning algorithms and data analysis concepts\r\nProficiency in Python (preferred) or R, with hands-on experience using ML libraries\r\nFamiliarity with data visualization tools and model evaluation techniques\r\nStrong analytical thinking, communication, and teamwork skills\r\nWhat You Will Gain\r\nHands-on experience with real-world machine learning projects\r\nPerformance-based stipend up to ₹7,499\r\nSwags and goodies\r\nCertificate of Internship upon completion\r\nLetter of Recommendation based on performance\r\nOpportunity to build an industry-ready ML portfolio\r\nPotential full-time role based on performance\r\nEqual Opportunity Statement\r\nZenithByte is an equal opportunity organization committed to diversity and inclusion, welcoming applicants from all backgrounds and experiences.\r\n\r\nJob search faster with Premium\r\nAccess company insights like strategic priorities, headcount trends, and more\r\n\r\n\r\n\r\n\r\nMillions of members use Premium\r\n\r\nTry Premium for ₹0\r\n1 month free. Easy to cancel. No penalties or fees.\r\n\r\n",
    "timestamp": "2026-01-11T12:49:51.804465"
},
{
    "id": 13,
    "raw_text": "Data Science Intern (Python, SQL, Pandas)\r\nIndia · 18 hours ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn\r\n\r\n\r\nRemote\r\n\r\nInternship\r\n\r\nApply\r\n\r\nSave\r\nSave Data Science Intern (Python, SQL, Pandas) at SkillFied Mentor\r\nData Science Intern (Python, SQL, Pandas)\r\nSkillFied Mentor · India (Remote)\r\n\r\nApply\r\n\r\nSave\r\nSave Data Science Intern (Python, SQL, Pandas) at SkillFied Mentor\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nMeet the hiring team\r\nAnuj Sharma\r\nAnuj Sharma  \r\n 3rd+\r\nDigital Marketer || Website Developer ( wordpress) || Google & Facebook Ads executive || Canva Designer\r\nJob poster\r\n\r\nMessage\r\nAbout the job\r\n🚀 Hiring: Data Science Intern (Python, SQL, Pandas)\r\n\r\nWe are seeking passionate and driven Data Science Interns who are eager to learn, work with real datasets, and build a strong foundation in data science.\r\n\r\n🔍 Roles & Responsibilities\r\n\r\nWork with data using Python, SQL, and Pandas\r\n\r\nPerform data cleaning, preprocessing, and exploratory data analysis (EDA)\r\n\r\nBuild basic data models and generate insights\r\n\r\nCreate reports and visualizations to support business decisions\r\n\r\nCollaborate with the team on real-world data projects\r\n\r\n✅ Eligibility Criteria\r\n\r\nFreshers and students are welcome\r\n\r\nBasic knowledge of Python, SQL, and Pandas\r\n\r\nUnderstanding of data analysis concepts\r\n\r\nCurious mindset and willingness to learn\r\n\r\n🌐 Internship Details\r\n\r\n📍 Mode: Virtual / Remote\r\n\r\n⏳ Duration: Flexible\r\n\r\n💰 Stipend: Not stipend based\r\n\r\n🌟 Perks & Benefits\r\n\r\nHands-on experience with real datasets\r\n\r\nInternship Certificate\r\n\r\nSkill development & project-based learning\r\n\r\n⭐ Top performers will receive 100% placement support\r\n\r\n📌 How to Apply\r\n\r\nInterested candidates can apply by clicking on the “Apply” option.\r\n\r\n🗓️ Apply before 15th January to be considered.\r\n\r\n\r\n",
    "timestamp": "2026-01-11T12:50:19.788968"
},
{
    "id": 14,
    "raw_text": "Data Scientist \r\nNew Delhi, Delhi, India · 3 weeks ago · Over 100 applicants\r\nPromoted by hirer · Actively reviewing applicants\r\n\r\n\r\nOn-site\r\n\r\nFull-time\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Data Scientist  at Tata Consultancy Services\r\nData Scientist\r\nTata Consultancy Services · New Delhi, Delhi, India (On-site)\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Data Scientist  at Tata Consultancy Services\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nMeet the hiring team\r\nShiva Upadhyay\r\nShiva Upadhyay  \r\n 3rd+\r\nExperienced HR Professional | Talent Acquisition | Lateral Experienced Hiring | Driving Organization Growth & People- Centric Solutions | Campus Recruitment | HR Executive at Tata Consultancy Services\r\nJob poster\r\n\r\nMessage\r\nAbout the job\r\nJob Description:\r\n\r\nMachine Learning:\r\n\r\n1. Python (Advance level with complex algorithms)\r\n2. R (Advance level with complex algorithms)\r\nVisualization\r\n\r\n1. Monitoring with Prometheus and Grafana\r\n2. Tableau and Click View\r\nContainer and Storage:\r\n\r\n1. Kubernetes and Docker\r\n\r\nWorking knowledge of Data Management Platforms:\r\n\r\n1. NiFi, Kafka, HDFS, Hive\r\n2. PostgreSQL\r\n3. NetApp storage\r\n4. IBM Spectrum Scale storage\r\n5. FreeIPA role-based access control (RBAC)\r\n\r\n\r\nDomain Knowledge:\r\n\r\n\r\n\r\n1. Approx. 8 to 15 years’ industry experience, preferably in Telecom. Major part of this in implementation of artificial intelligence-based technologies to enhance operations and processes.\r\n2. Sound knowledge of Cisco hardware, RF, RAN, Transport, Core and Applications.\r\n3. OR Previous working experience as a Machine Learning/ Data Scientist for more than 10 years\r\n4. Master or greater degree in Data science, computer science, mathematics, or statistics from a nationally or internationally recognized institution. \r\n\r\n\r\nRoles and Responsibility:\r\n\r\n1. The ML specialist/consultant will include the development of strategic related outlooks, roadmaps with tangible milestones and deliverables.\r\n2. This role requires the ability to guide and mentor multidisciplinary technology teams, support development of training plans for employees within the field of Artificial Intelligence and Machine Learning.\r\n3. Propose new strategies and develop plans to expand the field of application of Machine learning and artificial intelligence within Telecom Network space.\r\n4. Maintain up to date on new trends and techniques for data science-based applications in wireless or wireline network to ensure a resilient plan for value realization\r\n\r\nJob search faster with Premium\r\nAccess company insights like strategic priorities, headcount trends, and more\r\n\r\n\r\n\r\n\r\nMillions of members use Premium\r\n\r\nTry Premium for ₹0\r\n1 month free. Easy to cancel. No penalties or fees.\r\n\r\nAbout the company\r\nTata Consultancy Services company logo\r\nTata Consultancy Services\r\n18,396,547 followers\r\n\r\nFollow\r\nIT Services and IT Consulting  10,001+ employees  693,991 on LinkedIn\r\nTata Consultancy Services (TCS) is an IT services, consulting, and business solutions organization that has been partnering with many of the world’s largest businesses in their transformation journeys since its inception in 1968. Our consulting led, innovation-driven services help businesses evolve as perpetually adaptive enterprises, staying ahead in an ever changing digital landscape. Recognized for excellence in software development, we rapidly apply and scale new technologies, driving long-term value and scalable transformation. Many of these relationships have endured for decades, navigating every technology cycle from mainframes in the 1970s to Artificial Intelligence today.\r\n\r\nA part of the Tata Group, India’s largest multinational business group, TCS has a highly skilled workforce spread across 55 countries and 202 service delivery centers across the world.\r\n\r\nCaution against fraudulent job offers: TCS doesn’t charge any fee throughout the recruitment process. Refer here: https://www.tcs.com/careers/india/recruitment-fraud-alert\r\n…\r\nshow more\r\n\r\nInterested in working with us in the future?\r\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company\r\n\r\n\r\n",
    "timestamp": "2026-01-11T12:50:47.782474"
},
{
    "id": 15,
    "raw_text": "Junior AI & Data Engineer\r\nBengaluru, Karnataka, India · 2 weeks ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn\r\n\r\n\r\nRemote\r\n\r\nFull-time\r\n\r\nApply\r\n\r\nSave\r\nSave Junior AI & Data Engineer at OmniReach\r\nJunior AI & Data Engineer\r\nOmniReach · Bengaluru, Karnataka, India (Remote)\r\n\r\nApply\r\n\r\nSave\r\nSave Junior AI & Data Engineer at OmniReach\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nAbout the job\r\nJob Description\r\nThis is a remote position.\r\nRole Overview\r\nWe are hiring smart, analytical freshers and early-career engineers passionate about data, mathematics, problem-solving, and building systems. This is a developmental role aimed at nurturing strong fundamentals in Data Science, Machine Learning, and Data Engineering over time. You will work on real-world data problems, assisting in building AI/ML solutions and data pipelines under the mentorship of senior engineers and scientists.\r\n________________________________________\r\nKey Responsibilities\r\n• Assist in data collection, cleaning, transformation, and analysis for machine learning projects.\r\n• Write clean, efficient Python code for data preparation, ETL processes, and feature engineering.\r\n• Support the development of basic ML models under guidance — starting with regression, classification, and clustering.\r\n• Create dashboards, reports, or simple visualizations for data insights.\r\n• Document workflows, processes, and learnings to build strong technical and analytical practices.\r\n• Learn and apply cloud concepts (AWS/GCP/Azure basics) and SQL best practices over time.\r\n\r\n\r\nRequirements\r\nRequired Skills\r\n\r\n\r\n\r\n• Strong Python programming skills: pandas, NumPy, basic scikit-learn.\r\n• Good understanding of Statistics (mean, variance, correlation, regression) and Linear Algebra basics (vectors, matrices).\r\n• Basic exposure to SQL and relational databases.\r\n• Strong logical and analytical thinking skills.\r\n• Willingness to learn Machine Learning, MLOps, and Data Engineering practices.\r\n• Ability to work in a fast-paced, agile environment with minimal supervision.\r\n\r\n\r\nPreferred Skills (Nice to Have)\r\n\r\n\r\n\r\n• Exposure to cloud platforms (AWS, GCP, Azure).\r\n• Experience with basic machine learning models or Kaggle competitions.\r\n• Basic understanding of REST APIs, Jupyter Notebooks.\r\n• Freshers who love mathematics + programming + problem-solving.\r\n\r\nJob search faster with Premium\r\nAccess company insights like strategic priorities, headcount trends, and more\r\n\r\n\r\n\r\n\r\nMillions of members use Premium\r\n\r\nTry Premium for ₹0\r\n1 month free. Easy to cancel. No penalties or fees.\r\n\r\n",
    "timestamp": "2026-01-11T12:51:15.788494"
},
{
    "id": 16,
    "raw_text": "Data Scientist (Credit) \r\nIndia · 2 days ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn\r\n\r\n\r\nRemote\r\n\r\nFull-time\r\n\r\nApply\r\n\r\nSave\r\nSave Data Scientist (Credit)  at Revolut\r\nData Scientist (Credit)\r\nRevolut · India (Remote)\r\n\r\nApply\r\n\r\nSave\r\nSave Data Scientist (Credit)  at Revolut\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nAbout the job\r\nAbout Revolut\r\n\r\nPeople deserve more from their money. More visibility, more control, and more freedom. Since 2015, Revolut has been on a mission to deliver just that. Our powerhouse of products — including spending, saving, investing, exchanging, travelling, and more — help our 65+ million customers get more from their money every day.\r\n\r\nAs we continue our lightning-fast growth,‌ 2 things are essential to our success: our people and our culture. In recognition of our outstanding employee experience, we've been certified as a Great Place to Work™. So far, we have 10,000+ people working around the world, from our offices and remotely, to help us achieve our mission. And we're looking for more brilliant people. People who love building great products, redefining success, and turning the complexity of a chaotic world into the simplicity of a beautiful solution.\r\n\r\nAbout The Role\r\n\r\nWe approach Data Science at Revolut the same way that we approach everything else – with class, logical thinking, and lots of style 😎 Let’s break it down: we take the most complex problems and create tailor-made solutions for our customers 🚀 If you’re thinking the Data team is kept in some sort of a secret den, doomed to never see the impact of their work, don’t worry - that’s not how we do things. They’re some of our best and brightest problem-solvers, deployed to the front lines to work in product teams and deliver rockstar solutions 🤘\r\n\r\nWe start with deep data analysis to understand our customers, their objectives and any issues they might have. We then use various data points and advanced machine learning algorithms, to come up with the best possible option for each client. We experiment, iterate, and build fully automated solutions, based on algorithms which self-improve with time.\r\n\r\nWe’re looking for next-level Data Scientists to board our FinTech rocket ship and shape the future of financial services apps. Phew! It’s a big task, but you won’t do it alone. 💪\r\n\r\nYou’ll be working with the toughest and most gifted professionals in Product, Design, Data Science and Engineering, on impactful projects that’ll make our company move forward ⏩\r\n\r\nWhat You’ll Be Doing\r\n\r\nBuilding models for full Retail Credit lifecycle\r\nImproving existing algorithms and building new Proofs of Concept\r\nDelivering real impact to the product through rigorous data-driven solutions\r\nResearching and then delivering PoCs into data products\r\nCollaborating with product owners, engineers, and data scientists to continually solve complex data problems\r\n\r\nWhat You'll Need\r\n\r\nExperience working in a data science team of a credit institution\r\nA Bachelor's/Master's/PhD in STEM (Mathematics, Computer Science, Engineering)\r\nExcellent knowledge of data science tools, including, python coding, SQL and production tools\r\nA deep understanding of probability and statistics fundamentals\r\nA big-picture mindset to correctly diagnose problems, produce research, and discover solutions\r\nExcellent communication and collaboration skills to partner with Product Owners and business heads\r\n\r\nBuilding a global financial super app isn’t enough. Our Revoluters are a priority, and that’s why in 2021 we launched our inaugural D&I Framework, designed to help us thrive and grow everyday. We're not just doing this because it's the right thing to do. We’re doing it because we know that seeking out diverse talent and creating an inclusive workplace is the way to create exceptional, innovative products and services for our customers. That’s why we encourage applications from people with diverse backgrounds and experiences to join this multicultural, hard-working team.\r\n\r\nImportant notice for candidates:\r\n\r\nJob scams are on the rise. Please keep these guidelines in mind when applying for any open roles.\r\n\r\n Only apply through official Revolut channels. We don’t use any third-party services or platforms for our recruitment.\r\n Always double-check the emails you receive. Make sure all communications are being done through official Revolut emails, with an @revolut.com domain.\r\n\r\nWe won't ask for payment or personal financial information during the hiring process. If anyone does ask you for this, it’s a scam. Report it immediately.\r\n\r\nBy submitting this application, I confirm that all the information given by me in this application for employment and any additional documents attached hereto are true to the best of my knowledge and that I have not wilfully suppressed any material fact. I confirm I have disclosed if applicable any previous employment with Revolut. I accept that if any of the information given by me in this application is in any way false or incorrect, my application may be rejected, any offer of employment may be withdrawn or my employment with Revolut may be terminated summarily or I may be dismissed. By submitting this application, I agree that my personal data will be processed in accordance with Revolut's Candidate Privacy Notice\r\n\r\n\r\nAbout the company\r\nRevolut company logo\r\nRevolut\r\n1,680,285 followers\r\n\r\nFollow\r\nFinancial Services  10,001+ employees  15,367 on LinkedIn\r\n",
    "timestamp": "2026-01-11T12:51:43.823073"
},
{
    "id": 17,
    "raw_text": "Data Scientist \r\nGurugram, Haryana, India · 3 weeks ago · Over 100 applicants\r\nPromoted by hirer · Actively reviewing applicants\r\n\r\n\r\nHybrid\r\n\r\nFull-time\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Data Scientist  at NAB\r\nData Scientist\r\nNAB · Gurugram, Haryana, India (Hybrid)\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Data Scientist  at NAB\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nMeet the hiring team\r\nMonika Wali\r\nMonika Wali  \r\n 3rd+\r\nSenior Talent Acquisition Specialist (People & Culture) @ NAB | E2E Tech Recruitment, Account Management.\r\nJob poster\r\n\r\nMessage\r\nAbout the job\r\nCapabilities, Experience & Qualification Requirements\r\n\r\nEssential capabilities\r\n\r\n\r\n\r\nExperience- 7-14 years\r\nLocation: Gurugram\r\n\r\n\r\n•Problem solvers - Energised by tackling complex problems. Use critical thinking, network, skills, knowledge, and available data to drive better outcomes for our customers and the bank\r\n•Are strong communicators - With experience in explaining complex issues to senior stakeholders\r\n•Are team players - Recognise and value the different perspectives and skills each team member brings.\r\n•Align to customer outcomes - You demonstrate the ability to better understand the customer and define the problem and develop solutions, that meet their needs\r\n•Continually looking for improvement - Challenge the status quo, look for better ways of doing things and passionately advocate continuous improvement\r\n•Understand Risk in data – By building sustainable outcomes that protect stakeholders and customers, and proactively address risks by making improvements in the bank’s overall risk and control environment\r\n\r\n\r\nExperience\r\n\r\n•Delivering projects with senior stakeholders\r\n•Predictive and financial modelling experience\r\n•Demonstrable knowledge and experience with Machine learning (supervised and unsupervised) – using either Python, R, SQL, Jupyter, TensorFlow, Apache Spark or a combination thereof\r\n•Engineering principles such as data sourcing, cleansing, joining and ETL\r\n•You have knowledge and experience with base analytic tools such PowerBI and Tableau\r\n•You have strong business acumen and can translate data insights into practical and actionable recommendations\r\n•Strong attention to detail and focus on quality\r\n•Ability to communicate data and insights visually to a broad audience\r\n•Knowledge and experience in local banking environment and customer behaviour\r\n\r\nJob search faster with Premium\r\nAccess company insights like strategic priorities, headcount trends, and more\r\n\r\n\r\n\r\n\r\nMillions of members use Premium\r\n\r\nTry Premium for ₹0\r\n1 month free. Easy to cancel. No penalties or fees.\r\n\r\nAbout the company\r\nNAB company logo\r\nNAB\r\n643,452 followers\r\n\r\nFollow\r\nBanking  10,001+ employees  40,054 on LinkedIn\r\nWe're here to be the most customer-centric company in Australia and New Zealand. We’re focused on what matters most and here to support you with your banking needs in any way we can. We’re open for business.\r\n\r\nConnect with us: www.nab.com.au/contact-us\r\n…\r\nshow more\r\n\r\nCommitments\r\n\r\nCareer growth and learning\r\nWe believe in careers not just jobs. All colleagues are supported to complete their Career Qualified in Banking accreditation, an externally recognised qualification run in partnership with Financial Services Institute of Australasia (FINSIA). We currently have one third of NAB colleagues accredited with the certificate. Our NAB Cloud Guild is our leading training program to build and grow the technical capabilities of our people. All NAB colleagues can upskill in architecture, security, development, operations, AI, machine learning and big data through the program. In just three years we’ve trained over 7,000 colleagues in cloud technology and delivered more than 2,700 industry recognised cloud certifications. Graduates of the Guild can become certified cloud practitioners and can continue their training to become an associate developer, associate systems operator or an associate architect in AWS or Azure technologies. To further support mobility and preparing our colleagues for augmented or new roles, all NAB colleagues have free access to online learning platforms such as Udemy.\r\n…\r\nShow more\r\nEnvironmental sustainability\r\nAt NAB, our role is to support our customers and communities through the transition and fund the investments needed to create a strong and sustainable future for Australia. As a member of the Net-Zero Banking Alliance, NAB’s goal is to align our operational and financed emissions with pathways to net-zero by 2050. We have set 2030 financed emissions reduction targets for power generation, thermal coal, oil and gas and cement and we’re now working with our customers to accomplish these. The targets we have set cover project and corporate lending to these sectors.   To support our colleagues, NAB is developing a bank-wide climate training program in partnership with the Melbourne Business School (MBS) to increase climate capability in support of the bank’s approach to supporting emissions reduction and aligning with pathways to net-zero. We also support our colleagues in reducing their home carbon footprint by offering a discount through Origin Energy for the installation of home solar power systems.  \r\n…\r\nShow more\r\nSocial impact\r\nWe're supporting our fellow Australians in times of need. Through the NAB Foundation, we offer assistance before, during, and after natural disasters, and provided over $5.6 million in grants from 2021. We've also helped over 31,000 customers facing financial hardships this year. And we're investing $6 billion towards affordable housing by 2029. Giving back to the community is important to us. Our colleagues receive 16 hours of paid leave each year to volunteer, earning $5 for every hour they can donate to a charity of their choice. We also provide skilled volunteering opportunities through programs like Jawun Indigenous secondments and our disaster resilience and recovery program. Since 2003, we've worked with Good Shepherd Australia New Zealand, governments, and community organisations to make financial resources and microfinance products accessible for low-income individuals. We established the NAB Foundation in 2008, an independent charity focused on creating positive social and environmental change. We provide grants of up to $10,000 AUD to support projects that prepare Australia for natural disasters, long-term recovery, and build resilience for the future. \r\n…\r\nShow more\r\nWork-life balance\r\nWe understand the importance of maintaining a healthy balance between professional and personal responsibilities. That's why we actively encourage flexibility in how our colleague’s work. - We support job sharing, hybrid working and compressed schedules to accommodate different needs and preferences. - NAB offers a range of leave options designed to help our colleagues achieve a healthy work-life balance. These include an extra week of annual leave, defence leave, lifestyle leave, gender affirmation leave, parental leave, prenatal leave, cultural and religious leave, special leave and sporting activities leave. - Our colleagues are also provided with a range of tools and resources to help manage their physical health and mental wellbeing. This includes an Employee Assistance Program, wellbeing initiatives and rooms in offices, discounted private health insurance and an Influenza vaccination program.  \r\n…\r\nShow more\r\nDiversity, equity, and inclusion\r\nOur people are what make us who we are. At NAB, we have created a culture where authenticity is celebrated, and we strive to reflect the diversity of our customers and community.   We are committed to:  - Achieving 40-60% gender representation at all levels by 2025, including colleagues who identify beyond the binary.   - The Valuable 500, a global commitment focused on accelerating disability inclusion  - Maintaining our gold membership with the Australian Network on Disability to promote inclusive practices and raking 3rd overall for the Access and Inclusion Index for 2022  - Offering ‘Stepping into Internships’ and ‘Neurodiversity’ programs that provide inclusive employment opportunities for colleagues with disability.  - Maintaining our platinum tier employer status with the Australian Workplace Equality Index for LGBTQIA+ inclusion  From Cultural Inclusion, Pride, First Nations, disability, and gender equity, we have employee resource groups that drive inclusion forward. We also have an Enterprise I&D Council, made up of executive representatives from all areas of the bank, committed to a culture where all colleagues can thrive.   \r\n…\r\nShow more\r\nLearn more\r\nInterested in working with us in the future?\r\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company\r\n\r\n\r\n",
    "timestamp": "2026-01-11T12:52:11.852293"
},
{
    "id": 18,
    "raw_text": "Data Scientist \r\nGurugram, Haryana, India · 3 weeks ago · Over 100 applicants\r\nPromoted by hirer · Actively reviewing applicants\r\n\r\n\r\nHybrid\r\n\r\nFull-time\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Data Scientist  at NAB\r\nData Scientist\r\nNAB · Gurugram, Haryana, India (Hybrid)\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Data Scientist  at NAB\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nMeet the hiring team\r\nMonika Wali\r\nMonika Wali  \r\n 3rd+\r\nSenior Talent Acquisition Specialist (People & Culture) @ NAB | E2E Tech Recruitment, Account Management.\r\nJob poster\r\n\r\nMessage\r\nAbout the job\r\nCapabilities, Experience & Qualification Requirements\r\n\r\nEssential capabilities\r\n\r\n\r\n\r\nExperience- 7-14 years\r\nLocation: Gurugram\r\n\r\n\r\n•Problem solvers - Energised by tackling complex problems. Use critical thinking, network, skills, knowledge, and available data to drive better outcomes for our customers and the bank\r\n•Are strong communicators - With experience in explaining complex issues to senior stakeholders\r\n•Are team players - Recognise and value the different perspectives and skills each team member brings.\r\n•Align to customer outcomes - You demonstrate the ability to better understand the customer and define the problem and develop solutions, that meet their needs\r\n•Continually looking for improvement - Challenge the status quo, look for better ways of doing things and passionately advocate continuous improvement\r\n•Understand Risk in data – By building sustainable outcomes that protect stakeholders and customers, and proactively address risks by making improvements in the bank’s overall risk and control environment\r\n\r\n\r\nExperience\r\n\r\n•Delivering projects with senior stakeholders\r\n•Predictive and financial modelling experience\r\n•Demonstrable knowledge and experience with Machine learning (supervised and unsupervised) – using either Python, R, SQL, Jupyter, TensorFlow, Apache Spark or a combination thereof\r\n•Engineering principles such as data sourcing, cleansing, joining and ETL\r\n•You have knowledge and experience with base analytic tools such PowerBI and Tableau\r\n•You have strong business acumen and can translate data insights into practical and actionable recommendations\r\n•Strong attention to detail and focus on quality\r\n•Ability to communicate data and insights visually to a broad audience\r\n•Knowledge and experience in local banking environment and customer behaviour\r\n\r\nJob search faster with Premium\r\nAccess company insights like strategic priorities, headcount trends, and more\r\n\r\n\r\n\r\n\r\nMillions of members use Premium\r\n\r\nTry Premium for ₹0\r\n1 month free. Easy to cancel. No penalties or fees.\r\n\r\nAbout the company\r\nNAB company logo\r\nNAB\r\n643,452 followers\r\n\r\nFollow\r\nBanking  10,001+ employees  40,054 on LinkedIn\r\nWe're here to be the most customer-centric company in Australia and New Zealand. We’re focused on what matters most and here to support you with your banking needs in any way we can. We’re open for business.\r\n\r\nConnect with us: www.nab.com.au/contact-us\r\n…\r\nshow more\r\n\r\nCommitments\r\n\r\nCareer growth and learning\r\nWe believe in careers not just jobs. All colleagues are supported to complete their Career Qualified in Banking accreditation, an externally recognised qualification run in partnership with Financial Services Institute of Australasia (FINSIA). We currently have one third of NAB colleagues accredited with the certificate. Our NAB Cloud Guild is our leading training program to build and grow the technical capabilities of our people. All NAB colleagues can upskill in architecture, security, development, operations, AI, machine learning and big data through the program. In just three years we’ve trained over 7,000 colleagues in cloud technology and delivered more than 2,700 industry recognised cloud certifications. Graduates of the Guild can become certified cloud practitioners and can continue their training to become an associate developer, associate systems operator or an associate architect in AWS or Azure technologies. To further support mobility and preparing our colleagues for augmented or new roles, all NAB colleagues have free access to online learning platforms such as Udemy.\r\n…\r\nShow more\r\nEnvironmental sustainability\r\nAt NAB, our role is to support our customers and communities through the transition and fund the investments needed to create a strong and sustainable future for Australia. As a member of the Net-Zero Banking Alliance, NAB’s goal is to align our operational and financed emissions with pathways to net-zero by 2050. We have set 2030 financed emissions reduction targets for power generation, thermal coal, oil and gas and cement and we’re now working with our customers to accomplish these. The targets we have set cover project and corporate lending to these sectors.   To support our colleagues, NAB is developing a bank-wide climate training program in partnership with the Melbourne Business School (MBS) to increase climate capability in support of the bank’s approach to supporting emissions reduction and aligning with pathways to net-zero. We also support our colleagues in reducing their home carbon footprint by offering a discount through Origin Energy for the installation of home solar power systems.  \r\n…\r\nShow more\r\nSocial impact\r\nWe're supporting our fellow Australians in times of need. Through the NAB Foundation, we offer assistance before, during, and after natural disasters, and provided over $5.6 million in grants from 2021. We've also helped over 31,000 customers facing financial hardships this year. And we're investing $6 billion towards affordable housing by 2029. Giving back to the community is important to us. Our colleagues receive 16 hours of paid leave each year to volunteer, earning $5 for every hour they can donate to a charity of their choice. We also provide skilled volunteering opportunities through programs like Jawun Indigenous secondments and our disaster resilience and recovery program. Since 2003, we've worked with Good Shepherd Australia New Zealand, governments, and community organisations to make financial resources and microfinance products accessible for low-income individuals. We established the NAB Foundation in 2008, an independent charity focused on creating positive social and environmental change. We provide grants of up to $10,000 AUD to support projects that prepare Australia for natural disasters, long-term recovery, and build resilience for the future. \r\n…\r\nShow more\r\nWork-life balance\r\nWe understand the importance of maintaining a healthy balance between professional and personal responsibilities. That's why we actively encourage flexibility in how our colleague’s work. - We support job sharing, hybrid working and compressed schedules to accommodate different needs and preferences. - NAB offers a range of leave options designed to help our colleagues achieve a healthy work-life balance. These include an extra week of annual leave, defence leave, lifestyle leave, gender affirmation leave, parental leave, prenatal leave, cultural and religious leave, special leave and sporting activities leave. - Our colleagues are also provided with a range of tools and resources to help manage their physical health and mental wellbeing. This includes an Employee Assistance Program, wellbeing initiatives and rooms in offices, discounted private health insurance and an Influenza vaccination program.  \r\n…\r\nShow more\r\nDiversity, equity, and inclusion\r\nOur people are what make us who we are. At NAB, we have created a culture where authenticity is celebrated, and we strive to reflect the diversity of our customers and community.   We are committed to:  - Achieving 40-60% gender representation at all levels by 2025, including colleagues who identify beyond the binary.   - The Valuable 500, a global commitment focused on accelerating disability inclusion  - Maintaining our gold membership with the Australian Network on Disability to promote inclusive practices and raking 3rd overall for the Access and Inclusion Index for 2022  - Offering ‘Stepping into Internships’ and ‘Neurodiversity’ programs that provide inclusive employment opportunities for colleagues with disability.  - Maintaining our platinum tier employer status with the Australian Workplace Equality Index for LGBTQIA+ inclusion  From Cultural Inclusion, Pride, First Nations, disability, and gender equity, we have employee resource groups that drive inclusion forward. We also have an Enterprise I&D Council, made up of executive representatives from all areas of the bank, committed to a culture where all colleagues can thrive.   \r\n…\r\nShow more\r\nLearn more\r\nInterested in working with us in the future?\r\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company\r\n\r\n\r\n",
    "timestamp": "2026-01-11T12:52:39.837982"
},
{
    "id": 19,
    "raw_text": "Data Scientist \r\nGurgaon, Haryana, India · 1 day ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn\r\n\r\n\r\nHybrid\r\n\r\nFull-time\r\n\r\nApply\r\n\r\nSave\r\nSave Data Scientist  at Gartner\r\n\r\nData Scientist\r\nGartner · Gurgaon, Haryana, India (Hybrid)\r\n\r\nApply\r\n\r\nSave\r\nSave Data Scientist  at Gartner\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nAbout the job\r\nGlobal Sales & Services Operations (GSSO) is the team that helps shape Gartner's mission-critical sales priorities and works with sales & services leaders to drive tactical and analytical insights. As an associate on the GSSO team, you'll be at the forefront of the ongoing transformation of Gartner's sales force, which delivers approximately $4.9B in annual revenue and working to drive sustained double-digit growth. You will partner with business leaders across Gartner to support a global sales force comprised of more than 5,000 associates who sell to every major function, industry and market sector around the world.\r\n\r\nAbout this role: \r\n\r\nThis role will be a part of the Global Sales and Services Technology team in GSSO. This team innovates the way our team helps clients receive value, so technology leaders will be able to make smarter decisions in a different way.\r\n\r\nWe are looking for a talented Data Scientist to join the team. The individual will have access to the best facilities, technology and expertise within the industry and will work on challenging business problems. This is an excellent opportunity to be part of a new venture, in a start-up environment where you can truly develop your skill set and knowledge and bring impact to the team.\r\n\r\nWhat you will do:\r\n\r\nDesigning and implementing state-of-the-art Large Language Model (LLM) based agents that seamlessly synthesize complex information and initiate important actions in a business workflow. \r\nUsing advanced Generative AI techniques and/ or NLP for deriving actionable insights from unstructured text data, such as call transcripts and emails. \r\nPredicting client interest basis their digital footprint and making relevant recommendations to drive higher client value delivery, using NLP techniques with ML. \r\nLeverage statistical and machine learning techniques to extract actionable insights from client retention data. \r\nBuild tools to process structured and unstructured data\r\nEngineering features and signals to train ML model from diverse data collection\r\n\r\nWhat you will need:\r\n\r\nBS/MS/PhD in Computer Science or other technology, Math, Physics, Statistics or Economics (focus on Natural Language Processing, Information Retrieval a plus)\r\n3+ years of experience in data science methodologies as applied to live initiatives or software development\r\nMinimum 3+ years of experience in python coding and statistical analysis\r\nMinimum 2 years of working experience in the following:\r\nNatural Language Processing and Information Retrieval\r\nPrompt Engineering and working with LLMs\r\nStatistical techniques\r\nData mining and recommendation systems\r\nExperience working with large volumes of data\r\nUser behavior modeling\r\nCollaborative, inclusive and respectful of diverse perspectives \r\nProven ability to manage tasks end-to-end and meet deadlines\r\nDetail-oriented with strong organizational skills and innovative mindset. \r\n\r\nWhat you will get:\r\n\r\nCompetitive salary, generous paid time off policy, charity match program, Group Medical Insurance, Parental Leave, Employee Assistance Program (EAP) and more!\r\nCollaborative, team-oriented culture that embraces diversity \r\nProfessional development and unlimited growth opportunities\r\n\r\n#GSSO\r\n\r\nWho are we? \r\n\r\nAt Gartner, Inc. (NYSE:IT), we guide the leaders who shape the world.\r\n\r\nOur mission relies on expert analysis and bold ideas to deliver actionable, objective business and technology insights, helping enterprise leaders and their teams succeed with their mission-critical priorities.\r\n\r\nSince our founding in 1979, we’ve grown to 21,000 associates globally who support ~14,000 client enterprises in ~90 countries and territories. We do important, interesting and substantive work that matters. That’s why we hire associates with the intellectual curiosity, energy and drive to want to make a difference. The bar is unapologetically high. So is the impact you can have here.\r\n\r\nWhat makes Gartner a great place to work? \r\n\r\nOur vast, virtually untapped market potential offers limitless opportunities – opportunities that may not even exist right now – for you to grow professionally and flourish personally. How far you go is driven by your passion and performance.\r\n\r\nWe hire remarkable people who collaborate and win as a team. Together, our singular, unifying goal is to deliver results for our clients.\r\n\r\nOur teams are inclusive and composed of individuals from different geographies, cultures, religions, ethnicities, races, genders, sexual orientations, abilities and generations.\r\n\r\nWe invest in great leaders who bring out the best in you and the company, enabling us to multiply our impact and results. This is why, year after year, we are recognized worldwide as a great place to work.\r\n\r\nWhat do we offer? \r\n\r\nGartner offers world-class benefits, highly competitive compensation and disproportionate rewards for top performers.\r\n\r\nIn our hybrid work environment, we provide the flexibility and support for you to thrive — working virtually when it's productive to do so and getting together with colleagues in a vibrant community that is purposeful, engaging and inspiring.\r\n\r\nReady to grow your career with Gartner? Join us.\r\n\r\nThe policy of Gartner is to provide equal employment opportunities to all applicants and employees without regard to race, color, creed, religion, sex, sexual orientation, gender identity, marital status, citizenship status, age, national origin, ancestry, disability, veteran status, or any other legally protected status and to seek to advance the principles of equal employment opportunity.\r\n\r\nGartner is committed to being an Equal Opportunity Employer and offers opportunities to all job seekers, including job seekers with disabilities. If you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation if you are unable or limited in your ability to use or access the Company’s career webpage as a result of your disability. You may request reasonable accommodations by calling Human Resources at +1 (203) 964-0096 or by sending an email to ApplicantAccommodations@gartner.com.\r\n\r\nJob Requisition ID:106563\r\n\r\nBy submitting your information and application, you confirm that you have read and agree to the country or regional recruitment notice linked below applicable to your place of residence.\r\n\r\nGartner Applicant Privacy Link: https://jobs.gartner.com/applicant-privacy-policy\r\n\r\nFor efficient navigation through the application, please only use the back button within the application, not the back arrow within your browser.\r\n\r\n\r\nBenefits found in job post\r\n\r\nMedical insurance\r\nAbout the company\r\nGartner company logo\r\nGartner\r\n2,141,818 followers\r\n\r\nFollow\r\n",
    "timestamp": "2026-01-11T12:53:07.826520"
},
{
    "id": 20,
    "raw_text": "Data Scientist \r\nIndia · 1 day ago · Over 100 applicants\r\nPromoted by hirer · Actively reviewing applicants\r\n\r\n\r\nRemote\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Data Scientist  at MatchPoint\r\nData Scientist\r\nMatchPoint · India (Remote)\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Data Scientist  at MatchPoint\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nMeet the hiring team\r\nJaya Lakshmi Vunnava\r\nJaya Lakshmi Vunnava  \r\n 3rd+\r\nHuman Resources and Technical Recruiter\r\nJob poster\r\n\r\nMessage\r\nAbout the job\r\nWe are seeking a highly skilled and motivated Data Scientist to join our team. The ideal candidate will have a strong background in data analysis, deep learning, and GenAI. This role involves extracting meaningful insights from complex datasets and translating them into actionable strategies that drive business growth. You will collaborate with cross-functional teams to design and implement data-driven solutions to solve real-world problems.\r\nJob Experience Requirements:\r\n\r\n \r\nQualifications:\r\n\r\n· Education: Master’s in data science, Statistics, Computer Science, or a related field.\r\n· Experience: 3+ years of experience in data science, analytics, or a related field.\r\n· Technical Skills:\r\no Proficiency in programming languages such as Python or R.\r\no Good understanding of statistical principles for ML applications\r\no Experience with data manipulation and analysis using libraries such as pandas, NumPy, and SciPy.\r\no Exceptional knowledge of Deep Learning techniques, model architectures, and parameter fine-tuning\r\no Very good knowledge of GenAI with good understanding of foundation models and transformer architecture\r\no Familiarity with data visualization tools (e.g., Matplotlib, Seaborn).\r\no Experience with SQL and relational databases.\r\no Knowledge of big data technologies (e.g., Hadoop, Spark) is a plus.\r\n· Soft Skills:\r\nExcellent problem-solving abilities, strong communication skills, and the ability to work effectively in a team environment.\r\n· Additional Skills (Preferred):\r\n\r\no Experience with cloud platforms (e.g., AWS, Google Cloud, Azure).\r\no Familiarity with version control systems (e.g., Git).\r\no Experience in genomics\r\nJob Responsibilities:\r\n\r\n \r\n· Data Analysis: Analyze large, complex datasets to identify trends, patterns, and insights that inform business decisions.\r\n· Model Development: Develop, implement, and validate predictive models and machine learning algorithms to solve various business problems.\r\n· Data Cleaning: Preprocess and clean data to ensure its quality and integrity before analysis.\r\n· Visualization: Create data visualizations and dashboards to communicate findings to stakeholders in a clear and concise manner.\r\n· Collaboration: Work closely with cross-functional teams, including engineering, product management, and marketing, to understand their data needs and provide relevant insights.\r\n· Reporting: Generate comprehensive reports and presentations that summarize key findings and recommendations.\r\n\r\nJob search faster with Premium\r\nAccess company insights like strategic priorities, headcount trends, and more\r\n\r\n\r\n\r\n\r\nMillions of members use Premium\r\n\r\nTry Premium for ₹0\r\n1 month free. Easy to cancel. No penalties or fees.\r\n\r\n",
    "timestamp": "2026-01-11T12:53:35.810941"
},
{
    "id": 21,
    "raw_text": "Data Scientist \r\nNoida, Uttar Pradesh, India · Reposted 3 weeks ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn\r\n\r\n\r\nHybrid\r\n\r\nFull-time\r\n\r\nApply\r\n\r\nSave\r\nSave Data Scientist  at LTIMindtree\r\n\r\nData Scientist\r\nLTIMindtree · Noida, Uttar Pradesh, India (Hybrid)\r\n\r\nApply\r\n\r\nSave\r\nSave Data Scientist  at LTIMindtree\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nMeet the hiring team\r\nMonica Sharma\r\nMonica Sharma  \r\n 3rd+\r\nNow Hiring: AI Tech skills | Gen AI (LLMOps, RAG Pipelines, Agentic AI Frameworks), AI/ML, Deep Learning, AIOps, Python | Sr. Recruiter || LTIMindtree\r\nJob poster\r\n\r\nMessage\r\nAbout the job\r\nData Scientist - GENAI\r\n\r\n\r\n\r\nWe are looking for a Data Scientist who will support building AI tools for customers. The candidate should be skilled at using large data sets to find opportunities for product and process optimization. The candidate must have a proven ability to drive business results with their data-based insights. The candidate must be comfortable working with a wide range of stakeholders and functional teams.\r\n\r\n\r\nPrimary Skills – Data Science, Python, AI, ML (Machine Learning) Gen AI – Generative AI\r\n\r\n\r\n\r\nSecondary Skills – NLP, LLM, Deep Learning, Cloud (AWS/Cloud)\r\n\r\n\r\nHiring Location: PAN India\r\n\r\n\r\nResponsibilities for Data Scientist:\r\n\r\n\r\n\r\nWork with stakeholders to identify opportunities for leveraging data to drive business solutions.\r\nMine and analyse data from databases to drive optimization and improvement of product development and business strategies.\r\nAssess the effectiveness and accuracy of new data sources and data gathering techniques.\r\nDevelop custom models and algorithms to apply to data sets.\r\nUse predictive modelling to increase and optimize customer experiences.\r\nCoordinate with different functional teams to implement models and monitor outcomes.\r\nAnalyse large amounts of information to discover trends and patterns.\r\nBuild predictive models and machine-learning algorithms.\r\nPresent information using data visualization techniques .\r\nGood to have a knowledge of ML lifecycle and model governance.\r\n\r\n\r\nQualifications for Data Scientist\r\n\r\n\r\n\r\nLooking for someone with 5-8 years of experience manipulating data sets and building statistical models, having bachelor’s or master’s degree in Statistics, Mathematics, Computer Science or another quantitative field, and is familiar with the following software/tools.\r\nExperience using statistical computer languages (R, Python etc.) to manage data and draw insights from large data sets.\r\nKnowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, XGBoost, KNN, SVM, ANN, etc.).\r\nKnowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.\r\nKnowledge and experience in statistical and data mining techniques: GLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc.\r\nExperience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.\r\nExperience visualizing/presenting data for stakeholders\r\nExperience with Snowflake will be an added advantage\r\nExperience in deployment of machine learning models using cloud technologies\"\r\n\r\nJob search faster with Premium\r\nAccess company insights like strategic priorities, headcount trends, and more\r\n\r\n\r\n\r\n\r\nMillions of members use Premium\r\n\r\nTry Premium for ₹0\r\n1 month free. Easy to cancel. No penalties or fees.\r\n\r\nAbout the company\r\nLTIMindtree company logo\r\nLTIMindtree\r\n5,098,155 followers\r\n\r\nFollow\r\nIT Services and IT Consulting  10,001+ employees  113,998 on LinkedIn\r\nLTIMindtree is a global technology consulting and digital solutions company that partners with enterprises across industries to reimagine business models, accelerate innovation, and drive AI-centric growth. Trusted by more than 700 clients worldwide, we use advanced technologies to enable operational excellence, elevated customer experiences, and long-term value creation.\r\n\r\nWith a workforce of more than 86,000 talented and entrepreneurial professionals across over 40 countries, LTIMindtree — a Larsen & Toubro Group company — is dedicated to solving complex business challenges and delivering transformation at scale.\r\n\r\nLTIMindtree is proud to be an equal opportunity employer. We are committed to providing equal employment opportunities regardless of race, ethnicity, nationality, gender, gender identity, gender expression, language, age, sexual orientation, religion, marital status, veteran status, socio-economic status, disability, or any other characteristic protected by applicable law.\r\n\r\nPlease note that neither LTIMindtree nor any of its authorized recruitment agencies/partners charge candidates any registration fees or other fees for appearing in interviews or securing employment/internships. Candidates are solely responsible for verifying the credentials of any agency or consultant claiming to work with LTIMindtree for recruitment purposes. Please note that anyone relying on representations made by fraudulent employment agencies/consultant does so at their own risk. LTIMindtree disclaims any liability for loss or damage suffered as a result of such actions.\r\n\r\nFor more info, please visit www.ltimindtree.com.\r\n…\r\nshow more\r\n\r\nInterested in working with us in the future?\r\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company\r\n\r\n\r\n",
    "timestamp": "2026-01-11T12:54:03.856333"
},
{
    "id": 22,
    "raw_text": "Data Scientist (AI) - Spendscape \r\nGurugram, Haryana, India · 4 days ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn\r\n\r\n\r\nFull-time\r\n\r\nApply\r\n\r\nSave\r\nSave Data Scientist (AI) - Spendscape  at McKinsey & Company\r\nData Scientist (AI) - Spendscape\r\nMcKinsey & Company · Gurugram, Haryana, India\r\n\r\nApply\r\n\r\nSave\r\nSave Data Scientist (AI) - Spendscape  at McKinsey & Company\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nAbout the job\r\nWho You'll Work With\r\n\r\nDriving lasting impact and building long-term capabilities with our clients is not easy work. You are the kind of person who thrives in a high performance/high reward culture - doing hard things, picking yourself up when you stumble, and having the resilience to try another way forward.\r\n\r\nIn return for your drive, determination, and curiosity, we'll provide the resources, mentorship, and opportunities you need to become a stronger leader faster than you ever thought possible. Your colleagues—at all levels—will invest deeply in your development, just as much as they invest in delivering exceptional results for clients. Every day, you'll receive apprenticeship, coaching, and exposure that will accelerate your growth in ways you won’t find anywhere else.\r\n\r\nWhen you join us, you will have:\r\n\r\nContinuous learning: Our learning and apprenticeship culture, backed by structured programs, is all about helping you grow while creating an environment where feedback is clear, actionable, and focused on your development. The real magic happens when you take the input from others to heart and embrace the fast-paced learning experience, owning your journey.\r\nA voice that matters: From day one, we value your ideas and contributions. You’ll make a tangible impact by offering innovative ideas and practical solutions, all while upholding our unwavering commitment to ethics and integrity. We not only encourage diverse perspectives, but they are critical in driving us toward the best possible outcomes.\r\nGlobal community: With colleagues across 65+ countries and over 100 different nationalities, our firm’s diversity fuels creativity and helps us come up with the best solutions for our clients. Plus, you’ll have the opportunity to learn from exceptional colleagues with diverse backgrounds and experiences.\r\nWorld-class benefits: On top of a competitive salary (based on your location, experience, and skills), we provide a comprehensive benefits package to enable holistic well-being for you and your family.\r\n\r\nYour Impact\r\n\r\nAs a Data Scientist, you’ll collaborate with product managers, engineers, and solution leaders to design, implement, and deploy advanced AI/ML models.\r\n\r\nYou will take ownership of end-to-end workflows — from data preparation and modeling to production deployment and monitoring.\r\n\r\nYour key responsibilities will include applying machine learning and statistical techniques to address high-impact business challenges. You will develop and fine-tune large language models (LLMs) and implement Generative AI (GenAI) solutions tailored to procurement and analytics use cases. Additionally, you will build and deploy scalable APIs using FastAPI to serve models efficiently, while contributing to the design of production-ready, scalable data pipelines and AI services. Ensuring model reliability and fairness through rigorous validation, testing, and monitoring will be a crucial part of your role.\r\n\r\nYou will also stay current with the latest advancements in AI, GenAI, and agentic systems, integrating innovative approaches into practical solutions. Collaboration within an Agile/SCRUM environment and close coordination with cross-functional teams will be essential to successfully deliver impactful outcomes.\r\n\r\nYou’ll work with the Spendscape team in Gurugram. Spendscape is a McKinsey company that combines technology, data science, and domain expertise to help organizations drive spend transparency, advanced analytics, and value capture in procurement.\r\n\r\nYou’ll be part of a global team of data scientists, engineers, and procurement experts, building and scaling AI-powered solutions for clients across industries. Spendscape integrates best-in-class technology, GenAI, and machine learning to deliver impact on complex business problems.\r\n\r\nYour Qualifications and Skills\r\n\r\nBachelor’s or master’s degree in disciplines such as computer science, engineering, or related fields\r\n2+ years of deep technical experience in machine learning concepts and algorithms\r\nStrong programming skills in Python\r\nHands-on experience with FastAPI or equivalent frameworks\r\nKnowledge of GenAI and LLM technologies\r\nStrong problem-solving and analytical skills with the ability to translate business problems into technical solutions\r\nAbility to work independently and collaboratively in a global team environment\r\nKnowledge of Agentic AI and multi-agent systems\r\nExperience with cloud platforms (AWS, Azure, GCP) and container technologies (Docker/Kubernetes)\r\nFamiliarity with SQL/NoSQL databases\r\nExposure to MLOps practices (CI/CD for ML, model monitoring, automated testing)\r\n\r\nJob search faster with Premium\r\nAccess company insights like strategic priorities, headcount trends, and more\r\n\r\n\r\n\r\n\r\nMillions of members use Premium\r\n\r\nTry Premium for ₹0\r\n1 month free. Easy to cancel. No penalties or fees.\r\n\r\nAbout the company\r\nMcKinsey &amp; Company company logo\r\nMcKinsey & Company\r\n6,901,949 followers\r\n\r\nFollow\r\nBusiness Consulting and Services  10,001+ employees  38,764 on LinkedIn\r\nMcKinsey & Company is a global management consulting firm. We are the trusted advisor to the world's leading businesses, governments, and institutions.\r\n\r\nWe work with leading organizations across the private, public and social sectors. Our scale, scope, and knowledge allow us to address problems that no one else can. We have deep functional and industry expertise as well as breadth of geographical reach. We are passionate about taking on immense challenges that matter to our clients and, often, to the world.\r\n\r\nWe work with our clients as we do with our colleagues. We build their capabilities and leadership skills at every level and every opportunity. We do this to help build internal support, get to real issues, and reach practical recommendations. We bring out the capabilities of clients to fully participate in the process and lead the ongoing work.\r\n…\r\nshow more\r\n\r\nInterested in working with us in the future?\r\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company\r\n\r\n\r\n",
    "timestamp": "2026-01-11T12:54:31.890518"
},
{
    "id": 23,
    "raw_text": "ML Scientist – Fully Remote\r\nIndia · 20 hours ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn\r\n\r\n\r\n$14/hr\r\n\r\nRemote\r\n\r\nPart-time\r\n\r\nApply\r\n\r\nSave\r\nSave ML Scientist – Fully Remote at Mercor\r\nML Scientist – Fully Remote\r\nMercor · India (Remote)\r\n\r\nApply\r\n\r\nSave\r\nSave ML Scientist – Fully Remote at Mercor\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nMeet the hiring team\r\nKuai Y. is hiring\r\nKuai Y.  \r\n 3rd+\r\nMercor | Citadel | Two Sigma | Google\r\nJob poster\r\n\r\nMessage\r\nAbout the job\r\nAbout The Job\r\n\r\nMercor connects elite creative and technical talent with leading AI research labs. Headquartered in San Francisco, our investors include Benchmark, General Catalyst, Peter Thiel, Adam D'Angelo, Larry Summers, and Jack Dorsey.\r\n\r\nPosition: Data Scientist\r\n\r\nType: Part-time\r\n\r\nCompensation: $14/hour\r\n\r\nLocation: India\r\n\r\nCommitment: 20–40 hours/week\r\n\r\nRole Responsibilities\r\n\r\nDevelop data collection and preprocessing pipelines for structured and unstructured data from multiple agent simulations.\r\nBuild and iterate on machine learning models for performance prediction, behavior clustering, and outcome optimization.\r\nDesign and maintain dashboards and visualization tools for monitoring agent performance, benchmarks, and trends.\r\nConduct statistical analyses to evaluate the efficacy of AI systems under various environments and constraints.\r\nCollaborate with engineers to design evaluation frameworks that measure reasoning quality, adaptability, and efficiency.\r\nPrototype data-driven tools and feedback loops to automatically improve model accuracy and agent behavior over time.\r\n\r\nQualifications\r\n\r\nMust-Have\r\n\r\nStrong background in data science, machine learning, or applied statistics.\r\nProficiency in Python, SQL, and familiarity with Pandas, NumPy, Scikit-learn, PyTorch/TensorFlow.\r\nUnderstanding of probabilistic modeling, statistical inference, and experimentation frameworks.\r\nExperience with large-scale data systems like Snowflake or BigQuery.\r\n\r\nPreferred\r\n\r\nCuriosity about AI agents and data's role in shaping their reasoning and behavior.\r\nEnjoyment in collaborating with cross-functional teams to define KPIs and experiment setups.\r\n\r\nCompensation & Legal\r\n\r\nWeekly bonus of $500 - $1000 USD per 5 tasks created.\r\n\r\nApplication Process (Takes 20–30 mins to complete)\r\n\r\nUpload resume\r\nAI interview based on your resume\r\nSubmit form\r\n\r\nResources & Support\r\n\r\nFor details about the interview process and platform information, please check: https://talent.docs.mercor.com/welcome/welcome\r\nFor any help or support, reach out to: support@mercor.com\r\n\r\nPS: Our team reviews applications daily. Please complete your AI interview and application steps to be considered for this opportunity.\r\n\r\n,\r\n\r\n\r\nJob search faster with Premium\r\nAccess company insights like strategic priorities, headcount trends, and more\r\n\r\n\r\n\r\n\r\nMillions of members use Premium\r\n\r\nTry Premium for ₹0\r\n1 month free. Easy to cancel. No penalties or fees.\r\n\r\nAbout the company\r\nMercor company logo\r\nMercor\r\n587,048 followers\r\n\r\nFollow\r\nSoftware Development  51-200 employees  3,678 on LinkedIn\r\n",
    "timestamp": "2026-01-11T12:54:59.919959"
},
{
    "id": 24,
    "raw_text": "ML Scientist – Fully Remote\r\nIndia · 20 hours ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn\r\n\r\n\r\n$14/hr\r\n\r\nRemote\r\n\r\nPart-time\r\n\r\nApply\r\n\r\nSave\r\nSave ML Scientist – Fully Remote at Mercor\r\nML Scientist – Fully Remote\r\nMercor · India (Remote)\r\n\r\nApply\r\n\r\nSave\r\nSave ML Scientist – Fully Remote at Mercor\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nMeet the hiring team\r\nKuai Y. is hiring\r\nKuai Y.  \r\n 3rd+\r\nMercor | Citadel | Two Sigma | Google\r\nJob poster\r\n\r\nMessage\r\nAbout the job\r\nAbout The Job\r\n\r\nMercor connects elite creative and technical talent with leading AI research labs. Headquartered in San Francisco, our investors include Benchmark, General Catalyst, Peter Thiel, Adam D'Angelo, Larry Summers, and Jack Dorsey.\r\n\r\nPosition: Data Scientist\r\n\r\nType: Part-time\r\n\r\nCompensation: $14/hour\r\n\r\nLocation: India\r\n\r\nCommitment: 20–40 hours/week\r\n\r\nRole Responsibilities\r\n\r\nDevelop data collection and preprocessing pipelines for structured and unstructured data from multiple agent simulations.\r\nBuild and iterate on machine learning models for performance prediction, behavior clustering, and outcome optimization.\r\nDesign and maintain dashboards and visualization tools for monitoring agent performance, benchmarks, and trends.\r\nConduct statistical analyses to evaluate the efficacy of AI systems under various environments and constraints.\r\nCollaborate with engineers to design evaluation frameworks that measure reasoning quality, adaptability, and efficiency.\r\nPrototype data-driven tools and feedback loops to automatically improve model accuracy and agent behavior over time.\r\n\r\nQualifications\r\n\r\nMust-Have\r\n\r\nStrong background in data science, machine learning, or applied statistics.\r\nProficiency in Python, SQL, and familiarity with Pandas, NumPy, Scikit-learn, PyTorch/TensorFlow.\r\nUnderstanding of probabilistic modeling, statistical inference, and experimentation frameworks.\r\nExperience with large-scale data systems like Snowflake or BigQuery.\r\n\r\nPreferred\r\n\r\nCuriosity about AI agents and data's role in shaping their reasoning and behavior.\r\nEnjoyment in collaborating with cross-functional teams to define KPIs and experiment setups.\r\n\r\nCompensation & Legal\r\n\r\nWeekly bonus of $500 - $1000 USD per 5 tasks created.\r\n\r\nApplication Process (Takes 20–30 mins to complete)\r\n\r\nUpload resume\r\nAI interview based on your resume\r\nSubmit form\r\n\r\nResources & Support\r\n\r\nFor details about the interview process and platform information, please check: https://talent.docs.mercor.com/welcome/welcome\r\nFor any help or support, reach out to: support@mercor.com\r\n\r\nPS: Our team reviews applications daily. Please complete your AI interview and application steps to be considered for this opportunity.\r\n\r\n,\r\n\r\n\r\nJob search faster with Premium\r\nAccess company insights like strategic priorities, headcount trends, and more\r\n\r\n\r\n\r\n\r\nMillions of members use Premium\r\n\r\nTry Premium for ₹0\r\n1 month free. Easy to cancel. No penalties or fees.\r\n\r\nAbout the company\r\nMercor company logo\r\nMercor\r\n587,048 followers\r\n\r\nFollow\r\nSoftware Development  51-200 employees  3,678 on LinkedIn\r\n",
    "timestamp": "2026-01-11T12:55:27.905908"
},
{
    "id": 25,
    "raw_text": "Junior Data Scientist \r\nIndia · 1 day ago · Over 100 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn\r\n\r\n\r\nRemote\r\n\r\nFull-time\r\n\r\nApply\r\n\r\nSave\r\nSave Junior Data Scientist  at High 5 Games\r\n\r\nJunior Data Scientist\r\nHigh 5 Games · India (Remote)\r\n\r\nApply\r\n\r\nSave\r\nSave Junior Data Scientist  at High 5 Games\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nAbout the job\r\nWe’re looking for a Junior Data Scientist to help shape and expand the analytics backbone of our games ecosystem. This role is both deeply technical and highly collaborative—you’ll work across teams and disciplines to transform complex data into actionable insights that drive product innovation, player engagement, and business growth. \r\n\r\nThe ideal candidate will have a quantitative background, a good understanding of statistics, logic; clean and effective communication skills, an understanding of python and a genuine interest in solving complex problems. A desire to learn quickly and iterate through difficult problems efficiently. \r\n\r\nYou’ll thrive here if you combine quantitative curiosity, a problem-solving mindset, the ability to work in ambiguous, evolving contexts, and the determination to own projects end to end, from research to real-world impact. You will play a crucial role in scaling data science products that have a direct impact on the success of High 5 Games! \r\n\r\n \r\nWhat You’ll Do \r\nDesign, implement, and maintain robust data pipelines, from event generation through ETL to clean, intelligent storage. \r\nRetrieve, process, and integrate data using APIs and webhooks, ensuring quality, accuracy, and integrity at every step. \r\nDevelop reporting layers—dashboards, automated reports, and notifications—to deliver insights across teams. \r\nCurate raw data into meaningful structures for CRM, product, and monetization teams. \r\nBuild predictive and optimization models for areas like player lifetime value, churn prediction, monetization strategies, and game recommendations. \r\nDefine and execute multivariate testing frameworks to optimize product and campaign performance. \r\nExplore and apply state-of-the-art AI and ML techniques, in real-time processes, proposing innovative approaches for real-world challenges. \r\nDeeply understand and navigate the abstract mechanics of our ecosystem—game economies, monetization levers, RTPs, and more. \r\n\r\n\r\nRequirements \r\nDegree in a quantitative field \r\nProgramming experience in a scripting language such as Python or R \r\nFundamental understanding of statistics and machine learning models \r\nKnowledge of statistical testing, data visualization, and data mining \r\nProficiency in SQL \r\nStrong problem-solving skills \r\nResilience against difficult tasks \r\nSolid and effective English communication skills \r\nAttention to detail \r\n \r\nNice to have \r\nPost Grad/Masters degree in a quantitative field or 1+ years of professional experience in a relevant field (technology/gaming/algorithms/research…) \r\nExperience working with GCP tech stack \r\nAn understanding of database design and management \r\nExperience in developing and applying machine learning algorithms to real problems\r\n\r\nJob search faster with Premium\r\nAccess company insights like strategic priorities, headcount trends, and more\r\n\r\n\r\n\r\n\r\nMillions of members use Premium\r\n\r\nTry Premium for ₹0\r\n1 month free. Easy to cancel. No penalties or fees.\r\n\r\nAbout the company\r\nHigh 5 Games company logo\r\nHigh 5 Games\r\n70,932 followers\r\n\r\nFollow\r\nMobile Gaming Apps  51-200 employees  271 on LinkedIn\r\n",
    "timestamp": "2026-01-11T12:55:55.930896"
},
{
    "id": 26,
    "raw_text": "Machine Learning Intern\r\nIndia · 43 minutes ago · 14 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn\r\n\r\n\r\nRemote\r\n\r\nFull-time\r\n\r\nApply\r\n\r\nSave\r\nSave Machine Learning Intern at Infrabyte Consulting\r\nMachine Learning Intern\r\nInfrabyte Consulting · India (Remote)\r\n\r\nApply\r\n\r\nSave\r\nSave Machine Learning Intern at Infrabyte Consulting\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nAbout the job\r\nMachine Learning Intern\r\n\r\n\r\nCompany: Infrabyte Consulting\r\nLocation: Remote\r\nEmployment Type: Internship (Full-time)\r\nDuration: 1–3 Months\r\nStipend: ₹15,000 per month\r\n\r\n\r\nRole Description\r\n\r\n\r\nInfrabyte Consulting is looking for a mathematically inclined Machine Learning Intern to join our AI/ML research and development team. In this role, you will assist in building, training, and deploying predictive models that help solve complex business problems. You will work with large datasets, explore state-of-the-art algorithms, and contribute to the automation of decision-making processes. This is an ideal role for someone looking to bridge the gap between theoretical ML and production-grade AI.\r\n\r\n\r\nPrimary Responsibilities\r\n\r\n\r\n* Data Preprocessing: Clean, normalize, and perform feature engineering on diverse datasets to prepare them for model training.\r\n* Model Development: Assist in implementing and fine-tuning machine learning models using libraries like Scikit-learn, TensorFlow, or PyTorch.\r\n* Exploratory Data Analysis (EDA): Use statistical techniques to visualize data distributions and identify key features for model input.\r\n* Evaluation & Testing: Measure model performance using metrics such as Accuracy, Precision-Recall, and F1-score, and perform hyperparameter tuning.\r\n* Research: Stay updated on the latest AI/ML trends and papers to propose innovative solutions for client-specific challenges.\r\n\r\n\r\nRequirements\r\n\r\n\r\n* Education: Currently pursuing or a recent graduate in Computer Science, Data Science, Statistics, Mathematics, or a related technical field.\r\n* Programming Skills: Strong proficiency in Python (specifically libraries like Pandas, NumPy, and Matplotlib).\r\n* ML Fundamentals: A solid understanding of supervised and unsupervised learning, regression, classification, and clustering.\r\n* Mathematics: Strong foundation in Linear Algebra, Calculus, and Probability/Statistics.\r\n* Tools: Familiarity with Jupyter Notebooks, Git, and basic knowledge of Cloud platforms (AWS/GCP/Azure) is a plus.\r\n\r\n\r\nInternship Benefits\r\n\r\n\r\n* Stipend: A fixed monthly payment of ₹15,000.\r\n* Certification: Official Internship Completion Certificate from Infrabyte Consulting.\r\n* Professional Growth: Performance-based Letter of Recommendation (LoR).\r\n* Mentorship: Direct guidance from senior AI engineers and data scientists.\r\n* Remote Work: 100% remote flexibility with a focus on research, innovation, and technical rigor.\r\n\r\n",
    "timestamp": "2026-01-11T12:56:23.912224"
},
{
    "id": 27,
    "raw_text": "Sr. AI Platform Data Engineer, Amazon Autos \r\nGurugram, Haryana, India · 4 hours ago · 8 people clicked apply\r\nPromoted by hirer · Responses managed off LinkedIn\r\n\r\n\r\nFull-time\r\n\r\nApply\r\n\r\nSave\r\nSave Sr. AI Platform Data Engineer, Amazon Autos  at Amazon\r\n\r\nSr. AI Platform Data Engineer, Amazon Autos\r\nAmazon · Gurugram, Haryana, India\r\n\r\nApply\r\n\r\nSave\r\nSave Sr. AI Platform Data Engineer, Amazon Autos  at Amazon\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nAbout the job\r\nDescription\r\n\r\nWe seek an AI Platform Builder who works at the intersection of data engineering and data science. You will build platforms, develop Agentic Artificial Intelligence (AI) solutions, and create scientific solutions that drive marketplace innovation.\r\n\r\nYou will design and implement platform features, curated datasets that power self-service analytics and intelligent automation. Your work will include:\r\n\r\n Using AI agents to write and optimize code\r\n Building AI-powered platforms that serve ML models\r\n Deploying intelligent agents that democratize data access\r\n\r\nWhat Makes This Role Unique\r\n\r\nThis is an opportunity to work at the forefront of AI-powered data engineering, where you'll not only leverage AI tools but build the next generation of AI-enabled data platforms. You'll have the autonomy to own projects end-to-end while helping shape the future of automotive shopping experiences on Amazon.\r\n\r\nKey job responsibilities\r\n\r\nPlatform Development & AI Integration\r\n\r\n Build and maintain efficient, scalable data pipelines and curated datasets optimized for AI/ML consumption\r\n Implement systems for automated data classification to transform business problems into analytical solutions\r\n Develop AI-native self-service data platforms using an AI-first methodology\r\n Create AI-powered platforms with natural language interfaces for data access\r\n\r\nStakeholder Engagement & Delivery\r\n\r\n Serve as a technical partner to business stakeholders, data science teams, and cross-functional partners\r\n Deliver well-modeled, discoverable data optimized for specific use cases\r\n Design and build curated datasets using AI code generation and Agentic AI tools\r\n Communicate insights and recommendations to product, business, and technology partners\r\n\r\nTechnical Leadership\r\n\r\n Architect and scale services based on program vision\r\n Recommend optimal strategies for quantifiable business impact\r\n Break down complex challenges into manageable projects\r\n Make pragmatic decisions to reduce risk\r\n Lead AI-augmented workshops for stakeholders\r\n\r\nDay-to-Day Activities\r\n\r\n Design and build curated datasets using AI code generation tools\r\n Build and maintain data pipelines using Amazon Web Services (AWS) and internal Amazon tools\r\n Implement and enhance AI-powered self-service platforms\r\n Create and maintain intelligent governance systems\r\n\r\nA day in the life\r\n\r\n Design and build curated datasets using AI code generation tools\r\n Build and maintain data pipelines using Amazon Web Services (AWS) and internal Amazon tools\r\n Implement and enhance AI-powered self-service platforms\r\n Create and maintain intelligent governance systems\r\n\r\nAbout The Team\r\n\r\nAmazon Autos transforms automotive shopping experiences. You will build a data platform for Reporting & Analytics, working with product managers, designers, and engineers to create automotive shopping experiences that delight customers.\r\n\r\nThis role is part of the Amazon Autos Reporting & Analytics tech team. Our vision is to create automotive discovery and shopping experiences on Amazon that provide customers with greater convenience and selection.\r\n\r\nBasic Qualifications\r\n\r\n 5+ years of data engineering experience\r\n Experience with data modeling, warehousing and building ETL pipelines\r\n Experience with SQL\r\n Experience in at least one modern scripting or programming language, such as Python, Java, Scala, or NodeJS\r\n Experience mentoring team members on best practices\r\n 4+ years of data engineering experience\r\n\r\nPreferred Qualifications\r\n\r\n Experience with big data technologies such as: Hadoop, Hive, Spark, EMR\r\n Experience operating large data warehouses\r\n\r\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\r\n\r\n\r\nCompany - ADCI - Haryana\r\n\r\nJob ID: A3156759\r\n\r\nAbout the company\r\nAmazon company logo\r\nAmazon\r\n36,021,681 followers\r\n\r\nFollow\r\nSoftware Development  10,001+ employees  768,030 on LinkedIn\r\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. We are driven by the excitement of building technologies, inventing products, and providing services that change lives. We embrace new ways of doing things, make decisions quickly, and are not afraid to fail. We have the scope and capabilities of a large company, and the spirit and heart of a small one.\r\n\r\nTogether, Amazonians research and develop new technologies from Amazon Web Services to Alexa on behalf of our customers: shoppers, sellers, content creators, and developers around the world.\r\n\r\nOur mission is to be Earth's most customer-centric company. Our actions, goals, projects, programs, and inventions begin and end with the customer top of mind.\r\n\r\nYou'll also hear us say that at Amazon, it's always \"Day 1.\"​ What do we mean? That our approach remains the same as it was on Amazon's very first day - to make smart, fast decisions, stay nimble, invent, and focus on delighting our customers.\r\n…\r\nshow more\r\n\r\nCommitments\r\n\r\nCareer growth and learning\r\nWe offer a variety of career mobility and development opportunities that are designed to help employees move into higher-paying roles at Amazon or elsewhere. Our ten upskilling programs offer employees access to pre-paid education, technical and non-technical skills training, industry certifications, virtual and on-the-job learning and more to help them grow their skills. These programs, as well as career development opportunities like mentoring, internal transfers and promotions, are just one of the one we strive to be Earth's best employer.\r\n…\r\nShow more\r\nDiversity, equity, and inclusion\r\nAmazon’s ability to innovate on behalf of our customers relies on the perspectives and knowledge of people from all backgrounds. We actively recruit people from diverse backgrounds to build a supportive and inclusive workplace. Where possible, we provide unlimited gender transition benefits including gender affirmation. Amazon provides short-term and long-term disability coverage at no cost (available to employees working 30+ hours). Employees have opportunities to seek mentoring relationships, including company-sponsored mentoring programs and affinity group-organized mentor pairings focused on various communities. To support building our inclusive culture, Amazon’s 13 affinity groups lead in community-building, mentorship, and programs to build awareness around customer and employee inclusion.\r\n…\r\nShow more\r\nLearn more\r\nInterested in working with us in the future?\r\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company\r\n\r\n\r\n",
    "timestamp": "2026-01-11T12:56:51.899782"
},
{
    "id": 28,
    "raw_text": "Data Scientist \r\nPune, Maharashtra, India · 1 day ago · Over 100 applicants\r\nPromoted by hirer · Actively reviewing applicants\r\n\r\n\r\nHybrid\r\n\r\nFull-time\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Data Scientist  at YASH Technologies\r\nData Scientist\r\nYASH Technologies · Pune, Maharashtra, India (Hybrid)\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Data Scientist  at YASH Technologies\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nAbout the job\r\nJob Overview:\r\nWe are looking for Data Science-AI/ML Professionals to join our team of researchers, data scientists, and developers. You will work on cutting-edge Al solutions across industries such as commerce, agriculture, insurance, financial markets, and procurement. Your role involves developing and optimizing machine learning and generative Al models to solve real-world challenges.\r\n\r\n\r\nKey Responsibilities:\r\n• Develop and optimize and lead ML, NLP, Deep Learning, and Generative Al model/projects.\r\n• Research and implement state-of-the-art algorithms for supervised and unsupervised learning.\r\n• Work with large-scale datasets in distributed environments.\r\n• Understand business processes to select and apply the best ML approaches.\r\n• Ensure scalability and performance of ML solutions.\r\n• Collaborate with cross-functional teams, including product owners, designers, and developers.\r\n• Solve complex data integration and deployment challenges.\r\n• Communicate results effectively using data visualization.\r\n• Work with global teams across different time zones.\r\n\r\n\r\nRequired Skills & Experience:\r\n• Strong experience in Machine Learning, Deep Learning, NLP, and Generative Al.\r\n• Hands-on expertise in frameworks like TensorFlow, PyTorch, or Hugging Face Transformers. Experience with LLMs (Large Language Models), model fine-tuning, and prompt engineering. • Proficiency in Python, R, or Scala for ML development.\r\n• Knowledge of cloud-based ML platforms (AWS, Azure, GCP).\r\n• Experience with big data processing (Spark, Hadoop, or Dask).\r\n• Ability to scale ML models from prototypes to production.\r\n• Strong analytical and problem-solving skills.\r\n\r\nJob search faster with Premium\r\nAccess company insights like strategic priorities, headcount trends, and more\r\n\r\n\r\n\r\n\r\nMillions of members use Premium\r\n\r\nTry Premium for ₹0\r\n1 month free. Easy to cancel. No penalties or fees.\r\n\r\nAbout the company\r\nYASH Technologies company logo\r\nYASH Technologies\r\n701,328 followers\r\n\r\nFollow\r\nIT Services and IT Consulting  5,001-10,000 employees  8,491 on LinkedIn\r\nYASH Technologies is a consulting-led transformation partner with a proven track record of helping customers address their current and prospective digital transformation challenges. Recognized as \"Large enough to transform and small enough to care,\" our customer-centricity and robust value systems have helped us earn the trust of our clients globally and enabled us to be the \"Digital Partner of choice\" of 75+ global F500 companies. We combine battle-tested consulting, technology, advisory, and outsourcing services capabilities \"Glocally\" with a consultative & value-centric approach to enable clients to achieve unprecedented performance and revenue growth at optimized costs. We are incredibly passionate about our mission - driving customer success, engaging with our associates, and giving back to the communities in which we live. We have fostered an environment that empowers associates and allows them to actualize themselves while enabling them to deliver exceptional experiences to our customers and partners.\r\n\r\nWe deeply treasure the trust evolve as an organization to bring our business, industry, and technology experience to develop and optimize innovative business-driven technology solutions for our customers. Regarding our vision, mission and values, YASH is focused on building long-term relationships and working with clients as an extended team. As such, YASH has created a culture where people feel empowered to make a difference; where every YASHian is passionate about innovation and collaboration; and where we take care of each other, our clients, our partners, and our communities just because it is the right thing to do.\r\n…\r\nshow more\r\n\r\nInterested in working with us in the future?\r\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company\r\n\r\n\r\n",
    "timestamp": "2026-01-11T12:57:19.923909"
},
{
    "id": 29,
    "raw_text": "AI Engineer Internship in Delhi (Hybrid)\r\nDelhi, India · 3 days ago · Over 100 people clicked apply\r\nResponses managed off LinkedIn\r\n\r\n\r\nOn-site\r\n\r\nInternship\r\n\r\nApply\r\n\r\nSave\r\nSave AI Engineer Internship in Delhi (Hybrid) at Conversely AI\r\nAI Engineer Internship in Delhi (Hybrid)\r\nConversely AI · Delhi, India (On-site)\r\n\r\nApply\r\n\r\nSave\r\nSave AI Engineer Internship in Delhi (Hybrid) at Conversely AI\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nAbout the job\r\nThis job is sourced from a job board. Learn More\r\nAs an AI engineer intern at Conversely, you will have the opportunity to work on cutting-edge projects in the field of artificial intelligence. If you have a passion for machine learning, LLM evaluation, ChatGPT, generative AI tools, automation, Claude, and GitHub Copilot (GenAI), then this is the perfect role for you.\r\n\r\nSelected Intern’s Day-to-day Responsibilities Include\r\n\r\n Developing and implementing machine learning algorithms to improve conversational AI systems\r\n Evaluating and optimizing language model performance using LLM evaluation techniques\r\n Utilizing ChatGPT and other generative AI tools to enhance user interactions\r\n Automating repetitive tasks to increase efficiency and productivity\r\n Collaborating with team members to integrate Claude into existing systems\r\n Leveraging GitHub Copilot (GenAI) to streamline code development and improve code quality\r\n Staying up-to-date on the latest advancements in AI technology and incorporating them into projects\r\n\r\nIf you are a driven and innovative AI enthusiast looking to gain hands-on experience in a fast-paced environment, apply now to join our dynamic team at Conversely.\r\n\r\nAbout Company: Conversely is revolutionizing customer engagement with data-driven chat solutions. By empowering businesses through full-funnel targeted marketing solutions, we are strategically their partners in navigating the ever-changing digital landscape.\r\n\r\n\r\nDesired Skills and Experience\r\nMachine Learning, Automation, Generative AI Tools, ChatGPT, Claude, LLM evaluation, GitHub Copilot (GenAI)\r\n\r\nJob search faster with Premium\r\nAccess company insights like strategic priorities, headcount trends, and more\r\n\r\n\r\n\r\n\r\nMillions of members use Premium\r\n\r\nTry Premium for ₹0\r\n1 month free. Easy to cancel. No penalties or fees.\r\n\r\n",
    "timestamp": "2026-01-11T12:57:47.956447"
},
{
    "id": 30,
    "raw_text": "1 month free. Easy to cancel. No penalties or fees.\r\n\r\n",
    "timestamp": "2026-01-11T12:58:15.958336"
},
{
    "id": 31,
    "raw_text": "Data Scientist\r\nBengaluru, Karnataka, India · 3 days ago · Over 100 applicants\r\nPromoted by hirer · No response insights available yet\r\n\r\n\r\nOn-site\r\n\r\nFull-time\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Data Scientist at Alaan الآن\r\nData Scientist\r\nAlaan الآن · Bengaluru, Karnataka, India (On-site)\r\n\r\nEasy Apply\r\n\r\nSave\r\nSave Data Scientist at Alaan الآن\r\nShow more options\r\nUpdate your profile to assess your job match\r\nUpdate profile\r\nAbout the job\r\nAbout Alaan\r\n\r\nAlaan is the SuperCard™ for businesses and the most loved fintech in the Middle East. Our mission is to simplify finance for businesses so they can save time and money.\r\nAlaan provides everything businesses need to manage and control expenses, including the SuperCard™, AI-powered automation and insights, streamlined accounting, and centralized dashboards, all in one place.\r\n\r\n\r\nOver 1500 businesses in the UAE and KSA, from startups to enterprises, use Alaan to control spending and save costs.\r\n\r\n\r\nBacked by Y Combinator and top global investors- including founders and executives of leading startups - Alaan is built by a world-class team from McKinsey, BCG, Goldman Sachs, Barclays, Zomato, Careem, Rippling, and other high-growth companies.\r\n\r\n\r\nWe’re not just building software. We’re reimagining how finance works for modern businesses across the region.\r\n\r\n\r\nAbout the role\r\n\r\nAt Alaan, we’re building the modern financial stack for businesses across MENA—empowering companies to manage cards, payments, and expenses with intelligence and automation. A key part of this vision is our ML-powered product features, which drive smarter decisions, faster processes, and better customer experiences.\r\n\r\n\r\nWe’re looking for a strategic, senior-level Data Scientist to own the entire lifecycle of our machine learning features - from concept to production - and to act as the bridge between data science, engineering, and product. This is not just a modeling role - you’ll be setting the vision, defining the strategy, and ensuring that every AI-driven feature in our product is impactful, robust, and continuously improving.\r\n\r\n\r\nIf you’re excited by the idea of taking a feature from 80% to 90%+ accuracy, love working cross-functionally, and want to lead high-impact AI initiatives in fintech, this is the role for you.\r\n\r\n\r\nWhat you'll do\r\n\r\nDefine the Data Science Strategy: Translate product goals into clear, testable data science problems and technical requirements. Own the “what” and the “why” for ML initiatives.\r\nOversee the Modeling Lifecycle: Lead the team through Proof-of-Concepts (POCs), benchmarking, and productionization. Provide expert feedback on model selection, feature engineering, and validation.\r\nSet Success Criteria: Define robust metrics, benchmarks, and offline/online evaluation methods to measure success across the lifecycle.\r\nDrive Iterative Improvement: Monitor in-production performance, run A/B tests, and formulate experiments to push accuracy, efficiency, and user impact to the next level.\r\nEnsure Technical Excellence: Act as the quality gatekeeper—ensuring models are well-architected, scalable, and production-ready before deployment.\r\nLead Cross-Functional Delivery: Collaborate with Data Scientists, ML Engineers, Analysts, and Backend Engineers to ensure seamless execution and alignment with business goals.\r\n\r\n\r\nWhat we are looking for\r\n\r\n5+ years of experience in data science, with a proven record of delivering ML features to production.\r\nDeep ML expertise and strong grasp of the entire ML lifecycle - model design, training, validation, deployment, monitoring, and iteration.\r\nStrategic thinking ability to connect business needs to data science solutions, and prioritize based on impact.\r\nLeadership & mentorship experience of guiding teams, providing constructive technical feedback, and raising the quality bar.\r\nCommunication ability to explain complex technical topics clearly to both technical and non-technical audiences.\r\nLifecycle mastery and first-hand experience taking models from concept to production, troubleshooting failures, and leading improvements.\r\nPrior experience as a Tech Lead or Principal Data Scientist.\r\nExpertise in MLOps tools and best practices.\r\nFintech domain experience.\r\n\r\n\r\n What's in it for you\r\n\r\nContribute to building the Middle East’s most beloved fintech brand from the ground up\r\nBenefit from a role with significant ownership and accountability\r\nThrive in a flexible hybrid culture with ample work-life balance\r\nParticipate in exciting offsite events\r\nCompetitive salary and equity\r\nEnjoy additional perks like travel allowances, gym memberships, and more\r\n\r\n\r\n\r\nJob search faster with Premium\r\nAccess company insights like strategic priorities, headcount trends, and more\r\n\r\n\r\n\r\n\r\nMillions of members use Premium\r\n\r\nTry Premium for ₹0\r\n1 month free. Easy to cancel. No penalties or fees.\r\n\r\n",
    "timestamp": "2026-01-11T14:11:14.695126"
}