{
  "jobs": [
    {
      "id": 1,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4358386656&keywords=Data%20Scientist",
      "raw_text": "Data Science INTERN \nBengaluru, Karnataka, India · 4 days ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nOn-site\n\nFull-time\n\nApply\n\nSave\nSave Data Science INTERN  at Microsoft\nData Science INTERN\nMicrosoft · Bengaluru, Karnataka, India (On-site)\n\nApply\n\nSave\nSave Data Science INTERN  at Microsoft\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nOverview\n\nCome build community, explore your passions and do your best work at Microsoft with thousands of University interns from every corner of the world. This opportunity will allow you to bring your aspirations, talent, potential—and excitement for the journey ahead.\n\nAs a Data Scientist Intern at Microsoft, you will use machine learning, statistics, experiments, and more to build and improve great products while making business impact. As a Data Scientist intern you will collaborate with stakeholders, formulate approaches to solve problems and use algorithms and data sources in the context of business and engineering needs. You will also be able to combine your engineering abilities with analytical skills to make customer experiences better. Our Data Scientists use innovative methods, algorithms and tools daily to drive results throughout Microsoft devices, operating systems, products, and services and provide novel insights into business and customer scenarios.\n\nAt Microsoft, Interns work on real-world projects in collaboration with teams across the world, while having fun along the way. You’ll be empowered to build community, explore your passions and achieve your goals. This is your chance to bring your solutions and ideas to life while working on cutting-edge technology.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nResponsibilities\n\nFormulate approaches to solve problems using well defined algorithms and data sources\nIncorporate an understanding of product functionality and customer perspective to provide context for those problems.\nUse data exploration techniques to discover new questions or opportunities within your problem area and propose applicability and limitations of the data.\nInterpret the results of their analysis, validate their approach, and learn to monitor, analyze, and iterate to continuously improve.\nEngage with peer stakeholders to produce clear, compelling, actionable insights that influence product and service improvements that will impact millions of customers.\nParticipate in the peer review process and act on feedback while learning innovative methods, algorithms, and tools to increase the impact and applicability of your results.\n\nQualifications\n\nCurrently pursuing a Bachelors Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field.\nMust have at least one additional quarter/semester of school remaining following the completion of the internship\n\nThis position will be open for a minimum of 5 days, with applications accepted on an ongoing basis until the position is filled.\n\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance with religious accommodations and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n\nSee curated AI tools for your job search\nGet hired faster with the help of AI tools built by verified companies like Kickresume, Exponent Interview Prep, and more.\n\nGet started\nAbout the company\nMicrosoft company logo\nMicrosoft\n27,289,890 followers\n\nFollow\nSoftware Development  10,001+ employees  226,453 on LinkedIn\nEvery company has a mission. What's ours? To empower every person and every organization to achieve more. We believe technology can and should be a force for good and that meaningful innovation contributes to a brighter world in the future and today. Our culture doesn’t just encourage curiosity; it embraces it. Each day we make progress together by showing up as our authentic selves. We show up with a learn-it-all mentality. We show up cheering on others, knowing their success doesn't diminish our own. We show up every day open to learning our own biases, changing our behavior, and inviting in differences. Because impact matters.\n\nMicrosoft operates in 190 countries and is made up of approximately 228,000 passionate employees worldwide.\n…\nshow more\n\nCommitments\n\nEnvironmental sustainability\nMicrosoft has public, time-bound commitments to become carbon negative, water positive, and zero waste in our operations by 2030. Microsoft is accelerating progress toward a more sustainable future by measuring and reducing our environmental footprint, accelerating research, helping our customers build sustainable solutions, and advocating for policies that benefit the environment.\n…\nShow more\nSocial impact\nWe have an enormous opportunity and responsibility to ensure that the technology we create benefits everyone on the planet, as well as the planet itself. As we drive economic growth, we must also commit to creating a more inclusive, equitable, sustainable, and trusted future for everyone. To help people and organizations everywhere achieve more, we focus on four commitments: support inclusive economic growth, protect fundamental rights, create a sustainable future, and earn trust.\n…\nShow more\nDiversity, equity, and inclusion\nAt Microsoft, we strive to create an environment where people with different backgrounds, experiences, and perspectives thrive. Our journey and our learnings are ongoing, but we are clear about our goals: We want every employee to feel like we can be our authentic selves, in alignment with our company values, so we can do our best work. We’re focused on increasing representation, from interns all the way through to the boardroom. Our accountability starts at the highest levels of our organization and extends to every role. We aim to influence systemic and sustainable change, which requires us to do the micro and macro motions every single day that impact employees’ experiences and transform the systems that drive access, opportunity, and greater equality. We have a long history at Microsoft of applying our growth mindset to address some of the world’s most complex challenges. We put the same relentless focus and willingness to learn to work in confronting the realities of inequity in our industry and beyond—not because we have all the answers, but because we are uniquely positioned to make a difference when we innovate for inclusion.\n…\nShow more\nCareer growth and learning\nAt Microsoft, we believe a career is more than a job. It’s about who you are and who you want to become. It’s an ongoing experience—and with a growth mindset guiding the way, you can shape that experience into just about anything you can imagine. We know that interests can shift and careers evolve over time. That’s why Microsoft is committed to helping our employees discover their passions, grow the skills they need to realize them, and connect with people who can support them throughout their career. We support our employees’ development by focusing on three pillars of the career experience: discovery, connection, and growth. If they’re looking for inspiration, we provide resources that can help them discover new interests and engage with them in meaningful ways. We connect employees with the One Microsoft community and empower them to make the most of everything Microsoft’s global network has to offer. And we have an entire ecosystem of learning opportunities and experiences designed to help our employees grow professionally and personally.\n…\nShow more\nWork-life balance\nMicrosoft is dedicated to providing comprehensive wellbeing benefits that help employees regenerate energy, at work and at home. While Microsoft as an organization is consistently taking a learn-it-all approach to better support its employees, a few examples of this dedication to employee wellbeing include: A hybrid workplace model that allows employees to determine the working preferences that support how they work best. It’s understood and expected that employee preferences and needs may change over time—and that’s OK. Comprehensive annual paid time off offerings and enhanced paid parental and family caregiver leave globally. Access to mental health resources via our EAP, using our top-notch health plan, and on the Be Well platform—including digital therapy, self-directed sessions, prerecorded sessions with experts on resilience, physical activity contests, and more.\n…\nShow more\nLearn more\nInterested in working with us in the future?\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company",
      "timestamp": "2026-01-11T22:44:31.736468"
    },
    {
      "id": 2,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4352376054&keywords=Data%20Scientist",
      "raw_text": "Data Scientist Intern\nIndia · 1 day ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nRemote\n\nFull-time\n\nApply\n\nSave\nSave Data Scientist Intern at Skillzenloop\nData Scientist Intern\nSkillzenloop · India (Remote)\n\nApply\n\nSave\nSave Data Scientist Intern at Skillzenloop\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nData Scientist Intern\nCompany: SkillzenLoop\nLocation: Remote\nEmployment Type: Internship (Full-time)\nDuration: 1–3 Months\nStipend: ₹15,000 per month\nRole Description\nSkillzenLoop is looking for an intellectually curious Data Scientist Intern to help us extract value from our data. In this role, you will go beyond simple analysis to build predictive models, design experiments, and apply advanced statistical techniques to solve complex business problems. You will work at the intersection of mathematics, technology, and business strategy to drive innovation.\nPrimary Responsibilities\n• Statistical Modeling: Apply various statistical and machine learning techniques to identify trends and build predictive prototypes.\n• Data Wrangling: Clean and integrate large, complex datasets from multiple sources to prepare them for modeling.\n• Algorithm Development: Assist in developing and testing custom algorithms to improve product features and user experience.\n• Insight Communication: Interpret and communicate data insights to stakeholders through compelling storytelling and advanced visualization.\n• Experimental Design: Assist in designing and analyzing A/B tests to measure the impact of new features or business strategies.\nRequirements\n• Education: Currently pursuing or a recent graduate of a Master’s or PhD in Data Science, Statistics, Physics, Mathematics, or a related quantitative field (Bachelors with strong projects also considered).\n• Programming Skills: Expert-level proficiency in Python or R, specifically for data science applications.\n• Mathematical Foundation: Deep understanding of linear algebra, calculus, and advanced probability/statistics.\n• Tools: Experience with SQL and data science libraries (Scikit-learn, Pandas, Statsmodels, or PyTorch/TensorFlow).\n• Curiosity: A strong desire to ask \"why\" and the persistence to find answers within complex datasets.\nInternship Benefits\n• Stipend: A monthly payment of ₹15,000.\n• Certification: Official Internship Completion Certificate from SkillzenLoop.\n• Professional Growth: Performance-based Letter of Recommendation (LoR).\n• Mentorship: Work directly with senior Data Scientists on high-level strategic projects.\n• Impact: Your models and insights will directly influence company decision-making.\n\nJob search faster with Premium\nAccess company insights like strategic priorities, headcount trends, and more\n\n\n\n\nMillions of members use Premium\n\nTry Premium for ₹0\n1 month free. Easy to cancel. No penalties or fees.",
      "timestamp": "2026-01-11T22:44:53.101187"
    },
    {
      "id": 3,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4351834683&keywords=Data%20Scientist",
      "raw_text": "Machine Learning Intern\nIndia · 20 minutes ago · 8 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nRemote\n\nInternship\n\nApply\n\nSave\nSave Machine Learning Intern at Zenithbyte\nMachine Learning Intern\nZenithbyte · India (Remote)\n\nApply\n\nSave\nSave Machine Learning Intern at Zenithbyte\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nMeet the hiring team\nSanket Patil\nSanket Patil  \n 3rd+\nFounder & CEO at Unified Mentor\nJob poster\n\nMessage\nAbout the job\nMachine Learning Intern (Paid)\nCompany: ZenithByte\nLocation: Remote\nDuration: 3 Months\n📅 Application Deadline: 13th January 2026\n\nOpportunity & Benefits\n💰 Performance-based stipend up to ₹7,499\n🎁 Swags and goodies\n📜 Certificate of Internship\n✉️ Letter of Recommendation (based on performance)\n🌟 Potential full-time role based on performance\n🤝 Expert mentorship & live project exposure\nAbout ZenithByte\nZenithByte is committed to empowering students and graduates by providing real-world exposure to Machine Learning and Data Science. The organization bridges the gap between academic learning and industry expectations through live projects, expert mentorship, and performance-driven career opportunities.\nRole Overview\nAs a Machine Learning Intern, you will work with real datasets to design predictive models and explore modern AI and ML tools. This role focuses on strengthening analytical and technical skills while contributing to automation and data-driven decision-making initiatives.\nRoles & Responsibilities\nDesign, train, and optimize machine learning models for real-world applications\nPerform data preprocessing, feature engineering, and model evaluation\nDevelop predictive algorithms and data-driven solutions\nWork with ML frameworks such as TensorFlow, PyTorch, and Scikit-learn\nDocument insights, experiments, and model performance in technical reports\nRequirements\nCurrently enrolled in or recently graduated from Computer Science, AI, Data Science, or related fields\nStrong understanding of machine learning algorithms and data analysis concepts\nProficiency in Python (preferred) or R, with hands-on experience using ML libraries\nFamiliarity with data visualization tools and model evaluation techniques\nStrong analytical thinking, communication, and teamwork skills\nWhat You Will Gain\nHands-on experience with real-world machine learning projects\nPerformance-based stipend up to ₹7,499\nSwags and goodies\nCertificate of Internship upon completion\nLetter of Recommendation based on performance\nOpportunity to build an industry-ready ML portfolio\nPotential full-time role based on performance\nEqual Opportunity Statement\nZenithByte is an equal opportunity organization committed to diversity and inclusion, welcoming applicants from all backgrounds and experiences.\n\nJob search faster with Premium\nAccess company insights like strategic priorities, headcount trends, and more\n\n\n\n\nMillions of members use Premium\n\nTry Premium for ₹0\n1 month free. Easy to cancel. No penalties or fees.",
      "timestamp": "2026-01-11T22:45:14.415012"
    },
    {
      "id": 4,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4359380628&keywords=Data%20Scientist",
      "raw_text": "Associate - Data Scientist \nGurugram, Haryana, India · 3 days ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nFull-time\n\nApply\n\nSave\nSave Associate - Data Scientist  at United Airlines\nAssociate - Data Scientist\nUnited Airlines · Gurugram, Haryana, India\n\nApply\n\nSave\nSave Associate - Data Scientist  at United Airlines\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nAchieving our goals starts with supporting yours. Grow your career, access top-tier health and wellness benefits, build lasting connections with your team and our customers, and travel the world using our extensive route network.\n\nCome join us to create what’s next. Let’s define tomorrow, together.\n\nDescription\n\nUnited's Digital Technology team designs, develops, and maintains massively scaling technology solutions brought to life with innovative architectures, data analytics, and digital solutions.\n\nJob Overview And Responsibilities\n\nThe Analytics and Innovation (Ai) team at United Airlines works to innovate, transform, and solve complex business problems resulting in significant and measurable enterprise impact through the application of deep cross-functional business expertise and advanced analytics. We work with business and technology partners across the enterprise (e.g. Airport Operations, Contact Centers, Network Planning, Revenue Management, Digital Products, Human Resources, etc.) to influence strategic decisions, enterprise strategy, business process, and to help connect the dots across the enterprise. We aim to be an organization with whom and within everyone loves to work!\n\nData Scientists within Ai partner with business and technology leaders across the company to deploy AI & ML powered solutions to support and automate business processes. The team works closely with other teams in digital technology with complementing skills and capabilities. The key objectives are to drive incremental revenue, boost customer engagement and to automate manual processes by leveraging state-of-the-art ML techniques. Data Scientists contribute to developing smart and innovative solutions across many of United’s departments.\n\nWork with other data scientists and a variety of stakeholders (IT, DE, business etc.) to deliver high-quality models\nGathering and analyzing data of United’s various operations to make fact-based, data-driven recommendations\nExecute solutions to business problems using data analysis, machine learning and optimization tools \nEnable data transfer between platforms and monitor model performance for scalable project deployments\nResearch latest machine learning approaches and share the knowledge across the team\nEffectively structure communication of insights from work streams and deliver clear and professional presentations to the team/team leaders/managers\nPartner and engage with data engineering and operations teams to inform and support business stakeholders with day-to-day project updates.\n\nThis position is offered on local terms and conditions. Expatriate assignments and sponsorship for employment visas, even on a time-limited visa status, will not be awarded. This position is for United Airlines Business Services Pvt. Ltd - a wholly owned subsidiary of United Airlines Inc.\n\nQualifications\n\nWhat’s needed to succeed (Minimum Qualifications):\n\nBachelor’s degree \nEngineering, Technology, Computer Science, Statistics, Operations Research, Industrial Engineering, Applied Mathematics, Economics\n0 – 3 years experience\n Excellent analytical and problem-solving skills\n Proficiency in Programming Languages (Python/R), SQL, Excel and other Microsoft Office products\n Intermediate knowledge in machine learning algorithms like Bagging (Decision Trees, RF), Boosting (XGBoost, GBM) , Clustering (KMeans)\n Proven comfort and an intellectual curiosity for working with very large sets of data\n Understanding of probability & statistics\n Ability to bridge business context with technical details and explain and discuss mathematical and machine learning technicalities to a business audience\n Strong interpersonal skills with a focus on teamwork\n\nWhat will help you propel from the pack (Preferred Qualifications):\n\n Knowledge of deep learning/neural networks and experience with NLP/CV \n Hands on experience in using AWS/Azure etc \nData Science, Business Analytics, Engineering, Technology, Computer Science, , Statistics, Operations Research, Applied Mathematics, Economics\n\nAbout the company\nUnited Airlines company logo\nUnited Airlines\n1,196,757 followers\n\nFollow\nAirlines and Aviation  10,001+ employees  73,106 on LinkedIn",
      "timestamp": "2026-01-11T22:45:35.734998"
    },
    {
      "id": 5,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4345306500&keywords=Data%20Scientist",
      "raw_text": "Machine Learning Intern\nIndia · 3 hours ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nRemote\n\nInternship\n\nApply\n\nSave\nSave Machine Learning Intern at Zenithbyte\nMachine Learning Intern\nZenithbyte · India (Remote)\n\nApply\n\nSave\nSave Machine Learning Intern at Zenithbyte\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nMeet the hiring team\nSanket Patil\nSanket Patil  \n 3rd+\nFounder & CEO at Unified Mentor\nJob poster\n\nMessage\nAbout the job\nMachine Learning Intern (Paid)\nCompany: ZenithByte\nLocation: Remote\nDuration: 3 Months\n📅 Application Deadline: 13th January 2026\n\nOpportunity & Benefits\n💰 Performance-based stipend up to ₹7,499\n🎁 Swags and goodies\n📜 Certificate of Internship\n✉️ Letter of Recommendation (based on performance)\n🌟 Potential full-time role based on performance\n🤝 Expert mentorship & live project exposure\nAbout ZenithByte\nZenithByte is committed to empowering students and graduates by providing real-world exposure to Machine Learning and Data Science. The organization bridges the gap between academic learning and industry expectations through live projects, expert mentorship, and performance-driven career opportunities.\nRole Overview\nAs a Machine Learning Intern, you will work with real datasets to design predictive models and explore modern AI and ML tools. This role focuses on strengthening analytical and technical skills while contributing to automation and data-driven decision-making initiatives.\nRoles & Responsibilities\nDesign, train, and optimize machine learning models for real-world applications\nPerform data preprocessing, feature engineering, and model evaluation\nDevelop predictive algorithms and data-driven solutions\nWork with ML frameworks such as TensorFlow, PyTorch, and Scikit-learn\nDocument insights, experiments, and model performance in technical reports\nRequirements\nCurrently enrolled in or recently graduated from Computer Science, AI, Data Science, or related fields\nStrong understanding of machine learning algorithms and data analysis concepts\nProficiency in Python (preferred) or R, with hands-on experience using ML libraries\nFamiliarity with data visualization tools and model evaluation techniques\nStrong analytical thinking, communication, and teamwork skills\nWhat You Will Gain\nHands-on experience with real-world machine learning projects\nPerformance-based stipend up to ₹7,499\nSwags and goodies\nCertificate of Internship upon completion\nLetter of Recommendation based on performance\nOpportunity to build an industry-ready ML portfolio\nPotential full-time role based on performance\nEqual Opportunity Statement\nZenithByte is an equal opportunity organization committed to diversity and inclusion, welcoming applicants from all backgrounds and experiences.\n\nJob search faster with Premium\nAccess company insights like strategic priorities, headcount trends, and more\n\n\n\n\nMillions of members use Premium\n\nTry Premium for ₹0\n1 month free. Easy to cancel. No penalties or fees.",
      "timestamp": "2026-01-12T17:07:41.342154"
    },
    {
      "id": 6,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4352405449&keywords=Data%20Scientist",
      "raw_text": "Artificial Intelligence Intern\nIndia · 2 days ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nRemote\n\nFull-time\n\nApply\n\nSave\nSave Artificial Intelligence Intern at Skillzenloop\nArtificial Intelligence Intern\nSkillzenloop · India (Remote)\n\nApply\n\nSave\nSave Artificial Intelligence Intern at Skillzenloop\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nArtificial Intelligence Intern\nCompany: SkillzenLoop\nLocation: Remote\nEmployment Type: Internship (Full-time)\nDuration: 1–3 Months\nStipend: ₹15,000 per month\nRole Description\nSkillzenLoop is looking for a brilliant and forward-thinking Artificial Intelligence Intern to join our innovation lab. In this role, you will go beyond traditional programming to work on Generative AI, Natural Language Processing (NLP), and Computer Vision projects. You will help us explore how AI can be integrated into our core products to create smarter, more intuitive user experiences.\nPrimary Responsibilities\n• Model Implementation: Assist in the development and fine-tuning of AI models using frameworks like PyTorch, TensorFlow, or Keras.\n• LLM Exploration: Work with Large Language Models (LLMs) and explore prompt engineering and RAG (Retrieval-Augmented Generation) architectures.\n• Data Engineering: Collaborate on building data pipelines that feed into AI training environments, ensuring high-quality data inputs.\n• Algorithm Research: Review academic papers and technical documentation to stay at the cutting edge of AI trends and implement state-of-the-art techniques.\n• Prototyping: Build \"Proof of Concept\" (PoC) AI tools that solve specific business automation challenges.\nRequirements\n• Education: Currently pursuing or a recent graduate in Artificial Intelligence, Computer Science, Robotics, or a related highly technical field.\n• Technical Proficiency: Strong programming skills in Python and experience with AI libraries (e.g., Hugging Face, OpenCV, or LangChain).\n• AI Fundamentals: Solid understanding of Neural Networks, Deep Learning, and Transformers.\n• Mathematics: Strong background in Linear Algebra, Calculus, and Probability.\n• Mindset: A passion for ethical AI development and a desire to build technology that has a positive human impact.\nInternship Benefits\n• Stipend: A monthly payment of ₹15,000.\n• Certification: Official Internship Completion Certificate from SkillzenLoop.\n• Professional Growth: Performance-based Letter of Recommendation (LoR).\n• Mentorship: Direct access to AI researchers and senior engineers working on live production models.\n• Remote Culture: 100% remote work with access to advanced computing resources and a collaborative virtual environment.",
      "timestamp": "2026-01-12T17:08:02.874983"
    },
    {
      "id": 7,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4345354444&keywords=Data%20Scientist",
      "raw_text": "Artificial Intelligence Intern \nIndia · 23 hours ago · Over 100 applicants\nPromoted by hirer · Company review time is typically 1 week\n\n\nRemote\n\nInternship\n\nEasy Apply\n\nSave\nSave Artificial Intelligence Intern  at Zetheta Algorithms Private Limited\nArtificial Intelligence Intern\nZetheta Algorithms Private Limited · India (Remote)\n\nEasy Apply\n\nSave\nSave Artificial Intelligence Intern  at Zetheta Algorithms Private Limited\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nMeet the hiring team\nAvani Shah\nAvani Shah  \n 3rd\nCo-Founder at ZeTheta Algorithms Private Limited\nJob poster\n\nMessage\nAbout the job\nAbout the Company\n\nZeTheta Algorithms Private Limited (www.zetheta.com) is a FinTech start-up which has been recently set up and is developing innovative AI tools.\nhttps://www.instagram.com/zetheta.official/\n\n\nAbout the Role\n\nWe are seeking a talented and motivated student/ fresher intern to develop AI models from scratch within a 2 month timeframe. This is an extraordinary opportunity for a self-driven, technically skilled student to build a complete enterprise-grade system that incorporates cutting-edge AI technologies including deep learning.\n\n\nResponsibilities\n\nDesign and implement the complete AI Models following provided specifications\nDevelop both frontend and backend components of the platform\nCreate and integrate AI modules\nDesign and optimize database schema and queries\nEnsure system security, especially for sensitive identity verification data\nDeploy the solution using zero-cost cloud services\nDocument code, APIs, and system architecture\nComplete the entire project within the 2 month timeline\n\n\nQualifications\n\nNo experience required. Preferably, a student who is currently pursuing or fresh graduate who has recently completed a degree in Computer Science, AI/ML, or related field.\n\n\nRequired Skills (permitted to use all LLMs)\n\nStrong programming skills in Python and JavaScript\nUnderstanding of React.js for frontend development and Node.js for backend\nKnowledge of FastAPI or similar Python web frameworks\nFamiliarity with database design and SQL (particularly PostgreSQL with Supabase)\nDeployment on AWS with CD/ CI Pipelines and Manual Environment in EC2 instance, S3\nUnderstanding of basic machine learning concepts\nSelf-motivated with ability to work independently\n\n\nPreferred Skills (permitted to use all LLMs)\n\nSound knowledge of AI/ML libraries (TensorFlow, Keras, HuggingFace Transformers)\nFamiliarity with computer vision techniques using OpenCV\nKnowledge of natural language processing concepts\nSound knowledge of facial recognition or emotion detection systems\nUnderstanding of identity verification methodologies\nDocker containerization experience\nPrior work with cloud deployment (AWS)\n\n\nWho Should Apply?\n\nStudent or fresh graduate from any academic discipline.\nStrong analytical and problem-solving skills.\nBasic knowledge of Microsoft Office.\nWillingness to self-learn and work in a fast-paced environment.\n\n\nInternship Details\n\nDuration: Self paced, options for 15days or 1,2,3,4 or 6 months.\nType: Unpaid\n\nAbout the company\nZetheta Algorithms Private Limited company logo\nZetheta Algorithms Private Limited\n371,151 followers\n\nFollow",
      "timestamp": "2026-01-12T17:08:24.449385"
    },
    {
      "id": 8,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4345354444&keywords=Data%20Scientist",
      "raw_text": "Artificial Intelligence Intern \nIndia · 23 hours ago · Over 100 applicants\nPromoted by hirer · Company review time is typically 1 week\n\n\nRemote\n\nInternship\n\nEasy Apply\n\nSave\nSave Artificial Intelligence Intern  at Zetheta Algorithms Private Limited\nArtificial Intelligence Intern\nZetheta Algorithms Private Limited · India (Remote)\n\nEasy Apply\n\nSave\nSave Artificial Intelligence Intern  at Zetheta Algorithms Private Limited\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nMeet the hiring team\nAvani Shah\nAvani Shah  \n 3rd\nCo-Founder at ZeTheta Algorithms Private Limited\nJob poster\n\nMessage\nAbout the job\nAbout the Company\n\nZeTheta Algorithms Private Limited (www.zetheta.com) is a FinTech start-up which has been recently set up and is developing innovative AI tools.\nhttps://www.instagram.com/zetheta.official/\n\n\nAbout the Role\n\nWe are seeking a talented and motivated student/ fresher intern to develop AI models from scratch within a 2 month timeframe. This is an extraordinary opportunity for a self-driven, technically skilled student to build a complete enterprise-grade system that incorporates cutting-edge AI technologies including deep learning.\n\n\nResponsibilities\n\nDesign and implement the complete AI Models following provided specifications\nDevelop both frontend and backend components of the platform\nCreate and integrate AI modules\nDesign and optimize database schema and queries\nEnsure system security, especially for sensitive identity verification data\nDeploy the solution using zero-cost cloud services\nDocument code, APIs, and system architecture\nComplete the entire project within the 2 month timeline\n\n\nQualifications\n\nNo experience required. Preferably, a student who is currently pursuing or fresh graduate who has recently completed a degree in Computer Science, AI/ML, or related field.\n\n\nRequired Skills (permitted to use all LLMs)\n\nStrong programming skills in Python and JavaScript\nUnderstanding of React.js for frontend development and Node.js for backend\nKnowledge of FastAPI or similar Python web frameworks\nFamiliarity with database design and SQL (particularly PostgreSQL with Supabase)\nDeployment on AWS with CD/ CI Pipelines and Manual Environment in EC2 instance, S3\nUnderstanding of basic machine learning concepts\nSelf-motivated with ability to work independently\n\n\nPreferred Skills (permitted to use all LLMs)\n\nSound knowledge of AI/ML libraries (TensorFlow, Keras, HuggingFace Transformers)\nFamiliarity with computer vision techniques using OpenCV\nKnowledge of natural language processing concepts\nSound knowledge of facial recognition or emotion detection systems\nUnderstanding of identity verification methodologies\nDocker containerization experience\nPrior work with cloud deployment (AWS)\n\n\nWho Should Apply?\n\nStudent or fresh graduate from any academic discipline.\nStrong analytical and problem-solving skills.\nBasic knowledge of Microsoft Office.\nWillingness to self-learn and work in a fast-paced environment.\n\n\nInternship Details\n\nDuration: Self paced, options for 15days or 1,2,3,4 or 6 months.\nType: Unpaid\n\nAbout the company\nZetheta Algorithms Private Limited company logo\nZetheta Algorithms Private Limited\n371,151 followers\n\nFollow",
      "timestamp": "2026-01-12T17:08:45.949776"
    },
    {
      "id": 9,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4345365934&keywords=Data%20Scientist",
      "raw_text": "Data Scientist \nBengaluru East, Karnataka, India · 5 hours ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nHybrid\n\nFull-time\n\nApply\n\nSave\nSave Data Scientist  at Visa\nData Scientist\nVisa · Bengaluru East, Karnataka, India (Hybrid)\n\nApply\n\nSave\nSave Data Scientist  at Visa\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nVisa is a world leader in payments and technology, with over 259 billion payments transactions flowing safely between consumers, merchants, financial institutions, and government entities in more than 200 countries and territories each year. Our mission is to connect the world through the most innovative, convenient, reliable, and secure payments network, enabling individuals, businesses, and economies to thrive while driven by a common purpose – to uplift everyone, everywhere by being the best way to pay and be paid.\n\n\nMake an impact with a purpose-driven industry leader. Join us today and experience Life at Visa.\n\n\n\n\nJob Description\n\nThe Client Services Data & AI Solutions Team builds open, trusted data and AI culture where the cost of curiosity is low, and insights are actionable. We govern transactional data and metrics, deliver usable dashboards and certified data sources, and apply analytics and AI to generate value. We partner with stakeholders, from executive leaders to customer-facing teams, ensuring data and AI assets are reliable, secure, and embedded in daily work.\n\n\nIn this specialist role, we are seeking a highly skilled AI Engineer to lead the development and integration of AI technologies into our Client Services operations. This role focuses on leveraging generative AI, machine learning operations (MLOps), AI model fine-tuning, enrichment pipelines to enhance service delivery and predictive capabilities.\n\n\nResponsibilities:\n\n\nEstablish data, AI processes and automation aligned to business and technology requirements, leveraging supported data platforms, MLOps tooling, and models. \nBuild production-grade AI services: LLM-based applications, RAG pipelines, recommendation systems, forecasting, and classification\nDevelop and maintain data models and schemas optimized for analytics, ML feature stores, and AI workloads. \nDeliver data engineering and AI projects end to end: ingestion, modeling, pipeline development, feature engineering, model training, deployment, and monitoring. \nUse best practices in data architecture and governance and provide expertise in data modeling, and MLOps. \nCollaborate with cross-functional teams to translate requirements into data and AI solutions. \nImplement data validation, quality checks, and model evaluation at each stage. \nApply Agile principles to plan, build, test, and iterate data & AI solutions, document architectures, dictionaries, and models. \nCommunicate complex data and AI concepts clearly to technical and non-technical audiences. \nStay current on trends in cloud engineering, distributed computing, LLMs, databases, orchestration etc. \nThis is a hybrid position. Expectation of days in office will be confirmed by your hiring manager.\n\n\n\n\nQualifications\n\nBasic Qualifications:\n\n2+ years of work experience with a bachelor’s degree in STEM field or an Advanced degree such as Masters in STEM.\n\n\n\nPreferred Qualifications:\n\n3-5 years Expertise in SQL, Python, and relational databases.\n\nExperience with Python ML/AI frameworks (scikit-learn, PyTorch, TensorFlow).\n\nExperience in the core machine learning workflow, including data handling (cleaning, wrangling, feature engineering) and modeling with algorithms like Linear Regression, Decision Trees, and XGBoost.\n\nKnowledge using LLM ecosystems (OpenAI, Azure OpenAI, Vertex AI), fine tuning LLMs and using advanced AI techniques like RAG.\n\nKnowledge of designing feature stores and ML-ready datasets.\n\nKnowledge with large datasets using Hadoop (Hive), Spark, Python (pandas, NumPy), Presto, and SQL.\n\nKnowledge of orchestration and scheduling tools such as Airflow.\n\nUnderstanding of data warehousing, ETL/ELT, data modeling, and data architecture.\n\nUnderstanding of visualization tools (Tableau, QlikView, Power BI).\n\nStrong problem solving, analytical skills, and attention to detail.\n\nEffective communicator of statuses, issues, and risks.\n\nTeam player and collaborator, comfortable in a matrixed environment and with cross-functional delivery.\n\n\n\n\nAdditional Information\n\nVisa is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Visa will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.\n\n\n\nJob search faster with Premium\nAccess company insights like strategic priorities, headcount trends, and more\n\n\n\n\nMillions of members use Premium\n\nTry Premium for ₹0\n1 month free. Easy to cancel. No penalties or fees.\n\nAbout the company\nVisa company logo\nVisa\n2,446,655 followers\n\nFollow\nIT Services and IT Consulting  10,001+ employees  29,539 on LinkedIn\nVisa (NYSE: V) is a world leader in digital payments, facilitating transactions between consumers, merchants, financial institutions and government entities across more than 200 countries and territories. Our purpose is to uplift everyone, everywhere by being the best way to pay and be paid.\n\nLearn more at Visa.com.\n…\nshow more\n\nInterested in working with us in the future?\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company",
      "timestamp": "2026-01-12T17:09:07.477633"
    },
    {
      "id": 10,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4345306500&keywords=Data%20Scientist",
      "raw_text": "Machine Learning Intern\nIndia · 3 hours ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nRemote\n\nInternship\n\nApply\n\nSave\nSave Machine Learning Intern at Zenithbyte\nMachine Learning Intern\nZenithbyte · India (Remote)\n\nApply\n\nSave\nSave Machine Learning Intern at Zenithbyte\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nMeet the hiring team\nSanket Patil\nSanket Patil  \n 3rd+\nFounder & CEO at Unified Mentor\nJob poster\n\nMessage\nAbout the job\nMachine Learning Intern (Paid)\nCompany: ZenithByte\nLocation: Remote\nDuration: 3 Months\n📅 Application Deadline: 13th January 2026\n\nOpportunity & Benefits\n💰 Performance-based stipend up to ₹7,499\n🎁 Swags and goodies\n📜 Certificate of Internship\n✉️ Letter of Recommendation (based on performance)\n🌟 Potential full-time role based on performance\n🤝 Expert mentorship & live project exposure\nAbout ZenithByte\nZenithByte is committed to empowering students and graduates by providing real-world exposure to Machine Learning and Data Science. The organization bridges the gap between academic learning and industry expectations through live projects, expert mentorship, and performance-driven career opportunities.\nRole Overview\nAs a Machine Learning Intern, you will work with real datasets to design predictive models and explore modern AI and ML tools. This role focuses on strengthening analytical and technical skills while contributing to automation and data-driven decision-making initiatives.\nRoles & Responsibilities\nDesign, train, and optimize machine learning models for real-world applications\nPerform data preprocessing, feature engineering, and model evaluation\nDevelop predictive algorithms and data-driven solutions\nWork with ML frameworks such as TensorFlow, PyTorch, and Scikit-learn\nDocument insights, experiments, and model performance in technical reports\nRequirements\nCurrently enrolled in or recently graduated from Computer Science, AI, Data Science, or related fields\nStrong understanding of machine learning algorithms and data analysis concepts\nProficiency in Python (preferred) or R, with hands-on experience using ML libraries\nFamiliarity with data visualization tools and model evaluation techniques\nStrong analytical thinking, communication, and teamwork skills\nWhat You Will Gain\nHands-on experience with real-world machine learning projects\nPerformance-based stipend up to ₹7,499\nSwags and goodies\nCertificate of Internship upon completion\nLetter of Recommendation based on performance\nOpportunity to build an industry-ready ML portfolio\nPotential full-time role based on performance\nEqual Opportunity Statement\nZenithByte is an equal opportunity organization committed to diversity and inclusion, welcoming applicants from all backgrounds and experiences.",
      "timestamp": "2026-01-12T17:11:28.007440"
    },
    {
      "id": 11,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4352405449&keywords=Data%20Scientist",
      "raw_text": "Artificial Intelligence Intern\nIndia · 2 days ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nRemote\n\nFull-time\n\nApply\n\nSave\nSave Artificial Intelligence Intern at Skillzenloop\nArtificial Intelligence Intern\nSkillzenloop · India (Remote)\n\nApply\n\nSave\nSave Artificial Intelligence Intern at Skillzenloop\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nArtificial Intelligence Intern\nCompany: SkillzenLoop\nLocation: Remote\nEmployment Type: Internship (Full-time)\nDuration: 1–3 Months\nStipend: ₹15,000 per month\nRole Description\nSkillzenLoop is looking for a brilliant and forward-thinking Artificial Intelligence Intern to join our innovation lab. In this role, you will go beyond traditional programming to work on Generative AI, Natural Language Processing (NLP), and Computer Vision projects. You will help us explore how AI can be integrated into our core products to create smarter, more intuitive user experiences.\nPrimary Responsibilities\n• Model Implementation: Assist in the development and fine-tuning of AI models using frameworks like PyTorch, TensorFlow, or Keras.\n• LLM Exploration: Work with Large Language Models (LLMs) and explore prompt engineering and RAG (Retrieval-Augmented Generation) architectures.\n• Data Engineering: Collaborate on building data pipelines that feed into AI training environments, ensuring high-quality data inputs.\n• Algorithm Research: Review academic papers and technical documentation to stay at the cutting edge of AI trends and implement state-of-the-art techniques.\n• Prototyping: Build \"Proof of Concept\" (PoC) AI tools that solve specific business automation challenges.\nRequirements\n• Education: Currently pursuing or a recent graduate in Artificial Intelligence, Computer Science, Robotics, or a related highly technical field.\n• Technical Proficiency: Strong programming skills in Python and experience with AI libraries (e.g., Hugging Face, OpenCV, or LangChain).\n• AI Fundamentals: Solid understanding of Neural Networks, Deep Learning, and Transformers.\n• Mathematics: Strong background in Linear Algebra, Calculus, and Probability.\n• Mindset: A passion for ethical AI development and a desire to build technology that has a positive human impact.\nInternship Benefits\n• Stipend: A monthly payment of ₹15,000.\n• Certification: Official Internship Completion Certificate from SkillzenLoop.\n• Professional Growth: Performance-based Letter of Recommendation (LoR).\n• Mentorship: Direct access to AI researchers and senior engineers working on live production models.\n• Remote Culture: 100% remote work with access to advanced computing resources and a collaborative virtual environment.\n\nJob search faster with Premium\nAccess company insights like strategic priorities, headcount trends, and more\n\n\n\n\nMillions of members use Premium\n\nTry Premium for ₹0\n1 month free. Easy to cancel. No penalties or fees.",
      "timestamp": "2026-01-12T17:11:49.569434"
    },
    {
      "id": 12,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4345354444&keywords=Data%20Scientist",
      "raw_text": "Artificial Intelligence Intern \nIndia · 23 hours ago · Over 100 applicants\nPromoted by hirer · Company review time is typically 1 week\n\n\nRemote\n\nInternship\n\nEasy Apply\n\nSave\nSave Artificial Intelligence Intern  at Zetheta Algorithms Private Limited\nArtificial Intelligence Intern\nZetheta Algorithms Private Limited · India (Remote)\n\nEasy Apply\n\nSave\nSave Artificial Intelligence Intern  at Zetheta Algorithms Private Limited\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nMeet the hiring team\nAvani Shah\nAvani Shah  \n 3rd\nCo-Founder at ZeTheta Algorithms Private Limited\nJob poster\n\nMessage\nAbout the job\nAbout the Company\n\nZeTheta Algorithms Private Limited (www.zetheta.com) is a FinTech start-up which has been recently set up and is developing innovative AI tools.\nhttps://www.instagram.com/zetheta.official/\n\n\nAbout the Role\n\nWe are seeking a talented and motivated student/ fresher intern to develop AI models from scratch within a 2 month timeframe. This is an extraordinary opportunity for a self-driven, technically skilled student to build a complete enterprise-grade system that incorporates cutting-edge AI technologies including deep learning.\n\n\nResponsibilities\n\nDesign and implement the complete AI Models following provided specifications\nDevelop both frontend and backend components of the platform\nCreate and integrate AI modules\nDesign and optimize database schema and queries\nEnsure system security, especially for sensitive identity verification data\nDeploy the solution using zero-cost cloud services\nDocument code, APIs, and system architecture\nComplete the entire project within the 2 month timeline\n\n\nQualifications\n\nNo experience required. Preferably, a student who is currently pursuing or fresh graduate who has recently completed a degree in Computer Science, AI/ML, or related field.\n\n\nRequired Skills (permitted to use all LLMs)\n\nStrong programming skills in Python and JavaScript\nUnderstanding of React.js for frontend development and Node.js for backend\nKnowledge of FastAPI or similar Python web frameworks\nFamiliarity with database design and SQL (particularly PostgreSQL with Supabase)\nDeployment on AWS with CD/ CI Pipelines and Manual Environment in EC2 instance, S3\nUnderstanding of basic machine learning concepts\nSelf-motivated with ability to work independently\n\n\nPreferred Skills (permitted to use all LLMs)\n\nSound knowledge of AI/ML libraries (TensorFlow, Keras, HuggingFace Transformers)\nFamiliarity with computer vision techniques using OpenCV\nKnowledge of natural language processing concepts\nSound knowledge of facial recognition or emotion detection systems\nUnderstanding of identity verification methodologies\nDocker containerization experience\nPrior work with cloud deployment (AWS)\n\n\nWho Should Apply?\n\nStudent or fresh graduate from any academic discipline.\nStrong analytical and problem-solving skills.\nBasic knowledge of Microsoft Office.\nWillingness to self-learn and work in a fast-paced environment.\n\n\nInternship Details\n\nDuration: Self paced, options for 15days or 1,2,3,4 or 6 months.\nType: Unpaid\n\nAbout the company\nZetheta Algorithms Private Limited company logo\nZetheta Algorithms Private Limited\n371,156 followers\n\nFollow",
      "timestamp": "2026-01-12T17:12:11.131728"
    },
    {
      "id": 13,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4345354444&keywords=Data%20Scientist",
      "raw_text": "Artificial Intelligence Intern \nIndia · 23 hours ago · Over 100 applicants\nPromoted by hirer · Company review time is typically 1 week\n\n\nRemote\n\nInternship\n\nEasy Apply\n\nSave\nSave Artificial Intelligence Intern  at Zetheta Algorithms Private Limited\nArtificial Intelligence Intern\nZetheta Algorithms Private Limited · India (Remote)\n\nEasy Apply\n\nSave\nSave Artificial Intelligence Intern  at Zetheta Algorithms Private Limited\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nMeet the hiring team\nAvani Shah\nAvani Shah  \n 3rd\nCo-Founder at ZeTheta Algorithms Private Limited\nJob poster\n\nMessage\nAbout the job\nAbout the Company\n\nZeTheta Algorithms Private Limited (www.zetheta.com) is a FinTech start-up which has been recently set up and is developing innovative AI tools.\nhttps://www.instagram.com/zetheta.official/\n\n\nAbout the Role\n\nWe are seeking a talented and motivated student/ fresher intern to develop AI models from scratch within a 2 month timeframe. This is an extraordinary opportunity for a self-driven, technically skilled student to build a complete enterprise-grade system that incorporates cutting-edge AI technologies including deep learning.\n\n\nResponsibilities\n\nDesign and implement the complete AI Models following provided specifications\nDevelop both frontend and backend components of the platform\nCreate and integrate AI modules\nDesign and optimize database schema and queries\nEnsure system security, especially for sensitive identity verification data\nDeploy the solution using zero-cost cloud services\nDocument code, APIs, and system architecture\nComplete the entire project within the 2 month timeline\n\n\nQualifications\n\nNo experience required. Preferably, a student who is currently pursuing or fresh graduate who has recently completed a degree in Computer Science, AI/ML, or related field.\n\n\nRequired Skills (permitted to use all LLMs)\n\nStrong programming skills in Python and JavaScript\nUnderstanding of React.js for frontend development and Node.js for backend\nKnowledge of FastAPI or similar Python web frameworks\nFamiliarity with database design and SQL (particularly PostgreSQL with Supabase)\nDeployment on AWS with CD/ CI Pipelines and Manual Environment in EC2 instance, S3\nUnderstanding of basic machine learning concepts\nSelf-motivated with ability to work independently\n\n\nPreferred Skills (permitted to use all LLMs)\n\nSound knowledge of AI/ML libraries (TensorFlow, Keras, HuggingFace Transformers)\nFamiliarity with computer vision techniques using OpenCV\nKnowledge of natural language processing concepts\nSound knowledge of facial recognition or emotion detection systems\nUnderstanding of identity verification methodologies\nDocker containerization experience\nPrior work with cloud deployment (AWS)\n\n\nWho Should Apply?\n\nStudent or fresh graduate from any academic discipline.\nStrong analytical and problem-solving skills.\nBasic knowledge of Microsoft Office.\nWillingness to self-learn and work in a fast-paced environment.\n\n\nInternship Details\n\nDuration: Self paced, options for 15days or 1,2,3,4 or 6 months.\nType: Unpaid\n\nAbout the company\nZetheta Algorithms Private Limited company logo\nZetheta Algorithms Private Limited\n371,156 followers\n\nFollow",
      "timestamp": "2026-01-12T17:12:32.674070"
    },
    {
      "id": 14,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4345365934&keywords=Data%20Scientist",
      "raw_text": "Data Scientist \nBengaluru East, Karnataka, India · 6 hours ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nHybrid\n\nFull-time\n\nApply\n\nSave\nSave Data Scientist  at Visa\nData Scientist\nVisa · Bengaluru East, Karnataka, India (Hybrid)\n\nApply\n\nSave\nSave Data Scientist  at Visa\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nVisa is a world leader in payments and technology, with over 259 billion payments transactions flowing safely between consumers, merchants, financial institutions, and government entities in more than 200 countries and territories each year. Our mission is to connect the world through the most innovative, convenient, reliable, and secure payments network, enabling individuals, businesses, and economies to thrive while driven by a common purpose – to uplift everyone, everywhere by being the best way to pay and be paid.\n\n\nMake an impact with a purpose-driven industry leader. Join us today and experience Life at Visa.\n\n\n\n\nJob Description\n\nThe Client Services Data & AI Solutions Team builds open, trusted data and AI culture where the cost of curiosity is low, and insights are actionable. We govern transactional data and metrics, deliver usable dashboards and certified data sources, and apply analytics and AI to generate value. We partner with stakeholders, from executive leaders to customer-facing teams, ensuring data and AI assets are reliable, secure, and embedded in daily work.\n\n\nIn this specialist role, we are seeking a highly skilled AI Engineer to lead the development and integration of AI technologies into our Client Services operations. This role focuses on leveraging generative AI, machine learning operations (MLOps), AI model fine-tuning, enrichment pipelines to enhance service delivery and predictive capabilities.\n\n\nResponsibilities:\n\n\nEstablish data, AI processes and automation aligned to business and technology requirements, leveraging supported data platforms, MLOps tooling, and models. \nBuild production-grade AI services: LLM-based applications, RAG pipelines, recommendation systems, forecasting, and classification\nDevelop and maintain data models and schemas optimized for analytics, ML feature stores, and AI workloads. \nDeliver data engineering and AI projects end to end: ingestion, modeling, pipeline development, feature engineering, model training, deployment, and monitoring. \nUse best practices in data architecture and governance and provide expertise in data modeling, and MLOps. \nCollaborate with cross-functional teams to translate requirements into data and AI solutions. \nImplement data validation, quality checks, and model evaluation at each stage. \nApply Agile principles to plan, build, test, and iterate data & AI solutions, document architectures, dictionaries, and models. \nCommunicate complex data and AI concepts clearly to technical and non-technical audiences. \nStay current on trends in cloud engineering, distributed computing, LLMs, databases, orchestration etc. \nThis is a hybrid position. Expectation of days in office will be confirmed by your hiring manager.\n\n\n\n\nQualifications\n\nBasic Qualifications:\n\n2+ years of work experience with a bachelor’s degree in STEM field or an Advanced degree such as Masters in STEM.\n\n\n\nPreferred Qualifications:\n\n3-5 years Expertise in SQL, Python, and relational databases.\n\nExperience with Python ML/AI frameworks (scikit-learn, PyTorch, TensorFlow).\n\nExperience in the core machine learning workflow, including data handling (cleaning, wrangling, feature engineering) and modeling with algorithms like Linear Regression, Decision Trees, and XGBoost.\n\nKnowledge using LLM ecosystems (OpenAI, Azure OpenAI, Vertex AI), fine tuning LLMs and using advanced AI techniques like RAG.\n\nKnowledge of designing feature stores and ML-ready datasets.\n\nKnowledge with large datasets using Hadoop (Hive), Spark, Python (pandas, NumPy), Presto, and SQL.\n\nKnowledge of orchestration and scheduling tools such as Airflow.\n\nUnderstanding of data warehousing, ETL/ELT, data modeling, and data architecture.\n\nUnderstanding of visualization tools (Tableau, QlikView, Power BI).\n\nStrong problem solving, analytical skills, and attention to detail.\n\nEffective communicator of statuses, issues, and risks.\n\nTeam player and collaborator, comfortable in a matrixed environment and with cross-functional delivery.\n\n\n\n\nAdditional Information\n\nVisa is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Visa will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.\n\n\n\nAbout the company\nVisa company logo\nVisa\n2,446,659 followers\n\nFollow\nIT Services and IT Consulting  10,001+ employees  29,539 on LinkedIn\nVisa (NYSE: V) is a world leader in digital payments, facilitating transactions between consumers, merchants, financial institutions and government entities across more than 200 countries and territories. Our purpose is to uplift everyone, everywhere by being the best way to pay and be paid.\n\nLearn more at Visa.com.\n…\nshow more\n\nInterested in working with us in the future?\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company",
      "timestamp": "2026-01-12T17:12:54.188294"
    },
    {
      "id": 15,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4328828438&keywords=Data%20Scientist",
      "raw_text": "Junior AI & Data Engineer\nBengaluru, Karnataka, India · 2 weeks ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nRemote\n\nFull-time\n\nApply\n\nSave\nSave Junior AI & Data Engineer at OmniReach\nJunior AI & Data Engineer\nOmniReach · Bengaluru, Karnataka, India (Remote)\n\nApply\n\nSave\nSave Junior AI & Data Engineer at OmniReach\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nJob Description\nThis is a remote position.\nRole Overview\nWe are hiring smart, analytical freshers and early-career engineers passionate about data, mathematics, problem-solving, and building systems. This is a developmental role aimed at nurturing strong fundamentals in Data Science, Machine Learning, and Data Engineering over time. You will work on real-world data problems, assisting in building AI/ML solutions and data pipelines under the mentorship of senior engineers and scientists.\n________________________________________\nKey Responsibilities\n• Assist in data collection, cleaning, transformation, and analysis for machine learning projects.\n• Write clean, efficient Python code for data preparation, ETL processes, and feature engineering.\n• Support the development of basic ML models under guidance — starting with regression, classification, and clustering.\n• Create dashboards, reports, or simple visualizations for data insights.\n• Document workflows, processes, and learnings to build strong technical and analytical practices.\n• Learn and apply cloud concepts (AWS/GCP/Azure basics) and SQL best practices over time.\n\n\nRequirements\nRequired Skills\n\n\n\n• Strong Python programming skills: pandas, NumPy, basic scikit-learn.\n• Good understanding of Statistics (mean, variance, correlation, regression) and Linear Algebra basics (vectors, matrices).\n• Basic exposure to SQL and relational databases.\n• Strong logical and analytical thinking skills.\n• Willingness to learn Machine Learning, MLOps, and Data Engineering practices.\n• Ability to work in a fast-paced, agile environment with minimal supervision.\n\n\nPreferred Skills (Nice to Have)\n\n\n\n• Exposure to cloud platforms (AWS, GCP, Azure).\n• Experience with basic machine learning models or Kaggle competitions.\n• Basic understanding of REST APIs, Jupyter Notebooks.\n• Freshers who love mathematics + programming + problem-solving.\n\nJob search faster with Premium\nAccess company insights like strategic priorities, headcount trends, and more\n\n\n\n\nMillions of members use Premium\n\nTry Premium for ₹0\n1 month free. Easy to cancel. No penalties or fees.",
      "timestamp": "2026-01-12T17:34:07.949414"
    },
    {
      "id": 16,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4360626723&keywords=Data%20Scientist",
      "raw_text": "Operations & Data Analyst\nIndia · 15 hours ago · Over 100 applicants\nPromoted by hirer · No response insights available yet\n\n\nRemote\n\nFull-time\n\nEasy Apply\n\nSave\nSave Operations & Data Analyst at RivetStays\nOperations & Data Analyst\nRivetStays · India (Remote)\n\nEasy Apply\n\nSave\nSave Operations & Data Analyst at RivetStays\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nRivetStays is a Toronto-based premium short- and mid-term rental operator. We run a data-driven hospitality business and are building internal systems that scale.\nWe’re hiring an Operations & Data Analyst to handle a wide range of internal operational, business, and data tasks — from ad-hoc ops work and data cleanup, to writing SQL and maintaining dashboards in Metabase / Looker Studio.\nThis is a generalist execution role with a strong analytics component. Work is internal (not customer-facing) and varies week to week.\n\n\nWhat You’ll Do\n\nYou will own a mix of operational and analytical work, including:\n• Execute ad-hoc internal operational and business tasks\n\n (updating documents, filling forms, maintaining logs, moving data between systems)\n• Clean, format, and maintain data in Google Sheets\n\n• Scrub and standardize operational data (addresses, listings, bookings, records)\n• Reconcile data across multiple tools and sources\n• Write SQL queries to answer internal business questions\n• Build and maintain dashboards and reports in Metabase and / or Looker Studio\n\n• Produce weekly and monthly summaries and KPI views\n• Document assumptions, edge cases, and work completed clearly\nOperational and business tasks take priority; analytics and dashboarding build on top of that work.\n\n\nWhat We’re Looking For\n\nRequired\n\nStrong attention to detail\nSolid problem-solving and critical thinking\nComfort handling a wide variety of tasks\nStrong Google Sheets skills\nAbility to write basic to intermediate SQL\n\nExperience building dashboards in Metabase, Looker Studio, or similar\nClear written communication\nReliable and execution-focused\n\n\nNice to Have\n\nExposure to automation or scripting\nPrior experience in operations, analytics, or data support roles\n\n\nCompensation & Location\n\nRemote\n~$500–900/month depending on experience\nOpportunity to take on more responsibility over time\n\n\n📨 How to Apply\nTo apply, please upload your resume here >>>> https://app.testgorilla.com/s/3c04v1p0",
      "timestamp": "2026-01-12T17:41:10.516255"
    },
    {
      "id": 17,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4359495640&keywords=Data%20Scientist",
      "raw_text": "Associate data scientist - ML Track \nJaipur, Rajasthan, India · 2 days ago · Over 100 applicants\nPromoted by hirer · Actively reviewing applicants\n\n\nOn-site\n\nFull-time\n\nEasy Apply\n\nSave\nSave Associate data scientist - ML Track  at SoftSensor.ai\nAssociate data scientist - ML Track\nSoftSensor.ai · Jaipur, Rajasthan, India (On-site)\n\nEasy Apply\n\nSave\nSave Associate data scientist - ML Track  at SoftSensor.ai\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nCompany Overview\nSoftSensor AI is a data science and analytics professional services firm headquartered in New Jersey, with delivery centers in India. We build AI/ML solutions that help organizations improve performance, reduce operational cost, and create intelligent products. Our teams operate across data, modeling, and engineering to ship measurable outcomes.Role Overview\nSoftSensor AI is hiring an Associate – Data Science for our Jaipur office. In this role, you will develop machine learning models, run disciplined experiments, and contribute to production-ready solutions. You will collaborate with senior data scientists and engineers to move from problem definition to model evaluation, integration, and performance measurement.Key Responsibilities\nBuild and evaluate machine learning models (regression, classification, clustering, time series) for client and product use cases.\nPerform data preprocessing, feature engineering, and EDA for structured and, when required, unstructured data.\nEstablish strong baselines and iterate systematically via error analysis, ablations, and metric-driven improvements.\nDesign evaluation methodologies (cross-validation, holdouts, leakage checks) and select appropriate metrics (precision/recall, ROC-AUC, RMSE, etc.).\nPartner with engineering on deployment patterns (batch scoring, APIs), model packaging, and monitoring (performance and drift proxies).\nDocument model assumptions, limitations, and risks; support stakeholder reviews with clear narratives and recommendations.\nContribute reusable code and internal accelerators (evaluation harnesses, preprocessing utilities, templates).\nMaintain standards for reproducibility and quality (version control, experiment tracking, clean code practices).\nRequired Qualifications\nBachelor’s/Master’s in Mathematics, Statistics, Computer Science, Engineering, or related quantitative fields.\n0–2 years of experience in data science or ML (internships and substantial project work considered).\nStrong understanding of ML fundamentals: bias/variance, overfitting, regularization, evaluation metrics, and error analysis.\nProficiency in Python and common ML/data libraries (NumPy, pandas, scikit-learn).\nWorking knowledge of SQL and data extraction from relational systems; familiarity with NoSQL is a plus.\nStrong analytical thinking and problem-solving ability.\nStrong communication skills—ability to explain results and tradeoffs to non-technical stakeholders.\nPreferred Qualifications (Nice to Have)\nExposure to deep learning (PyTorch/TensorFlow), computer vision, NLP, or LLM/RAG workflows.\nFamiliarity with MLOps tools (MLflow), Docker, CI/CD basics, model monitoring, or cloud ML platforms (Azure preferred).\nExperience working with noisy labels, imbalanced datasets, or real-world production constraints.\nHigh academic performance and/or strong portfolio (GitHub/Kaggle/projects).\nWhat Success Looks Like (First 3–6 Months)\nDelivered at least one model component into a real workflow (v1 in production or pilot), with measurable improvement over baseline.\nDemonstrated disciplined evaluation and strong documentation.\nCollaborated effectively with engineering and stakeholders to operationalize results.",
      "timestamp": "2026-01-12T17:41:32.028541"
    },
    {
      "id": 18,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4332567952&keywords=Data%20Scientist",
      "raw_text": "Fresher\nDelhi, India · 53 minutes ago · 16 applicants\nCompany review time is typically 1 week\n\n\nOn-site\n\nFull-time\n\nEasy Apply\n\nSave\nSave Fresher at Aimlay\nFresher\nAimlay · Delhi, India (On-site)\n\nEasy Apply\n\nSave\nSave Fresher at Aimlay\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nMeet the hiring team\nKashish C.\nKashish C.  \n 3rd+\nHR Talent Acquisition Manager | Talent Acquisition | HR Operations | Onboarding | Payroll | End to End Recruitment | Looking for a job? Drop your CV\nJob poster\n\nMessage\nAbout the job\n𝙒𝙚’𝙧𝙚 𝙃𝙞𝙧𝙞𝙣𝙜: 𝙇𝙚𝙖𝙙 𝙍𝙚𝙨𝙚𝙖𝙧𝙘𝙝 & 𝘿𝙚𝙫𝙚𝙡𝙤𝙥𝙢𝙚𝙣𝙩 𝙀𝙭𝙚𝙘𝙪𝙩𝙞𝙫𝙚\n📍 𝙇𝙤𝙘𝙖𝙩𝙞𝙤𝙣: 𝙍𝙤𝙝𝙞𝙣𝙞, 𝘿𝙚𝙡𝙝𝙞 (𝙒𝙤𝙧𝙠 𝙁𝙧𝙤𝙢 𝙊𝙛𝙛𝙞𝙘𝙚)\n🕒 𝙎𝙝𝙞𝙛𝙩: 𝙐𝙎 𝙎𝙝𝙞𝙛𝙩 (9:30 𝙋𝙈 – 6:30 𝘼𝙈 𝙄𝙎𝙏)\n\n\n𝘼𝙗𝙤𝙪𝙩 𝙩𝙝𝙚 𝙍𝙤𝙡𝙚\nAs a Lead Research & Development Executive, you will ensure that every lead is correct, verified, and ready for the sales team. Your role will involve outbound calling, CRM updates, and close coordination with the sales department to maintain high-quality leads.\n\n\n𝙆𝙚𝙮 𝙍𝙚𝙨𝙥𝙤𝙣𝙨𝙞𝙗𝙞𝙡𝙞𝙩𝙞𝙚𝙨\n✅ Make outbound calls daily using provided leads\n✅ Verify and screen customer details to ensure correctness\n✅ Update CRM with accurate information from calls\n✅ Maintain high-quality leads before passing to counsellors\n✅ Work closely with the Sales team for smooth lead allocation\n\n\n𝙒𝙝𝙖𝙩 𝙒𝙚’𝙧𝙚 𝙇𝙤𝙤𝙠𝙞𝙣𝙜 𝙁𝙤𝙧\n🎓 Any graduate\n 🗣 Excellent English communication (spoken & written)\n 💻 Good knowledge of CRM tools\n 🌙 Comfortable with US shift (9:30 PM – 6:30 AM IST)\n ⚡ Highly energetic and motivated for rapid growth\n\n\n📩 Interested? Apply now or share your CV at kashish.chawla@aimlay.com\n\n\n\nAbout the company\nAimlay company logo\nAimlay\n48,748 followers\n\nFollow\nEducation Administration Programs  201-500 employees  277 on LinkedIn",
      "timestamp": "2026-01-12T17:41:53.538737"
    },
    {
      "id": 19,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4332597320&keywords=Data%20Scientist",
      "raw_text": "Data Scientist\nGurugram, Haryana, India · 1 hour ago · Over 100 applicants\nPromoted by hirer · No response insights available yet\n\n\nOn-site\n\nFull-time\n\nEasy Apply\n\nSave\nSave Data Scientist at MobiKwik\nData Scientist\nMobiKwik · Gurugram, Haryana, India (On-site)\n\nEasy Apply\n\nSave\nSave Data Scientist at MobiKwik\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nMeet the hiring team\nAtul Chugh\nAtul Chugh  \n 3rd+\nAssociate Director Talent Acquisition I Leadership Hiring l Head Hunting l Workforce Planning l Fintech l Technology l Strategic Expansion\nJob poster\n\nMessage\nAbout the job\nMobikwik is India's leading Digital Financial Services platform & Largest Digital Wallet, trusted by over 167 million users & 4.4 million businesses. As a pioneer in the Fintech space, Mobikwik empowers its users with a robust suite of services, including Digital payments, Credit & Investments. Recently, Mobikwik achieved a significant milestone with its Initial Public Offering (IPO), marking a new chapter in its journey of innovation & growth. With a mission to democratize financial inclusion, Mobikwik continues to transform how Indians manage their money, offering secure, seamless & user-friendly solutions that cater to a diverse range of financial needs. \n\n\n\nJoin us on our journey to democratize access to financial services for a billion Indians.\n\n\n\nJob Title: Data Scientist\nLocation: Gurgaon (Work from Office)\n\n\nAbout the Role :\n\nWe are looking for a Data Scientist specializing in Fraud/Lending Risk, Collections, Churn/propensity models for our fintech products. You will work closely with Risk, Engineering, Product, and Compliance teams to develop scalable systems while balancing customer experience and business risk. The role combines strong modelling expertise with hands-on experience deploying models\nusing AWS cloud services and CI/CD pipelines.\n\n\nKey Responsibilities\n\nBuild and enhance fraud/credit risk models including:\nApproval / underwriting PD based models\nRisk-based pricing models\nPerform feature engineering using transactional, behavioural, device, and third-party data.\nContinuously monitor model performance using metrics such as KS, AUC, precision-\nrecall, false positives, and fraud capture rate.\nPerform cut-off and policy optimization balancing risk and growth\nMonitor portfolio health using PSI/CSI, bad rates, vintage curves, and roll rates\nOptimize collection strategies, channel allocation, and contact timing\nMeasure impact using uplift, retention rate, and lifetime value metrics\n\n\nRequired Qualifications\n\nBachelor’s or Master’s degree in Computer Science, Statistics, Mathematics or related field.\n3+ years of experience in data science (fintech/banking preferred).\nHands-on experience working on fraud risk, lending risk, collection and\npropensity problems.\n\n\nTechnical Skills\n\nStrong proficiency in Python, Pyspark and ML/AI frameworks\nSolid SQL skills for large-scale data analysis\nHands-on experience with AWS SageMaker for model training and deployment\nExperience building serverless workflows using AWS Lambda\nFamiliarity with Jenkins for CI/CD, automated testing, and deployments\nExperience with model monitoring, validation, and explainability\nExperience with big data tools (Spark, Hive, Presto).\nExperience working with Large Language Models (LLMs), including various prompt\nengineering techniques, word embeddings and vector databases. and understanding of\nAgentic Architecture is a plus.\nExperience with one or more of the following tools and frameworks – LangChain,\nLangGraph, OpenAI Assistants API, AutoGen, etc.\nStrong knowledge and understanding of natural language processing (NLP)\ntechniques and algorithms, and their practical\n\n\nWhy Mobikwik?\n\nWork with a fast-paced and innovative team in one of India’s leading fintech companies.\nBe a part of a company that is transforming digital payments and financial services.",
      "timestamp": "2026-01-12T17:42:21.495098"
    },
    {
      "id": 20,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4351868610&keywords=Data%20Scientist",
      "raw_text": "Business Analyst Intern (Entry Level) | Reporting • Analysis | Remote\nIndia · 25 minutes ago · 7 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nRemote\n\nInternship\n\nApply\n\nSave\nSave Business Analyst Intern (Entry Level) | Reporting • Analysis | Remote at Wake Up Whistle\nBusiness Analyst Intern (Entry Level) | Reporting • Analysis | Remote\nWake Up Whistle · India (Remote)\n\nApply\n\nSave\nSave Business Analyst Intern (Entry Level) | Reporting • Analysis | Remote at Wake Up Whistle\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\n📈 Business Analyst Intern | Remote | Virtual Internship\n\nLocation: Remote\nMode: Virtual Internship\nInternship Type: Unpaid\nDuration: Flexible\nTiming: Flexible Hours\n🔍 About the Internship\nSkillfied Mentor is offering a Remote Business Analyst Internship for students and freshers who want to gain practical exposure to business analysis, research, and reporting. This internship focuses on real-world business understanding and structured analytical thinking.\n✅ Eligibility (Open for All)\n• Freshers are welcome\n• Undergraduate students can apply\n• No prior experience required\n• Anyone interested in business analysis can apply\n🛠 Skills You Will Work On\n• Market & business research\n• Data interpretation & reporting\n• Documentation & requirement analysis\n• Basic tools (Excel, presentations, reports)\n🎯 What You Will Get\n• Virtual & remote internship experience\n• Flexible working hours & duration\n• Mentorship & guidance\n• Internship completion certificate (performance-based)\n• Exposure to real business use cases\n⚠️ Important Note:\n\nThis is an unpaid internship focused on learning, skill development, and practical exposure.\n📌 Limited Slots Available. Early applicants will be preferred.",
      "timestamp": "2026-01-12T17:42:42.998304"
    },
    {
      "id": 21,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4326425001&keywords=Data%20Scientist",
      "raw_text": "Journalists - Website\nNoida, Uttar Pradesh, India · 1 month ago · Over 100 people clicked apply\nResponses managed off LinkedIn\n\n\nHybrid\n\nFull-time\n\nApply\n\nSave\nSave Journalists - Website at Brut India\nJournalists - Website\nBrut India · Noida, Uttar Pradesh, India (Hybrid)\n\nApply\n\nSave\nSave Journalists - Website at Brut India\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nLocation: Noida\n\nAbout Brut\n\nBrut is a leading international digital media company, known for producing compelling, socially conscious journalism in innovative formats. As a video and social-first publisher, we are the most-watched media brand on social platforms across Europe and South Asia, with over 50 billion global views, and are expanding rapidly in the United States. Brut also offers advertising network solutions, enabling brands to reach audiences effectively across the digital sphere.\n\nBrut India is the fastest-growing digital video publisher in the country. As a young platform, we’re reshaping how news and branded content are consumed in the digital age—combining creativity, credibility, and cultural relevance.\n\nAbout The Role\n\nWe are looking for a passionate and curious fresher to join our editorial team as a Website Journalist. The ideal candidate should have strong writing skills, a keen interest in news and current affairs, and the ability to create clear, engaging, and well-researched content for digital audiences.\n\nKey Responsibilities\n\nWrite news articles, features, and short explainers for the website.\n\nResearch topics, gather information, and ensure factual accuracy.\n\nFollow the editorial style and tone of the brand.\n\nStay updated with daily news, trends, and relevant topics.\n\nAssist the team with content updates, proofreading, and basic publishing tasks.\n\nCoordinate with editors and designers for a smooth story workflow.\n\nLearn and follow SEO-friendly writing and digital publishing best practices.\n\nWrite and edit original stories for Brut India’s website across news, culture, lifestyle and social impact.\n\nCraft SEO-friendly headlines, intros and copy without compromising editorial integrity.\n\nQualifications\n\nBachelor’s degree in Journalism, Mass Communication, English, or related field\n\nInternship Experience In Writing/journalism (preferred But Not Mandatory)\n\nWriting samples or portfolio will be an added advantage\n\nRequired Skills\n\nStrong writing and communication skills\n\nBasic understanding of news and current events\n\nInterest in digital media and online storytelling\n\nResearch ability and attention to detail\n\nWillingness to learn SEO and website publishing tools\n\nAbility to work under deadlines\n\nTeam player with a proactive attitude.\n\nSee curated AI tools for your job search\nGet hired faster with the help of AI tools built by verified companies like Kickresume, Exponent Interview Prep, and more.\n\nGet started",
      "timestamp": "2026-01-12T17:43:04.564024"
    },
    {
      "id": 22,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4352663707&keywords=Data%20Scientist",
      "raw_text": "Generative AI Engineer \nPune, Maharashtra, India · 34 minutes ago · 30 applicants\nPromoted by hirer · No response insights available yet\n\n\nOn-site\n\nFull-time\n\nEasy Apply\n\nSave\nSave Generative AI Engineer  at Vsynergize AI\nGenerative AI Engineer\nVsynergize AI · Pune, Maharashtra, India (On-site)\n\nEasy Apply\n\nSave\nSave Generative AI Engineer  at Vsynergize AI\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nExperience - 1+ Years\nLocation: Pune\nWorking Mode - Work from Office \n\nLooking for Immediate joiner/Early Joiner \n\n\n\nKey Responsibilities:\n\n● Design, build, and optimize AI models, particularly those leveraging LLMs.\n● Engineer prompts for effective interaction with foundational models (OpenAI, Claude, etc.).\n● Develop and integrate APIs for scalable AI-powered solutions.\n● Deploy backend services and AI models on cloud platforms (AWS, GCP, Azure).\n● Work on NLP tasks such as text classification, summarization, semantic search, etc.\n● Collaborate with cross-functional teams to understand business needs and translate them into AI solutions.\n● Ensure model and code quality through testing, performance evaluation, and documentation.\n● Continuously explore new advancements in AI and contribute to improving internal tools and workflows.\n\n\nRequired Skills & Experience:\n\n● 1+ years of experience in software development with a focus on AI/ML.\n● Strong proficiency in Python.\n● Knowledge of frameworks like LangChain, RAG, or vector databases (e.g., FAISS,\nPinecone).\n● Hands-on experience with LLMs, prompt engineering, and NLP techniques.\n● Familiarity with API development and third-party API integrations.\n● Experience working with cloud platforms (AWS, Google Cloud, Azure).\n● Understanding of backend services and deployment best practices.\n● Solid knowledge of data modeling, with a focus on language data.\n● Strong problem-solving skills and critical thinking.\n● Excellent communication and collaboration abilities.",
      "timestamp": "2026-01-12T17:43:26.109867"
    },
    {
      "id": 23,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4352425083&keywords=Data%20Scientist",
      "raw_text": "Deep Learning Specialist\nIndia · 1 day ago · Over 100 applicants\nPromoted by hirer · Actively reviewing applicants\n\n\nRemote\n\nContract\n\nEasy Apply\n\nSave\nSave Deep Learning Specialist at Moleculyst\nDeep Learning Specialist\nMoleculyst · India (Remote)\n\nEasy Apply\n\nSave\nSave Deep Learning Specialist at Moleculyst\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nCompany Description\nMoleculyst Ventures Private Limited is a deep-tech biotechnology startup operating at the intersection of computational biology, artificial intelligence, and genomics, with a mission to enable precision and personalized healthcare.\nWe focus on modeling complex biological systems by uncovering interactions between genetics, molecular structure, and environmental factors. Our work spans AI-driven diagnostics, therapeutic discovery, and preventive healthcare, leveraging graph-based representations, large-scale biological datasets, and first-principles reasoning. Moleculyst aims to empower clinicians and researchers with scientifically grounded, next-generation computational tools.Role Description – Deep Learning Specialist (GNN-Focused)\nThis is a remote contract role for a Deep Learning Specialist with prior hands-on experience in Graph Neural Networks (GNNs) and a strong mathematical foundation.\nThe role involves designing, implementing, and optimizing deep learning models for large-scale biological data, including molecular, genomic, and interaction networks. You will work closely with interdisciplinary teams spanning biology, chemistry, and data science to develop theoretically sound and practically effective models for real-world biomedical problems.\nThis is not a plug-and-play ML role — we are looking for individuals who understand why models work, not just how to run them.Key Responsibilities\nDesign and implement deep learning architectures, with a strong emphasis on Graph Neural Networks (GNNs) for biological and molecular data\nDevelop models for molecular graphs, protein/peptide structures, interaction networks, and omics data\nResearch, evaluate, and implement state-of-the-art methods (message passing, equivariant models, attention mechanisms, representation learning)\nPerform rigorous model evaluation, ablation studies, and error analysis grounded in both math and domain context\nAutomate training, evaluation, and experimentation pipelines for large datasets\nCollaborate with biologists and domain experts to translate biological hypotheses into computational models\nAnalyze results to extract scientifically interpretable and actionable insights\nRequired Qualifications (Non-Negotiable)Deep Learning & Mathematics\nStrong understanding of deep learning fundamentals, including:\nLinear algebra, probability, optimization\nBackpropagation, loss functions, regularization\nBias–variance tradeoffs and generalization\nProven experience with Graph Neural Networks, such as:\nGCN, GAT, MPNN, Graph Transformers, or related architectures\nPractical understanding of message passing, aggregation, and graph representations\nAbility to derive, reason about, and modify model formulations, not just apply libraries\nProgramming & Frameworks\nStrong proficiency in Python\nHands-on experience with PyTorch (preferred) and/or TensorFlow\nFamiliarity with ML/DL tooling for experimentation, logging, and reproducibility\nBiological Data Experience\nPrior experience handling biological or molecular datasets (e.g., genomics, proteomics, peptides, molecular graphs, interaction networks)\nFamiliarity with bioinformatics workflows, data preprocessing, and domain constraints\nAbility to bridge biological intuition and mathematical modeling\nPreferred / Advantageous Qualifications\nExperience with equivariant or physics-informed models (e.g., geometric deep learning)\nExposure to protein language models, molecular descriptors, or structural biology data\nExperience deploying or training models on cloud platforms (AWS, GCP, Azure)\nMaster’s or Ph.D. in Computer Science, Bioinformatics, Computational Biology, Applied Mathematics, Physics, or related fields\nWhat We Value Most\nDepth over buzzwords\nMathematical clarity over black-box usage\nCuriosity, rigor, and the ability to question assumptions\nPrior real work on GNNs, not just coursework or tutorials\nIf someone cannot explain their model mathematically, they are not a fit.\n\nJob search faster with Premium\nAccess company insights like strategic priorities, headcount trends, and more\n\n\n\n\nMillions of members use Premium\n\nTry Premium for ₹0\n1 month free. Easy to cancel. No penalties or fees.",
      "timestamp": "2026-01-12T17:43:47.626702"
    },
    {
      "id": 24,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4358951917&keywords=Data%20Scientist",
      "raw_text": "AI Developer Intern (6 months paid internship) \nIndia · 4 days ago · Over 100 applicants\nPromoted by hirer · Actively reviewing applicants\n\n\nRemote\n\nInternship\n\nEasy Apply\n\nSave\nSave AI Developer Intern (6 months paid internship)  at Forage AI\nAI Developer Intern (6 months paid internship)\nForage AI · India (Remote)\n\nEasy Apply\n\nSave\nSave AI Developer Intern (6 months paid internship)  at Forage AI\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nLocation: Remote (Work from Home)\n\n\nAbout Forage AI:\n\nForage AI delivers large-scale data collection and processing platforms, including web crawlers, document parsers, data pipelines, AI/Agentic Solutions, and AI-assisted workflows.\nOur primary programming language is Python. We design both cloud-native and cloud-agnostic solutions, primarily on AWS, while also working with GCP and Azure. We value high ownership, strong collaboration, and pragmatic, well-documented engineering.\n\n\nponsibilities:\n\nImplement cutting-edge AI and ML algorithms/models in collaboration with the R&D team.\nStay updated with the latest AI/ML advancements and apply them to real-world problems.\nDevelop and fine-tune machine learning models using Python and popular ML libraries.\nAssist in Natural Language Model (NLM) and Language Understanding System (LUS) development.\nParticipate in creative problem-solving during brainstorming sessions.\nCollaborate across teams to deliver AI-driven solutions aligning with project objectives.\n\n\nQualifications:\n\nPursuing or recently obtained a Bachelor's in Computer Science, AI, ML, or related field.\nGood experience in Python coding and familiarity with TensorFlow, PyTorch, scikit-learn, etc.\nStrong grasp of AI/ML concepts, algorithms, and techniques.\nStrong hold on Data Structure and algorithm design.\nFamiliarity with LLM frameworks such as LangChain or CrewAI.\nKnowledge of data extraction techniques and web crawling.\nPractical experience with AI/ML models, including research paper contributions.\nExceptional analytical and problem-solving skills.\nExcellent written and verbal communication.\nBonus: Demonstrated research and publication record.\nBonus: Experience in building/fine-tuning Language Understanding Models (LLMs).\n\n\n\n\nWork‑from‑Home Requirements:\n\nHigh‑speed internet for calls and collaboration.\nA capable, reliable computer (modern CPU, 16GB+ RAM).\nHeadphones with clear audio quality.\nStable power and backup arrangements.\n\n\nForage AI is an equal opportunity employer. We value curiosity, craftsmanship, and collaboration.\n\n\nJob search faster with Premium\nAccess company insights like strategic priorities, headcount trends, and more\n\n\n\n\nMillions of members use Premium\n\nTry Premium for ₹0\n1 month free. Easy to cancel. No penalties or fees.",
      "timestamp": "2026-01-12T17:44:15.603380"
    },
    {
      "id": 25,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4340218319&keywords=Data%20Scientist",
      "raw_text": "Math Teacher (US Shift) \nIndia · Reposted 3 weeks ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nRemote\n\nPart-time\n\nApply\n\nSave\nSave Math Teacher (US Shift)  at Bhanzu\nMath Teacher (US Shift)\nBhanzu · India (Remote)\n\nApply\n\nSave\nSave Math Teacher (US Shift)  at Bhanzu\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nMeet the hiring team\nAshish Budaga\nAshish Budaga  \n 3rd+\nAssociate Director Talent Acquisition & Management | Award winning Author | NLP Practitioner | Life Coach | Leadership Coach\nJob poster\n\nMessage\n\nShow all\nAbout the job\n🚀 Part-Time Math Trainer (Online, Grades UKG–8) – Work From Home\n\n👩 🏫 Love teaching but tired of sales targets or PPT creations?\n\n\n\nAt Bhanzu, you can focus 100% on what you love: teaching and inspiring students.\n✔️ No student enrollments or lead calling\n\n✔️ No content creation — we provide the curriculum\n\n✔️ No marketing — just deliver joyful learning!\n\n🧠 Make Math Fearless, Fun & Foundational\n\n\n\nWe’re on a mission to eliminate math fear and help young learners build lifelong confidence. As a Math Trainer, you’ll conduct high-impact online classes for students across UKG to Grade 8 — using engaging methods and real-life examples to bring math concepts to life.\n\n\n🌍 Join a global learning movement — over 30,000 students, 15+ countries, and counting!\nFounded by Neelakantha Bhanu, the World’s Fastest Human Calculator and TEDx speaker.\n\n\n📝 What You’ll Do\n\nDeliver engaging, intuitive, and joyful online math classes\nUse real-world stories, analogies, and examples to simplify concepts\nCustomize your approach based on learner needs and age\nTrack progress and share feedback with parents\nTeach students from India, US, UK, ANZ, GCC & more\nFollow Bhanzu’s pedagogy and training guidelines\n\n\n✅ What You Need\n\nStrong command over school-level math (UKG–Grade 8)\nBachelor’s degree in Math, Science, Engineering, or related field\nExcellent English communication with a neutral/clear accent\nPrior teaching experience preferred (online or offline)\nQuiet space, laptop, webcam, mic, stable internet, power backup\n\n\n⏰ Time Commitment & Slots (IST)\n\n3 to 6 hours/day | 6 days/week (1 weekday off)\nPreferred Slot: 3 AM – 7 AM\nOther Slots: 11 PM – 3 AM | 11 AM – 3 PM | 5 PM – 10 PM\n📝 Note: Final slot allocation will depend on your availability and performance in the selection process.\n\n\n\n💰 Compensation\n\nPer-session pay + monthly performance bonuses\nMost trainers earn ₹25,000–₹35,000/month\nTop performers earn ₹45,000+\nPayout varies by slot, sessions handled, and region\n\n\n🌟 Why Join Bhanzu?\n\n✔️ No sales, enrollment, or marketing pressure\n✔️ No content creation — ready-made lessons provided\n✔️ Dynamic, high-energy work culture\n✔️ Be part of a global team of 1100+ educators\n✔️ Regular upskilling via Bhanzu’s curated training programs\n✔️ Real impact — help children build confidence in Math\n\n\n📋 Selection Process\n\nScreening Call (10 mins)\nMath Aptitude Test (45 mins – school-level MCQs)\nLive Demo (15–25 mins, content shared in advance)\nOrientation & Training\n\n\n🔗 Apply now and join the movement to make Math fearless.\n\n\n\n#MathJobs #EdTechJobs #RemoteTeaching #OnlineMathTeacher\n#PartTimeJobsIndia #WorkFromHome #MathTrainer #TeacherHiring\n#WomenWhoTeach #JobsInEducation #OnlineTutoring #STEMEducation\n#HiringNow #TeacherJobs #EducationCareers\n\nAbout the company\nBhanzu company logo\nBhanzu\n330,848 followers\n\nFollow\nEducation  501-1,000 employees  1,835 on LinkedIn\nBhanzu, founded by the World's Fastest Human Calculator is a math-learning platform with a meticulously designed curriculum that helps students become 4x quicker and better at math by nurturing their cognitive abilities and building their core math acumen.\n\nThe vision of Bhanzu is to build the most thought through math curriculum using personalised AI-aided methodology, which builds confidence in students, by enabling them to apply math in the real world.\n…\nshow more\n\nInterested in working with us in the future?\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company",
      "timestamp": "2026-01-12T17:44:37.139645"
    },
    {
      "id": 26,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4337263215&keywords=Data%20Scientist",
      "raw_text": "Machine Learning Consultant\nIndia · Reposted 3 weeks ago · Over 100 applicants\nPromoted by hirer · Actively reviewing applicants\n\n\nRemote\n\nContract\n\nEasy Apply\n\nSave\nSave Machine Learning Consultant at Sony Research India\nMachine Learning Consultant\nSony Research India · India (Remote)\n\nEasy Apply\n\nSave\nSave Machine Learning Consultant at Sony Research India\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nSony Research India is driving cutting-edge research and development in various locations around the globe, including laboratories in Japan, the United States, Europe, and Asia. We endeavor to create new technology, products, and services while sustaining Sony Group’s diverse businesses in electronics, entertainment, and financial fields. For our research centre to blaze a trail in the latest technologies, we seek to foster the growth of a diverse pool of research and engineering talent and create a technology talent bank to drive research excellence worldwide. Sony Research India is offering outstanding career opportunities around frontline technologies such as AI and data analytics.\n\n\nWe are looking for a highly motivated research consultant who can assist in our research and development efforts on large-scale user engagement predictive models. The ideal candidate should have prior experience in Deep Learning, Natural Language Processing.\n\n\nKey Responsibility:\n\n• Developing models to analyze user behavior patterns on OTT platforms and predicting their likelihood of leaving, along with plausible reasons behind their behavior.\n• Building causal inference–based intervention models aimed at retaining users on the platform.\n• Contributing to developing and evaluating models (including user engagement foundation model) leveraging pre-trained LLMs.\n• Work closely with other research scientists, engineers, and product teams fostering a collaborative and intellectually stimulating environment.\n• Contribute to millions of OTT platform users towards improving their experience by leveraging AI capabilities.\n• Contribute to the research community by sharing insights and participating in external academic workshops and conferences.\n\n\nWork Location:\n\nRemote within India,\n\n\nDuration of the paid contractual role:\n\nThe annual paid direct contractual tenure is extendable.\nIdeally this position will start from first/second week of December 2025.\nThe working hours are from 9:00 to 18:00 (Monday to Friday) full-time.\n\n\nEssential Education:\n\nCandidates who have successfully completed Ph.D./Master degree preferably from CS/AI/ML (recommendation, foundational models etc.) academic background.\n\n\nMust Have Skills & Abilities:\n\nA strong background in applied deep learning and machine learning, both in terms of conceptual understanding, as well as practical experience.\nA good understanding on handling large scale datasets with SQL.\nUnderstanding about current start of the art machine learning literature.\nPrior experience in developing large scale prediction and reasoning models.\nStrong knowledge and interest in LLMs (fine-tuning, training and using LLMs).\nProficiency in hands-on with Python and one or more popular deep learning framework.\nAbility to envision new ideas and proving them through theory and/or experiments.\nKnowledge of working on any cloud platform, preferably AWS, is desirable.\n\n\nGood to Have Skills:\n\nPhD candidates with thesis in the area of causal inference is highly preferred.\n0-1 year of work experience in building and deploying large-scale predictive models in production.\n0-1 year of work experience in LLM/NLP projects within a start-up environment.\nGood publication record, with publications in major machine learning conferences (e.g. NeurIPS, ICML, KDD, AAAI, SIGIR, RecSys, WSDM, ICDM, ECML, etc.).\n\n\nOur Values:\n\nDreams & Curiosity: Pioneer the future with dreams and curiosity.\nDiversity: Pursue the creation of the very best by harnessing diversity and varying viewpoints.\nIntegrity & Sincerity: Earn the trust for Sony brand through ethical and responsible conduct.\nSustainability: Fulfil our stakeholder responsibilities through disciplined business practices.\n\n\nSony Research India is committed to equal opportunity in all its employment practices, policies and procedures and to ensuring that no worker or potential worker will receive less favourable treatment due to any characteristic protected under applicable local laws.",
      "timestamp": "2026-01-12T17:44:58.674150"
    },
    {
      "id": 27,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4352602684&keywords=Data%20Scientist",
      "raw_text": "Generative AI Engineer \nDelhi, India · 4 hours ago · Over 100 applicants\nPromoted by hirer · Company review time is typically 1 week\n\n\nHybrid\n\nFull-time\n\nEasy Apply\n\nSave\nSave Generative AI Engineer  at Deloitte\nGenerative AI Engineer\nDeloitte · Delhi, India (Hybrid)\n\nEasy Apply\n\nSave\nSave Generative AI Engineer  at Deloitte\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nMeet the hiring team\nAbiha Zaidi\nAbiha Zaidi  \n 3rd+\nTA Executive @Deloitte || Hiring top talent in AI & Data\nJob poster\n\nMessage\nAbout the job\nAbout the Company\n\n\n\n\n\nIndia’s impact on the global economy has increased at an exponential rate and Deloitte presents an opportunity to unleash and realize your potential amongst cutting edge leaders, and organizations shaping the future of the region, and indeed, the world beyond. At Deloitte, your whole self to work, every day. Combine that with our drive to propel with purpose and you have the perfect playground to collaborate, innovate, grow, and make an impact that matters.\n\n\n\n\nAbout the Role\n\n\n\n\n\nAs a Manager in our T&T Team you’ll build and nurture positive working relationships with teams and clients with the intention to exceed client expectations.\n\n\n\n\nResponsibilities\n\n\n\n\n\nLead and manage team(s) of data scientists and analysts, providing guidance and delivering projects across ML / NLP / Gen-AI.\nDrive strategic initiatives and innovation in AI across these focused industries: BFSI, Retail, Telecom, Manufacturing, Automotive, FMCG, Healthcare, Pharma, etc.\nCollaborate with senior leadership and drive client engagements to align with business goals and objectives.\nDesign and review solutions on (not limited to) time series forecasting, regression/classification modelling, clustering techniques, Gen AI, etc.\nManage and optimize cloud-based analytics platforms (Azure, GCP, or AWS) for AI and Gen AI related projects.\nMaintain a strong understanding of end-to-end project lifecycle.\nPresent findings and insights to stakeholders through excellent oral and written communication skills.\nContribute to RFPs, Assets, other internal/external initiatives.\n\n\n \nQualifications\n\n\n\n\n\n7+ years of relevant experience in Data Science (Statistics/AI/ML) and Gen AI, with a proven track record of leading and managing teams.\nExcellent presentation and communication skills (oral and written).\nDeep expertise in statistical analysis, machine learning, and deep learning.\nStrong knowledge of analytical models such as marketing mix models, pricing and promotion optimization, customer value management, next best recommendation, segmentation, sales spend optimization, and demand forecasting.\nExperience with cloud-based analytics platforms (Azure, GCP, or AWS).\nAbility to drive strategic initiatives and align AI approach with business objectives.\nProven ability to evaluate and implement advanced techniques to enhance client value.\n\n\n \nRequired Skills\n\n\n\n\n\nInspiring - Leading with integrity to build inclusion and motivation.\nCommitted to creating purpose - Creating a sense of vision and purpose.\nAgile - Achieving high-quality results through collaboration and Team unity.\nSkilled at building diverse capability - Developing diverse capabilities for the future.\nPersuasive / Influencing - Persuading and influencing stakeholders.\nCollaborating - Partnering to build new solutions.\nDelivering value - Showing commercial acumen.\nCommitted to expanding business - Leveraging new business opportunities.\nAnalytical Acumen - Leveraging data to recommend impactful approach and solutions through the power of analysis and visualization.\nEffective communication – Must be well abled to have well-structured and well-articulated conversations to achieve win-win possibilities.\nEngagement Management / Delivery Excellence - Effectively managing engagement(s) to ensure timely and proactive execution as well as course correction for the success of engagement(s).\nManaging change - Responding to changing environment with resilience.\nManaging Quality & Risk - Delivering high quality results and mitigating risks with utmost integrity and precision.\nStrategic Thinking & Problem Solving - Applying strategic mindset to solve business issues and complex problems.\nTech Savvy - Leveraging ethical technology practices to deliver high impact for clients and for Deloitte.\nEmpathetic leadership and inclusivity - creating a safe and thriving environment where everyone's valued for who they are, use empathy to understand others to adapt our behaviours and attitudes to become more inclusive.\n\n\n\n\n\n\nBase location: Pan India. This profile involves occasional travelling to client locations. Hybrid is our default way of working. Each domain has customized the hybrid approach to their unique needs.\n\n\n\n\nEqual Opportunity Statement\n\n\n\n\n\nAt Deloitte, people are valued and respected for who they are and are trusted to add value to their clients, teams and communities in a way that reflects their own unique capabilities. Know more about everyday steps that you can take to be more inclusive. At Deloitte, we believe in the unique skills, attitude and potential each and every one of us brings to the table to make an impact that matters.\n\nAbout the company\nDeloitte company logo\nDeloitte\n20,757,779 followers\n\nFollow\nBusiness Consulting and Services  10,001+ employees  508,225 on LinkedIn\nDeloitte drives progress. Our firms around the world help clients become leaders wherever they choose to compete. Deloitte invests in outstanding people of diverse talents and backgrounds and empowers them to achieve more than they could elsewhere. Our work combines advice with action and integrity. We believe that when our clients and society are stronger, so are we.\n\nDeloitte refers to one or more of Deloitte Touche Tohmatsu Limited (“DTTL”), its global network of member firms, and their related entities. DTTL (also referred to as “Deloitte Global”) and each of its member firms are legally separate and independent entities. DTTL does not provide services to clients. Please see www.deloitte.com/about to learn more.\n\nThe content on this page contains general information only, and none of Deloitte Touche Tohmatsu Limited, its member firms, or their related entities (collectively the “Deloitte Network”) is, by means of this publication, rendering professional advice or services. Before making any decision or taking any action that may affect your finances or your business, you should consult a qualified professional adviser. No entity in the Deloitte Network shall be responsible for any loss whatsoever sustained by any person who relies on content from this page.\n…\nshow more\n\nInterested in working with us in the future?\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company",
      "timestamp": "2026-01-12T17:45:20.226382"
    },
    {
      "id": 28,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4360730917&keywords=Data%20Scientist",
      "raw_text": "Senior Machine Learning Engineer-AI, ML & Python, PyTorch \nBengaluru, Karnataka, India · 3 hours ago · 7 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nOn-site\n\nFull-time\n\nApply\n\nSave\nSave Senior Machine Learning Engineer-AI, ML & Python, PyTorch  at Dell Technologies\n\nSenior Machine Learning Engineer-AI, ML & Python, PyTorch\nDell Technologies · Bengaluru, Karnataka, India (On-site)\n\nApply\n\nSave\nSave Senior Machine Learning Engineer-AI, ML & Python, PyTorch  at Dell Technologies\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nSoftware Senior Principal Engineer\n\nThe Software Engineering team delivers next-generation application enhancements and new products for a changing world. Working at the cutting edge, we design and develop software for platforms, peripherals, applications and diagnostics — all with the most advanced technologies, tools, software engineering methodologies and the collaboration of internal and external partners.\n\nJoin us to do the best work of your career and make a profound social impact as a Senior Machine Learning Engineer on our Software Engineering Team in our Client Solutions Group.\n\nWhat You’ll Achieve\n\nAs a Senior Machine Learning Engineer, you will be responsible for designing, developing, and deploying machine learning models that power intelligent tools and features across our products. This role requires strong technical expertise, a collaborative mindset, and a passion for solving real-world problems using data.\n\nYou will:\n\nDesign and implement AI algorithms and models for real-world applications (e.g., NLP, computer vision, recommendation systems).\nCollaborate with cross-functional teams to integrate AI solutions into products and services.\nOptimize and scale machine learning models for performance and efficiency, maintain and improve existing AI systems through continuous learning and feedback loops.\nConduct research and stay up-to-date with the latest advancements in AI and machine learning.\nWrite clean, maintainable, and well-documented code, participate in code reviews, testing, and deployment processes.\n\nTake the first step towards your dream career\n\nEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:\n\nEssential Requirements\n\n12-25 years of combined experience in the architecture, design and development of BIOS Firmware, Artificial Intelligence, Machine Learning, or related field with bachelor’s or master’s degree.\nStrong programming skills in Python (preferred), C++, or Java.\nExperience with machine learning frameworks such as TensorFlow, PyTorch, or scikit-learn.\nSolid understanding of data structures, algorithms, and software engineering principles.\nKnowledge of MLOps practices and tools. Familiarity with cloud platforms (e.g., AWS, Azure, GCP) and containerization tools (e.g., Docker, Kubernetes).\n\nDesirable Requirements\n\nPrior experience deploying AI models in production environments preferred.\nContributions to open-source AI projects or published research preferred.\n\nWho We Are\n\nWe believe that each of us has the power to make an impact. That’s why we put our team members at the center of everything we do. If you’re looking for an opportunity to grow your career with some of the best minds and most advanced tech in the industry, we’re looking for you.\n\nDell Technologies is a unique family of businesses that helps individuals and organizations transform how they work, live and play. Join us to build a future that works for everyone because Progress Takes All of Us.\n\nApplication closing date: 06 Feb 2026\n\nDell Technologies is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. Read the full Equal Employment Opportunity Policy here.\n\n#NJP\n\nJob ID:R278479\n\nJob search faster with Premium\nAccess company insights like strategic priorities, headcount trends, and more\n\n\n\n\nMillions of members use Premium\n\nTry Premium for ₹0\n1 month free. Easy to cancel. No penalties or fees.\n\nAbout the company\nDell Technologies company logo\nDell Technologies\n5,430,485 followers\n\nFollow\nComputer Hardware Manufacturing  10,001+ employees  135,826 on LinkedIn\nTechnology drives human progress. This tenet is the core of our business and vision. Our customers and team members are integral to our continuing success as we provide the essential infrastructure for organizations to transform their digital futures.\n…\nshow more\n\nInterested in working with us in the future?\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company",
      "timestamp": "2026-01-12T17:45:48.359216"
    },
    {
      "id": 29,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4329865530&keywords=Data%20Scientist",
      "raw_text": "ML Engineer\nIndia · 1 week ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nRemote\n\nFull-time\n\nApply\n\nSave\nSave ML Engineer at NavGurukul\nML Engineer\nNavGurukul · India (Remote)\n\nApply\n\nSave\nSave ML Engineer at NavGurukul\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nTitle: ML engineer \n\n\nLocation: Remote first with 30 percent travel. We either spend time on our Campuses or build with the team at our Igatpuri HQ together \n\n\n\nAbout NavGurukulWe dream of a world where every learner has a fair chance to grow. At NavGurukul’s AI learning labs, We are on a mission to impact 1 crore underserved students in the next 1 year. We aim to leverage AI and build meaningful, joyful learning experiences. \n\nIf you believe that technology can be a tool for equity, AI can be leveraged to bridge the learning gap, and want your work to directly touch lives — this might be for you! : )\n\n\nIn this role, you’ll experiment, architect, and build AI/ML solutions that transform learning experiences at scale, mentor engineers, and shape strategy that drives learning outcomes and equity for all. \n\n\n\nWhat You’ll Be Doing\n\nYou will Experiment, Architect & Build AI solutions for learning at scale, focusing on compact, efficient models optimized for client-side, low-resource applications. You will Design, fine-tune & deploy lightweight LLMs and transformer-based models (DistilBERT, TinyGPT, instruction-tuned open-source models) for real-world learning applications.\nYou will establish AI-driven evaluation and feedback frameworks to measure model performance, optimize resource usage, and enhance learning outcomes. This includes implementing automated benchmarking, A/B testing, and human-in-the-loop feedback for continuous improvement.\nYou are committed to a careful, iterative, and data-driven approach — optimizing models for speed, memory footprint, and on-device inference, while ensuring ethical, reliable, and high-quality AI solutions. You also have experience in creating evaluation datasets and metrics for fine-tuned, lightweight models.\nYou will create efficient prompt and chain flows, build reusable templates, and integrate models with client-side apps, APIs, or edge devices using FastAPI, Flask, or mobile deployment frameworks.\nYou will mentor junior engineers, guide them in efficient experimentation, lightweight model design, and rapid prototyping, and ensure production-ready, well-tested code with typing, pytest, packaging, and thorough documentation..\n\n\nWhat We’re Looking For. \n\nExpert-level programming in Python with strong foundations in data structures, algorithms, and scalable software design.\nDeep understanding of ML and deep learning algorithms — CNNs, RNNs, Transformers, and LLMs — with experience optimizing models for lightweight and client-side applications.\nHands-on expertise with PyTorch, TensorFlow, and Hugging Face, along with familiarity with ML workflow tools like MLFlow, TFX, and ONNX.\nProficiency in data preprocessing, feature engineering, model tuning, and designing efficient evaluation benchmarks for edge and mobile deployment.\nA strategic mindset with hands-on execution ability – you can design architecture as well as roll up your sleeves and code.\nA lifelong learner who stays informed about emerging AI research, contributes to open-source projects, and understands their impact on real-world learning systems.\n\n\nWhy Join NavGurukul?\n\nReal-World Impact – Navgurukul’s AI learning labs is on a mission to empower 1Cr underserved students by building pedagogically enabled AI applications. You will join a team of people who intend to build real world impact that can change lives, enhance learning, and optimize social impact systems.\nA Place to Belong – A community that cares for your soul, challenges your mind, and strengthens your body. :) A place where you are encouraged to take paid vipassana breaks, Join 26 Paid learning Saturdays, inspire each other to make healthy lifestyle choices and grow with a circle of curious, kind, and passionate people.\nLeadership & Innovation – Shape AI/ML strategy, mentor the next generation of engineers, and drive organizational AI adoption.\nPurpose Over Pay – As a nonprofit, our salaries are significantly lower than corporate benchmarks (often 60–80% lower for senior members). But what we offer in return is immense purpose, autonomy, and the chance to work with passionate, mission-driven people.\n\n\nYears of experience: \n\nWe are hiring at all levels, from engineers with 2+ years of experience to senior leadership/CTO. What matters most is strong real-world AI/ML experience. If you meet 60 percent of the technical requirements, enjoy learning (Bonus points if you had excellent Math scores :P) we encourage you to apply! :)\n \nIf this speaks to you, or someone you know! \n\nLet's build this future together!<3\n\nJob search faster with Premium\nAccess company insights like strategic priorities, headcount trends, and more\n\n\n\n\nMillions of members use Premium\n\nTry Premium for ₹0\n1 month free. Easy to cancel. No penalties or fees.",
      "timestamp": "2026-01-12T17:46:09.860018"
    },
    {
      "id": 30,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4361220865&keywords=Data%20Scientist",
      "raw_text": "Data Engineer III, AFT Inventory \nBengaluru, Karnataka, India · 3 hours ago · 12 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nFull-time\n\nApply\n\nSave\nSave Data Engineer III, AFT Inventory  at Amazon\n\nData Engineer III, AFT Inventory\nAmazon · Bengaluru, Karnataka, India\n\nApply\n\nSave\nSave Data Engineer III, AFT Inventory  at Amazon\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nDescription\n\nHave you ever ordered a product from Amazon and been amazed at how fast it gets to you?\n\nEvery day Amazon engineers are relentlessly working to decrease the time between Click to Deliver for your products. The Amazon Fulfillment Technologies (AFT) team owns all of the software and infrastructure which powers Amazon's world-class fulfillment engine. Our team is building complex, massive data systems to capture data during every step in the automated pipeline and use that data to proactively predict efficiency and cost improvements to deliver the packages fast to our customers.\n\nAs an Amazon.com Big Data Engineer you will be working in one of the world's largest and most complex data warehouse environments. You should be skilled in the architecture of DW solutions for the Enterprise using multiple platforms (RDBMS, Columnar, Cloud). You should have experience in the design, creation, management, and business use of extremely large data-sets. You should have excellent business and communication skills to be able to work with business owners to develop and define key business questions, and to build data sets that answer those questions. Above all, you should be passionate about working with huge data sets and someone who loves to bring data-sets together to answer business questions and drive change.\n\nAs a Big Data Engineer in this role, you will develop new data engineering patterns that leverage a new cloud architecture, and will extend or migrate our existing data pipelines to this architecture as needed. You will also be assisting with integrating the Redshift platform as our primary processing platform to create the curated Amazon.com data model for the enterprise to leverage. You will be part of a team that builds the next generation data warehouse platform and to drive the adoption of new technologies and new practices in existing implementations. You will be responsible for designing and implementing the complex ETL pipelines in data warehouse platform and other BI solutions to support the rapidly growing and dynamic business demand for data, and use it to deliver the data as service which will have an immediate influence on day-to-day decision-making at Amazon.com.\n\nAbout The Team\n\nAmazon Fulfillment Technologies (AFT) powers Amazon’s global fulfillment network. We invent and deliver software, hardware, and data science solutions that orchestrate processes, robots, machines, and people. We harmonize the physical and virtual world so Amazon customers can get what they want, when they want it.\n\nBasic Qualifications\n\n 5+ years of data engineering experience\n Experience with data modeling, warehousing and building ETL pipelines\n Experience with SQL\n Experience in at least one modern scripting or programming language, such as Python, Java, Scala, or NodeJS\n Experience mentoring team members on best practices\n\nPreferred Qualifications\n\n Experience with big data technologies such as: Hadoop, Hive, Spark, EMR\n Experience operating large data warehouses\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ADCI - Karnataka\n\nJob ID: A3156830\n\nAbout the company\nAmazon company logo\nAmazon\n36,026,444 followers\n\nFollow\nSoftware Development  10,001+ employees  770,016 on LinkedIn\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. We are driven by the excitement of building technologies, inventing products, and providing services that change lives. We embrace new ways of doing things, make decisions quickly, and are not afraid to fail. We have the scope and capabilities of a large company, and the spirit and heart of a small one.\n\nTogether, Amazonians research and develop new technologies from Amazon Web Services to Alexa on behalf of our customers: shoppers, sellers, content creators, and developers around the world.\n\nOur mission is to be Earth's most customer-centric company. Our actions, goals, projects, programs, and inventions begin and end with the customer top of mind.\n\nYou'll also hear us say that at Amazon, it's always \"Day 1.\"​ What do we mean? That our approach remains the same as it was on Amazon's very first day - to make smart, fast decisions, stay nimble, invent, and focus on delighting our customers.\n…\nshow more\n\nCommitments\n\nCareer growth and learning\nWe offer a variety of career mobility and development opportunities that are designed to help employees move into higher-paying roles at Amazon or elsewhere. Our ten upskilling programs offer employees access to pre-paid education, technical and non-technical skills training, industry certifications, virtual and on-the-job learning and more to help them grow their skills. These programs, as well as career development opportunities like mentoring, internal transfers and promotions, are just one of the one we strive to be Earth's best employer.\n…\nShow more\nDiversity, equity, and inclusion\nAmazon’s ability to innovate on behalf of our customers relies on the perspectives and knowledge of people from all backgrounds. We actively recruit people from diverse backgrounds to build a supportive and inclusive workplace. Where possible, we provide unlimited gender transition benefits including gender affirmation. Amazon provides short-term and long-term disability coverage at no cost (available to employees working 30+ hours). Employees have opportunities to seek mentoring relationships, including company-sponsored mentoring programs and affinity group-organized mentor pairings focused on various communities. To support building our inclusive culture, Amazon’s 13 affinity groups lead in community-building, mentorship, and programs to build awareness around customer and employee inclusion.\n…\nShow more\nLearn more\nInterested in working with us in the future?\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company",
      "timestamp": "2026-01-12T17:46:31.378410"
    },
    {
      "id": 31,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4359759318&keywords=Data%20Scientist",
      "raw_text": "Data Engineer (Remote)\nIndia · 1 day ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nRemote\n\nContract\n\nApply\n\nSave\nSave Data Engineer (Remote) at Keystone Recruitment\nData Engineer (Remote)\nKeystone Recruitment · India (Remote)\n\nApply\n\nSave\nSave Data Engineer (Remote) at Keystone Recruitment\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nTitle: Data Engineer (Remote)\nEngagement: Hourly contract (independent contractor)\nRate: USD 14/hour\nLocation: Remote – candidates based in the United States, United Kingdom, Canada, Europe, Singapore, Dubai, or Australia who are legally able to work as independent contractors in their jurisdiction.\n\n\nAbout the Role\n\nWe are hiring for one of our clients collaborating with a leading AI lab. This role involves designing, validating, and maintaining scalable ETL/ELT pipelines and data contracts to produce clean, reliable, and reproducible datasets for analytics and machine learning systems. The position is ideal for candidates passionate about building resilient data pipelines, ensuring data quality at scale, and supporting AI research and production workflows.\n\n\nResponsibilities\n\nDesign, build, and maintain scalable ETL/ELT pipelines with a focus on reliability and performance.\nValidate and enrich datasets to ensure analytics- and ML-readiness.\nManage data schemas, versioning, and contracts to maintain consistency.\nWork with databases (e.g., PostgreSQL, SQLite) and distributed processing frameworks (e.g., Spark, DuckDB).\nOrchestrate workflows using Airflow or similar tools.\nCollaborate with researchers and engineers to align pipelines with project and research requirements.\nEnsure reproducibility, reliability, and quality across all data workflows.\n\n\nRequired Skills & Experience\n\nBackground in Computer Science, Data Engineering, Information Systems, or a related field.\nProficiency in Python, pandas, and SQL.\nExperience with databases (PostgreSQL, SQLite) and distributed data processing (Spark, DuckDB).\nFamiliarity with workflow orchestration tools (Airflow or equivalent).\nStrong understanding of data schemas, versioning, and Git-based version control.\nExperience working with common data formats such as JSON, CSV, and Parquet.\nStrong problem-solving, analytical, and communication skills.\n\n\nPreferred Experience\n\nExperience designing robust data pipelines for analytics or machine learning applications.\nExperience in reproducible data workflows for AI research.\n\n\nApplication Process\n\nSubmit a resume highlighting relevant data engineering experience.\nParticipate in a brief interview.\nReasonable accommodations provided upon request.\n\n\nContract & Payment\n\nIndependent contractor, fully remote, flexible schedule.\nPaid weekly via Stripe or Wise.\nProjects may be extended, shortened, or concluded early depending on needs and performance.\nWork does not require access to confidential information from prior employers or clients.\nApplicants must be legally authorized to work in India.\n\nJob search faster with Premium\nAccess company insights like strategic priorities, headcount trends, and more\n\n\n\n\nMillions of members use Premium\n\nTry Premium for ₹0\n1 month free. Easy to cancel. No penalties or fees.",
      "timestamp": "2026-01-12T17:46:52.941529"
    },
    {
      "id": 32,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4340115769&keywords=Data%20Scientist",
      "raw_text": "AI / ML Developer\nGhaziabad, Uttar Pradesh, India · 1 month ago · Over 100 people clicked apply\nResponses managed off LinkedIn\n\n\nOn-site\n\nInternship\n\nApply\n\nSave\nSave AI / ML Developer at Kognify Matrix Labs\nAI / ML Developer\nKognify Matrix Labs · Ghaziabad, Uttar Pradesh, India (On-site)\n\nApply\n\nSave\nSave AI / ML Developer at Kognify Matrix Labs\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nThis job is sourced from a job board. Learn More\nResponsibilities\n\nCollect, preprocess, and analyze datasets for training machine learning models.\nDesign, develop, and implement algorithms in areas such as classification, regression, clustering, and NLP.\nWork with Python and ML libraries such as TensorFlow, PyTorch, Scikit-learn, OpenCV, and Pandas.\nCollaborate with developers to integrate AI models into web applications or software.\nDesign, build, and maintain workflow automations using n8n, Zapier, and Integromat (formerly Make).\nConduct performance evaluation and optimization of ML models.\nStay updated with emerging trends and research in AI, deep learning, and data science.\n\nRequirements\n\nStrong foundation in Python programming and libraries like NumPy, Pandas, and Matplotlib.\nBasic understanding of machine learning algorithms (supervised and unsupervised).\nFamiliarity with TensorFlow, Keras, or PyTorch frameworks.\nKnowledge of data preprocessing, feature engineering, and model evaluation.\nUnderstanding of statistics, linear algebra, and probability concepts.\nGood problem-solving and analytical thinking skills.\nPursuing or recently completed a degree in Computer Science, Data Science, AI/ML, or related fields.\n\nThis job was posted by Anjali Choudhary from Kognify Matrix Labs.\n\n\nDesired Skills and Experience\nBlockchain,Mainframes",
      "timestamp": "2026-01-12T17:47:14.505251"
    },
    {
      "id": 33,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4360751741&keywords=Data%20Scientist",
      "raw_text": "Remote Software Engineer (C++) \nNoida, Uttar Pradesh, India · 29 minutes ago · 0 applicants\nPromoted by hirer · No response insights available yet\n\n\nRemote\n\nContract\n\nEasy Apply\n\nSave\nSave Remote Software Engineer (C++)  at Turing\nRemote Software Engineer (C++)\nTuring · Noida, Uttar Pradesh, India (Remote)\n\nEasy Apply\n\nSave\nSave Remote Software Engineer (C++)  at Turing\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nAbout the projects: we are building LLM evaluation and training datasets to train LLM to work on realistic software engineering problems. One of our approaches, in this project, is to build verifiable SWE tasks based on public repository histories in a synthetic approach with human-in-the-loop; while expanding the dataset coverage to different types of tasks in terms of programming language, difficulty level, and etc.\n\n\nAbout the Role: \n\nWe are looking for experienced software engineers (tech lead level) who are familiar with high-quality public GitHub repositories and can contribute to this project. This role involves hands-on software engineering work, including development environment automation, issue triaging, and evaluating test coverage and quality\n\n\nWhy Join Us? \n\nTuring is one of the world’s fastest-growing AI companies accelerating the advancement and deployment of powerful AI systems. You’ll be at the forefront of evaluating how LLMs interact with real code, influencing the future of AI-assisted software development. This is a unique opportunity to blend practical software engineering with AI research.\n\n\nWhat does day-to-day look like:\n\nAnalyze and triage GitHub issues across trending open-source libraries.\nSet up and configure code repositories, including Dockerization and environment setup.\nEvaluating unit test coverage and quality.\nModify and run codebases locally to assess LLM performance in bug-fixing scenarios.\nCollaborate with researchers to design and identify repositories and issues that are challenging for LLMs.\nOpportunities to lead a team of junior engineers to collaborate on projects.\n\n\nRequired Skills:\n\nMinimum 3+ years of overall experience\nStrong experience with at least one of the following languages: C++\nProficiency with Git, Docker, and basic software pipeline setup.\nAbility to understand and navigate complex codebases.\nComfortable running, modifying, and testing real-world projects locally.\nExperience contributing to or evaluating open-source projects is a plus.\n\n\nNice to Have:\n\nPrevious participation in LLM research or evaluation projects.\nExperience building or testing developer tools or automation agents.\nPerks of Freelancing With Turing:\nWork in a fully remote environment.\nOpportunity to work on cutting-edge AI projects with leading LLM companies.\n\n\nOffer Details:\n\nCommitments Required: At least 4 hours per day and minimum 20 hours per week with overlap of 4 hours with PST. (We have 3 options of time commitment: 20 hrs/week, 30 hrs/week or 40 hrs/week)\nEmployment type: Contractor assignment (no medical/paid leave)\n\n\nAfter applying, you will receive an email with a login link. Please use that link to access the portal and complete your profile.\n\n\n\nKnow amazing talent? Refer them at turing.com/referrals, and earn money from your network.\n\nAbout the company\nTuring company logo\nTuring\n1,547,716 followers\n\nFollow\nTechnology, Information and Internet  1,001-5,000 employees  6,006 on LinkedIn\nTuring is one of the world’s fastest-growing AI companies accelerating the advancement and deployment of powerful AI systems.\n\nTuring helps customers in two ways: Working with the world’s leading AI labs to advance frontier model capabilities in thinking, reasoning, coding, agentic behavior, multimodality, multilinguality, STEM and frontier knowledge; and leveraging that work to build real-world AI systems that solve mission-critical priorities for companies.\n\nPowering this growth is Turing’s talent cloud—an AI-vetted pool of 4M+ software engineers, data scientists, and STEM experts who can train models and build AI applications. All of this is orchestrated by ALAN—our AI-powered platform for matching and managing talent, and generating high-quality human and synthetic data to improve model performance. ALAN also accelerates workflows for model and agent evals, supervised fine-tuning, reinforcement learning, reinforcement learning with human feedback, preference-pair generation, benchmarking, data capture for pre-training, post-training, and building AI applications.\n\nTuring—based in San Francisco, California—was named #1 on The Information’s annual list of “Top 50 Most Promising B2B Companies,” and has been profiled by Fast Company, TechCrunch, Reuters, Semafor, VentureBeat, Entrepreneur, CNBC, Forbes, and many others. Turing’s leadership team includes AI technologists from Meta, Google, Microsoft, Apple, Amazon, X, Stanford, Caltech, and MIT.\n…\nshow more\n\nInterested in working with us in the future?\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company",
      "timestamp": "2026-01-12T17:47:36.052247"
    },
    {
      "id": 34,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4330584743&keywords=Data%20Scientist",
      "raw_text": "Optimization and ML Modelling Engineer\nBengaluru, Karnataka, India · 6 days ago · Over 100 applicants\nPromoted by hirer · Actively reviewing applicants\n\n\nOn-site\n\nFull-time\n\nEasy Apply\n\nSave\nSave Optimization and ML Modelling Engineer at Sustainability Economics.ai\nOptimization and ML Modelling Engineer\nSustainability Economics.ai · Bengaluru, Karnataka, India (On-site)\n\nEasy Apply\n\nSave\nSave Optimization and ML Modelling Engineer at Sustainability Economics.ai\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nLocation: Bengaluru, Karnataka \n\n \nAbout the Company: \n\nSustainability Economics.ai is a global organization, pioneering the convergence of clean energy and AI, enabling profitable energy transitions while powering end-to-end AI infrastructure. By integrating AI-driven cloud solutions with sustainable energy, we create scalable, intelligent ecosystems that drive efficiency, innovation, and long-term impact across industries. Guided by exceptional leaders and visionaries with decades of expertise in finance, policy, technology, and innovation, we are committed to making long-term efforts to fulfil this vision through our technical innovation, client services, expertise, and capability expansion. \n\n \nRole Summary: \n\nWe are seeking a highly skilled Optimization and ML Modelling Engineer to design, develop, and deploy prescriptive models that identify optimal solutions under complex business and operational constraints. The role focuses on formulating and solving optimization problems using advanced mathematical programming and numerical methods. The ideal candidate will combine strong analytical thinking with hands-on Python development to build models that drive intelligent, data-informed decision-making. \n\n \nKey Responsibilities: \n\nDesign, develop, and implement optimization and forecasting models for complex analytical problems. \nApply mathematical programming (linear, nonlinear, integer, and mixed-integer optimization) to operational and decision-making scenarios. \nBuild, train, and fine-tune machine learning and statistical models for regression, classification, and clustering. \nConduct feature selection, hyperparameter tuning, and performance evaluation using systematic validation techniques. \nIntegrate ML and optimization algorithms within business or system logic for intelligent decision-making. \nCollaborate with cross-functional teams to ensure models are scalable, interpretable, and production-ready. \nStay updated with advancements in optimization algorithms, ML model architectures, and applied AI techniques. \n\n\nEducation & Experience: \n\nBachelor’s or Master’s degree in Computer Science, Engineering, Applied Mathematics, or related quantitative fields. \n1–2 years of hands-on experience in machine learning, optimization. \nStrong background in mathematical modeling, statistics, or operations research. \nExperience in production-grade model deployment and performance monitoring. \n\n\nSkills Required: \n\nThe candidate should have strong proficiency in Python, with practical experience for building optimization models. \nStrong proficiency in Python and libraries such as SciPy,Pyomo, NumPy, OR-Tools, PuLP, Gurobi, or CPLEX. \nA solid understanding of linear programming, mixed-integer programming, convex optimization, stochastic optimization, and constraint programming is essential. \nThe role requires experience in algorithm design, numerical methods, and sensitivity analysis for robust model development. \nThe candidate should possess a strong background in operations research and optimization model formulation. \nExperience in model validation and performance tuning is required to ensure accuracy and efficiency. \nThe role involves performing scenario analysis and supporting optimization-based decision-making. \nKnowledge of workflow automation and integration of optimization models with APIs will be an advantage. \nProficiency in version control using Git. \nThe candidate should demonstrate strong problem-solving and analytical thinking abilities. \nClear documentation skills and the ability to communicate technical results effectively are essential. \n\n\nWhat You’ll Do: \n\nBuild and train ML and optimization models for production-scale use cases. \nDesign intelligent data workflows and pipelines to support predictive and prescriptive analytics. \nTranslate business objectives into mathematical formulations that can be optimized effectively. \nCollaborate with engineering and research teams to develop scalable ML solutions. \nDevelop APIs and tools to make ML capabilities accessible across systems. \nContinuously monitor, maintain, and enhance model accuracy and scalability. \n\n\nWhat you will bring:\n\nProven track record of implementing ML and optimization models in production environments. \nStrong mathematical and statistical foundation. \nPassion for scalable systems, automation, and applied problem-solving. \nStartup DNA → bias to action, comfort with ambiguity, love for fast iteration, and flexible and growth mindset. \n \nWhy Join Us:\n\nShape a first-of-its-kind AI + clean energy platform. \nWork with a small, mission-driven team obsessed with impact. \nAn aggressive growth path. \nA chance to leave your mark at the intersection of AI, Optimization and sustainability.",
      "timestamp": "2026-01-12T17:47:57.628777"
    },
    {
      "id": 35,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4326511070&keywords=Data%20Scientist",
      "raw_text": "Software Engineering Intern - statue.dev, remote\nIndia · 1 month ago · Over 100 applicants\nPromoted by hirer · Actively reviewing applicants\n\n\nRemote\n\nFull-time\n\nEasy Apply\n\nSave\nSave Software Engineering Intern - statue.dev, remote at Accretional\nSoftware Engineering Intern - statue.dev, remote\nAccretional · India (Remote)\n\nEasy Apply\n\nSave\nSave Software Engineering Intern - statue.dev, remote at Accretional\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nHelp build the next generation of developer tooling and agentic AI products! In this role you will work closely with a startup founder(Fred Weitendorf https://www.linkedin.com/in/fred-weitendorf-40b505b6/) and a team of founding engineers based out of San Francisco, creating a radically different way to develop software.\n\n\nThis is a remote 10 week, fixed-term summer 2025 internship role available for undergrad, MS, and PhD B.Tech CSE and Computer Science students. It will be hosted remotely in India, but includes the option for attending a paid conference or intern meetup including members of the Accretional team.\n\n\n\nRole\n\nWe love and value open source software, so this summer, we're sponsoring internships to work on our open source static site generator project Statue, our community/site hosting through statue.dev, and our open source distributed programming project Collector.\n\n\nStatue is a static site generator project that allows markdown files to be quickly converted into static sites from templates, and personalized with reusable Svelte components. Collector is a golang/protobuf/sqlite ORM, API server, and novel distributed programming project that uses reflection to dynamically add new types, APIs, and \"collections\" at runtime. Your contributions to these projects will allow websites, databases, and APIs to be deployed and modified in seconds.\n\n\nBoth Statue and Collector are being integrated into our IDE-cloud-platform-hybrid, currently in a beta at brilliant.mplode.dev, alongside AI and serverless containers to generate, customize, and extend entire products in one shot. Your contributions to Statue and Collector will play and important role in the success of these integrations, so you will work closely with the founding team on making sure that these projects are successful. The work will involve developing, integrating, and testing open source software, but also creating demonstrations and participating in various public events for these projects, as well as collaborating with the open source community.\n\n\nResponsibilities\n\nDevelop, integrate, and test open source software\nCollaborate with other interns, the Accretional team, and the open source community\nCreate demonstrations and showcases for Statue, Collector, and Accretional's products\nParticipate in public events, both Accretional's, and through third parties\nDevelop AI workflows and agents to automate website, backend, database, and product creation.\n\n\nQualifications\n\nCurrently pursuing a bachelor's, master's, or PhD in Computer Science or a related field.\n(Preferred) Familiarity with one or more of the following areas: Svelte and SvelteKit, cloud backend development, containerization, build/test tooling, devops, golang, protobuf/grpc, sqlite\nExperience in programming with languages like Go and Typescript\nExcellent and creative problem-solving skills.\nStrong written and verbal communication skills.\nMost importantly: motivated by a desire to learn, and excited to work closely with engineers in a scrappy startup.\n\n\nCompany Description\n\nAccretional is revolutionizing software development by creating developer tools that use AI to transform ideas into implemented, tested, and deployed software in under a minute. Our flagship product, Brilliant, is browser-based IDE that runs on our serverless container platform, Splendor, currently exiting our closed Alpha.\n\n\nOur mission is to enable developers and companies worldwide to work with the most advanced AI coder and a vast repository of software resources. We are committed to making technology intuitive and effortless for everyone.\n\n\nWhy work here?\n\n\n\nThis is an opportunity to gain and build experience in a cutting edge field. Your work will integrate with agentic workflows, terminal agents, and persistent container agents to create an entirely new kind of cloud platform. You will get to work closely with, and learn from, a startup founder and a team of experienced engineers, hailing from Microsoft, Google, Salesforce, and YC startups.\n\n\nContact: Fred at https://www.linkedin.com/in/fred-weitendorf-40b505b6/ or through https://github.com/accretional/statue",
      "timestamp": "2026-01-12T17:48:25.606143"
    },
    {
      "id": 36,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4352080410&keywords=Data%20Scientist",
      "raw_text": "AI/ Machine Learning Engineer (Spatial & Design Intelligence)\nMumbai, Maharashtra, India · 3 days ago · Over 100 applicants\nPromoted by hirer · Actively reviewing applicants\n\n\nOn-site\n\nFull-time\n\nEasy Apply\n\nSave\nSave AI/ Machine Learning Engineer (Spatial & Design Intelligence) at Bindassdeal Digital Private Limited\nAI/ Machine Learning Engineer (Spatial & Design Intelligence)\nBindassdeal Digital Private Limited · Mumbai, Maharashtra, India (On-site)\n\nEasy Apply\n\nSave\nSave AI/ Machine Learning Engineer (Spatial & Design Intelligence) at Bindassdeal Digital Private Limited\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nSummary:\n\nWe are building a spatial-mapping device that powers an AI-driven design platform.As an AI / ML Engineer, you will own the intelligence that turns geometry into functional design decisions layouts, furniture placement, spatial reasoning, and design validation.\nThis role sits at the core of our product’s differentiation.\n\n\nKey Responsibilities\n\nSpatial AI & Design Intelligence\n Develop AI models to convert 2D & 3D scans into structured spatial representations\n Encode and enforce architecture grammar & ergonomic rules\n Generate multiple optimized design alternatives\n Machine Learning Systems\n Design and train deep learning models for:\n semantic segmentation\n object recognition\n spatial reasoning\n Develop constraint-based optimization & layout solvers\n Create data pipelines for training & evaluation\nAI to Product Integration\n Integrate models into the 3D design editor & workflow\n Optimize models for speed & reliability\n Collaborate with SLAM & geometry teams for clean AI inputs\nContinuous Improvement\n Evaluate output quality using measurable design metrics\n Improve model robustness using real-world data\n Develop automated testing & monitoring for AI pipelines\n\n\n\n\nSkills\n\n Core\n Strong Python\n PyTorch\n Computer Vision fundamentals\n Geometry & spatial reasoning\n Optimization & constraint solvers\n AI / ML\n CNNs, Transformers\n Graph neural networks (nice to have)\n Semantic segmentation\n Object detection\n Data engineering & evaluation\n Tools\n NumPy, OpenCV\n Training pipelines\n Dataset labeling tools\n\n\nNice to have\n\n Experience with architectural or spatial data\n Experience with 3D data & point clouds\n Reinforcement learning for layout optimization\n Experience with generative models for design\n\n\n Success Metrics\n\n Accurate AI-generated layouts that meet design standards\n Reduced manual effort for designers\n High adoption of AI recommendations\n Stable & fast AI inference in production\n\n\nDetails\n\nCompany website: bindassdealdigital.com \n\nClassification: Full-time work\nExperience: 2 to 6 years \n\nLocation: On-site/hybrid",
      "timestamp": "2026-01-12T17:48:47.163848"
    },
    {
      "id": 37,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4332559287&keywords=Data%20Scientist",
      "raw_text": "Junior Computer Vision Engineer (Full-time)\nNew Delhi, Delhi, India · 12 minutes ago · 5 applicants\nCompany review time is typically 1 week\n\n\nOn-site\n\nFull-time\n\nEasy Apply\n\nSave\nSave Junior Computer Vision Engineer (Full-time) at SJMJ Group\nJunior Computer Vision Engineer (Full-time)\nSJMJ Group · New Delhi, Delhi, India (On-site)\n\nEasy Apply\n\nSave\nSave Junior Computer Vision Engineer (Full-time) at SJMJ Group\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nJunior Computer Vision Engineer\n\nBiz-Tech Analytics (via Keep Knockin’)\n\n\n\n Location: New Delhi (On-site)\n Experience: 0–2 years\n Employment Type: Full-time\n\n\nWe are hiring for our client Biz-Tech Analytics, a growing AI solutions company working on real-world computer vision and data-driven systems. This is a full-time opportunity for a Junior Computer Vision Engineer who wants to work on applied AI, not just academic models.\nYou will join a team building and improving production-grade computer vision pipelines used across enterprise and AI-driven platforms.\n\n\nWhat you will do\n\nWork on computer vision pipelines for image and video data\nTrain, fine-tune, and evaluate deep learning models\nBuild and maintain data preprocessing and augmentation workflows\nSupport model validation, testing, and performance analysis\nAssist with deployment-ready model packaging and inference workflows\nCollaborate with senior engineers on debugging and improving model behavior\n\n\nWhat we’re looking for\n\n0–2 years of experience through projects, internships, or full-time roles\nStrong foundation in Python\nWorking knowledge of computer vision concepts\nHands-on experience with PyTorch or TensorFlow\nFamiliarity with OpenCV, NumPy, and basic ML tooling\nAbility to analyze model outputs and debug issues\nWillingness to learn and grow in a fast-moving AI environment\n\n\nNice to have\n\nExperience with image or video datasets\nUnderstanding of model evaluation metrics\nExposure to model deployment or inference workflows\nGitHub or project portfolio\n\n\nWhy join Biz-Tech Analytics\n\nWork on real AI systems used in production\nLearn directly from senior AI and systems engineers\nBuild strong foundations in computer vision and applied ML\nBe part of a team delivering enterprise-grade AI solutions",
      "timestamp": "2026-01-12T17:53:26.625789"
    },
    {
      "id": 38,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4352653583&keywords=Data%20Scientist",
      "raw_text": "Platform Engineer – Medical AI / MLOps | Cloud (AWS/GCP)\nIndia · 15 minutes ago · 2 applicants\nPromoted by hirer · Company review time is typically 1 week\n\n\nRemote\n\nFull-time\n\nEasy Apply\n\nSave\nSave Platform Engineer – Medical AI / MLOps | Cloud (AWS/GCP) at Magma Consultancy\nPlatform Engineer – Medical AI / MLOps | Cloud (AWS/GCP)\nMagma Consultancy · India (Remote)\n\nEasy Apply\n\nSave\nSave Platform Engineer – Medical AI / MLOps | Cloud (AWS/GCP) at Magma Consultancy\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nPlatform Engineer – Medical AI / MLOps | Cloud (AWS/GCP)\n\n\nLocation: Remote / India (US collaboration)\nExperience: 3–7 Years\nIndustry: U.S. HealthTech | Medical AI\nEmployment Type: Full-time\n\n\nAbout the Role\nWe are hiring a Platform Engineer (Medical AI / MLOps) to build and scale cloud infrastructure powering AI-driven medical imaging systems used in clinical environments. This role sits at the intersection of cloud platforms, MLOps, Kubernetes, and regulated healthcare systems, supporting both model training and real-time inference.\nThis is not a generic DevOps role—we are looking for someone who has worked close to ML systems in production, ideally in healthcare or other regulated domains.\n\n\nKey Responsibilities\nDesign and maintain medical imaging data pipelines (e.g., DICOM ingestion, validation, de-identification/PHI handling)\nBuild and operate cloud-based model serving platforms for secure, scalable AI inference\nDeploy and manage Kubernetes-based microservices for ingestion, preprocessing, inference, and post-processing\nImplement MLOps workflows including model versioning, deployment, monitoring, and retraining\nBuild regulated CI/CD pipelines with approvals, audit trails, and environment promotion (dev → staging → prod)\nEnsure security, reliability, performance, and cost optimization across the platform\nCollaborate closely with ML engineers, clinical, and regulatory teams to productionize research into clinical tools\n\n\nRequired Skills & Experience\n3+ years of experience in Platform Engineering, MLOps, or ML-focused DevOps\nStrong hands-on experience with AWS or GCP\nProficiency in Python, Docker, Kubernetes, and CI/CD pipelines\nExperience with MLOps tools such as MLflow, SageMaker, or Vertex AI\nUnderstanding of security best practices and working in regulated environments (HIPAA, SOC 2, etc.)\nExperience with medical imaging, healthcare data, or DICOM pipelines is a strong plus\nExposure to Software as a Medical Device (SaMD) or clinical-grade systems is a bonus\n\n\nEducation:\n\nBachelor’s or Master’s in Computer Science or related field\nIIT alumni preferred\n\n\n\nJob search faster with Premium\nAccess company insights like strategic priorities, headcount trends, and more\n\n\n\n\nMillions of members use Premium\n\nTry Premium for ₹0",
      "timestamp": "2026-01-12T17:53:48.241071"
    },
    {
      "id": 39,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4361121484&keywords=Data%20Scientist",
      "raw_text": "Machine Learning Intern\nIndia · 1 hour ago · 49 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nRemote\n\nFull-time\n\nApply\n\nSave\nSave Machine Learning Intern at Infrabyte Consulting\nMachine Learning Intern\nInfrabyte Consulting · India (Remote)\n\nApply\n\nSave\nSave Machine Learning Intern at Infrabyte Consulting\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nMachine Learning Intern\n\n\nCompany: Infrabyte Consulting\nLocation: Remote\nEmployment Type: Internship (Full-time)\nDuration: 1–3 Months\nStipend: ₹15,000 per month\n\n\nRole Description\n\n\nInfrabyte Consulting is looking for a mathematically inclined Machine Learning Intern to join our AI/ML research and development team. In this role, you will assist in building, training, and deploying predictive models that help solve complex business problems. You will work with large datasets, explore state-of-the-art algorithms, and contribute to the automation of decision-making processes. This is an ideal role for someone looking to bridge the gap between theoretical ML and production-grade AI.\n\n\nPrimary Responsibilities\n\n\n* Data Preprocessing: Clean, normalize, and perform feature engineering on diverse datasets to prepare them for model training.\n* Model Development: Assist in implementing and fine-tuning machine learning models using libraries like Scikit-learn, TensorFlow, or PyTorch.\n* Exploratory Data Analysis (EDA): Use statistical techniques to visualize data distributions and identify key features for model input.\n* Evaluation & Testing: Measure model performance using metrics such as Accuracy, Precision-Recall, and F1-score, and perform hyperparameter tuning.\n* Research: Stay updated on the latest AI/ML trends and papers to propose innovative solutions for client-specific challenges.\n\n\nRequirements\n\n\n* Education: Currently pursuing or a recent graduate in Computer Science, Data Science, Statistics, Mathematics, or a related technical field.\n* Programming Skills: Strong proficiency in Python (specifically libraries like Pandas, NumPy, and Matplotlib).\n* ML Fundamentals: A solid understanding of supervised and unsupervised learning, regression, classification, and clustering.\n* Mathematics: Strong foundation in Linear Algebra, Calculus, and Probability/Statistics.\n* Tools: Familiarity with Jupyter Notebooks, Git, and basic knowledge of Cloud platforms (AWS/GCP/Azure) is a plus.\n\n\nInternship Benefits\n\n\n* Stipend: A fixed monthly payment of ₹15,000.\n* Certification: Official Internship Completion Certificate from Infrabyte Consulting.\n* Professional Growth: Performance-based Letter of Recommendation (LoR).\n* Mentorship: Direct guidance from senior AI engineers and data scientists.\n* Remote Work: 100% remote flexibility with a focus on research, innovation, and technical rigor.\n\nJob search faster with Premium\nAccess company insights like strategic priorities, headcount trends, and more\n\n\n\n\nMillions of members use Premium\n\nTry Premium for ₹0\n1 month free. Easy to cancel. No penalties or fees.",
      "timestamp": "2026-01-12T17:54:22.713935"
    },
    {
      "id": 40,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4358631889&keywords=Data%20Scientist",
      "raw_text": "AI Engineer Internship in Delhi (Hybrid)\nDelhi, India · 4 days ago · Over 100 people clicked apply\nResponses managed off LinkedIn\n\n\nOn-site\n\nInternship\n\nApply\n\nSave\nSave AI Engineer Internship in Delhi (Hybrid) at Conversely AI\nAI Engineer Internship in Delhi (Hybrid)\nConversely AI · Delhi, India (On-site)\n\nApply\n\nSave\nSave AI Engineer Internship in Delhi (Hybrid) at Conversely AI\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nThis job is sourced from a job board. Learn More\nAs an AI engineer intern at Conversely, you will have the opportunity to work on cutting-edge projects in the field of artificial intelligence. If you have a passion for machine learning, LLM evaluation, ChatGPT, generative AI tools, automation, Claude, and GitHub Copilot (GenAI), then this is the perfect role for you.\n\nSelected Intern’s Day-to-day Responsibilities Include\n\n Developing and implementing machine learning algorithms to improve conversational AI systems\n Evaluating and optimizing language model performance using LLM evaluation techniques\n Utilizing ChatGPT and other generative AI tools to enhance user interactions\n Automating repetitive tasks to increase efficiency and productivity\n Collaborating with team members to integrate Claude into existing systems\n Leveraging GitHub Copilot (GenAI) to streamline code development and improve code quality\n Staying up-to-date on the latest advancements in AI technology and incorporating them into projects\n\nIf you are a driven and innovative AI enthusiast looking to gain hands-on experience in a fast-paced environment, apply now to join our dynamic team at Conversely.\n\nAbout Company: Conversely is revolutionizing customer engagement with data-driven chat solutions. By empowering businesses through full-funnel targeted marketing solutions, we are strategically their partners in navigating the ever-changing digital landscape.\n\n\nDesired Skills and Experience\nMachine Learning, Automation, Generative AI Tools, ChatGPT, Claude, LLM evaluation, GitHub Copilot (GenAI)",
      "timestamp": "2026-01-12T17:54:50.707808"
    },
    {
      "id": 41,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4361131929&keywords=Data%20Scientist",
      "raw_text": "SDE Intern + FTE\nGurugram, Haryana, India · 6 minutes ago · 6 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nOn-site\n\nInternship\n\nApply\n\nSave\nSave SDE Intern + FTE at Urban Company\nSDE Intern + FTE\nUrban Company · Gurugram, Haryana, India (On-site)\n\nApply\n\nSave\nSave SDE Intern + FTE at Urban Company\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\n\n\nAbout the Company\n\n\n\n\nUrban Company is a technology platform offering customers a variety of services at home. Customers use our platform to book services such as beauty treatments, haircuts, massage therapy, cleaning, plumbing, carpentry, appliance repair, painting, etc., all delivered in the comfort of their home and at a time of their choosing. We promise our customers a high-quality, standardized, and reliable service experience. To fulfill this promise, we work closely with our hand-picked service partners, enabling them with technology, training, products, tools, financing, insurance, and brand, helping them succeed and deliver on this promise\n\n\n.\nUrban Company started as UrbanClap in November 2014, when its founders, Abhiraj, Raghav, and Varun, realized that the home services industry was predominantly unorganized, fragmented, and offline. Customers found it challenging to avail quality services conveniently, and service professionals were struggling to make ends meet, having to rely upon several middlemen, contractors, and local aggregators. The founders felt that the industry was ripe for disruption, and launched Urban Company, with three key principles in mind\n\n\n -\n1. Customer love: Build a platform that offers truly delightful and differentiated servi\nces2. Partner empowerment: Build a deep, full-stack partnership with service partne\nrs,helping improve their earnings and overall livelih\nood3. Technology first: Bring innovation and technology to an age-old indus\n\n\ntry\nAbout the \n\n\n\nRole\nWe’re looking for talented and passionate Software Development Engineers to join our growing team. As an SDE 1, you’ll be instrumental in building and maintaining scalable, high-performance software solutions that power our business. You’ll work closely with cross-functional teams to define priorities, create robust solutions, and deliver high-quality res\n\n\nults.\nMust-Have Skills (0–1 year exper\n\n\n\nience)\n● 6 months to 1 year of hands-on experience in software devel\nopment.● Ability to design and build software architectures that are scalable, reliable, and mainta\ninable.● Proficient in at least one programming language with solid coding \n\nskills.● Nice-to-Have (Bonus \n\nSkills)● Understanding of the full software development lifecycle, including best practices in coding, code reviews, version control, build systems, testing, and depl\noyment.● Exposure to event-driven systems, caching strategies, SQL and NoSQL dat\n\n\nabases.\nWhy Work \n\n\n\nWith Us?\n● Be part of building high-scale infrastructure powering hundreds of micro\nservices.● Tackle challenging business problems with simple, scalable s\nolutions.● Work with the latest tech stacks and open-source tools, and contribute back to the c\n\n\nommunity.\nAt Urban Company we are committed to providing equal and fair opportunities in employment and creating an inclusive work environment. We endeavor to maintain a work environment free from harassment based on age, colour, physical ability, marital status, parental status, ethnic origin, religion, sexual orientation, or gender\n\n\n identity.\n\nAbout the company\nUrban Company company logo\nUrban Company\n511,266 followers\n\nFollow\nTechnology, Information and Internet  1,001-5,000 employees  10,524 on LinkedIn\nVision: Empower millions of professionals worldwide to deliver services at home like never experienced before\n\nFounded in November 2014, Urban Company is Asia’s largest technology marketplace for home services. The company offers services such as beauty & spa at home, cleaning, plumbing, carpentry, appliance repair, painting, etc. through its mobile app & website. It operates in 50+ cities in India, the UAE, Singapore & The Kingdom of Saudi Arabia. It has a partner network of over 42,000 hand-picked service professionals transforming them into organized & high-quality micro-entrepreneurs. This full-stack approach helps the company live up to its promise of delivering high-quality, delightful services at home.\n\n\n\n\n\n…\nshow more\n\nInterested in working with us in the future?\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company",
      "timestamp": "2026-01-12T17:55:31.624088"
    },
    {
      "id": 42,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4327882230&keywords=Data%20Scientist",
      "raw_text": "Generative AI Engineer\nBengaluru, Karnataka, India · 3 weeks ago · Over 100 applicants\nPromoted by hirer · Actively reviewing applicants\n\n\nOn-site\n\nFull-time\n\nEasy Apply\n\nSave\nSave Generative AI Engineer at Sustainability Economics.ai\nGenerative AI Engineer\nSustainability Economics.ai · Bengaluru, Karnataka, India (On-site)\n\nEasy Apply\n\nSave\nSave Generative AI Engineer at Sustainability Economics.ai\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nLocation: Bengaluru, Karnataka \n\n \nAbout the Company: \nSustainability Economics.ai is a global organization, pioneering the convergence of clean energy and AI, enabling profitable energy transitions while powering end-to-end AI infrastructure. By integrating AI-driven cloud solutions with sustainable energy, we create scalable, intelligent ecosystems that drive efficiency, innovation, and long-term impact across industries. Guided by exceptional leaders and visionaries with decades of expertise in finance, policy, technology, and innovation, we are committed to making long-term efforts to fulfil this vision through our technical innovation, client services, expertise, and capability expansion. \n\n \nRole Summary: \nWe are seeking a highly skilled and innovative Generative AI Engineer to design, develop, and optimize cutting-edge AI systems that power intelligent, scalable, and agent-driven workflows. This role blends the frontier of generative AI research with robust engineering, requiring expertise in machine learning, deep learning, and large language models (LLMs) and latest trends going on in the industry. The ideal candidate will collaborate with cross-functional teams to build production-ready AI solutions that address real-world business challenges while keeping our platforms at the forefront of AI innovation. \n\n\n\nKey Tasks and Accountability: \nStrong Foundations on the conceptual & implementation aspects of machine & deep learning models and agents. \nExperience on using the LLMs, Hugging Face, LangChain, API Design, RAG, Vector Databases, OpenAI APIs, Gemini APIs. \nDesign, implement, and fine-tune ML/DL models, with a focus on LLMs and generative AI systems. \nApply advanced techniques (e.g., RAG, optimization algorithms, transformer architectures) to improve model performance. \nStay updated on emerging research in NLP, ML, and AI, integrating best practices into production workflows. \nWork with large, text-heavy datasets using preprocessing, feature engineering, and embedding strategies. \nKeep abreast of the latest advancements in NLP and ML and other deep Learning Models to ensure our solutions remain at the forefront of technology. \nExperience with time series models (ARIMA, SARIMA, LSTM, Transformer models, etc.) \nProgramming Language Experience in Python. \nWork closely with domain experts to understand the latest research findings and incorporate them into Agents. \nCollaborate with software developers to create user-friendly interfaces and tools that can be used to visualize and analyze as per the business requirements. \n \nKey Requirements: \nEducation & Experience \nBachelor’s or Master’s degree in Computer Science, Engineering, or related field. \n1–2 years of hands-on experience in ML, LLMs, or Generative AI development and Multi Agent systems. \nStrong background in AI/ML with production-grade deployments. \n \nSoft Skills \nStrong problem-solving and analytical skills and learning mode. \nExcellent communication abilities, capable of simplifying technical concepts for non-technical audiences. \nCollaborative mindset, with ability to work across research, engineering, and product teams. \n\n\nWhat You’ll Do \nBuild, train, and optimize generative AI models for production use cases. \nDesign intelligent agentic workflows that integrate seamlessly with business applications. \nCollaborate with product, engineering, and research teams to deliver impactful AI solutions. \nContribute to the development of APIs and user-facing tools that make AI accessible. \nContinuously monitor and improve AI systems for scalability, performance, and accuracy. \n \nWhat you will bring \nA history of successfully building and deploying AI/ML solutions. \nStrong problem-solving ability and a drive for innovation, and eagerness to learn emerging technologies and passion for building impactful solutions. \nStartup DNA → bias to action, comfort with ambiguity, love for fast iteration, and flexible and growth mindset. \n \nWhy Join Us \nShape a first-of-its-kind AI + clean energy platform. \nWork with a small, mission-driven team obsessed with impact. \nAn aggressive growth path. \nA chance to leave your mark at the intersection of AI, design, and sustainability. \n \n\nJob search faster with Premium\nAccess company insights like strategic priorities, headcount trends, and more\n\n\n\n\nMillions of members use Premium\n\nTry Premium for ₹0\n1 month free. Easy to cancel. No penalties or fees.",
      "timestamp": "2026-01-12T17:55:53.147813"
    },
    {
      "id": 43,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4349780622&keywords=Data%20Scientist",
      "raw_text": "AI Deployment Manager - India \nDelhi, India · Reposted 1 week ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nHybrid\n\nFull-time\n\nApply\n\nSave\nSave AI Deployment Manager - India  at OpenAI\nAI Deployment Manager - India\nOpenAI · Delhi, India (Hybrid)\n\nApply\n\nSave\nSave AI Deployment Manager - India  at OpenAI\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nAbout The Team\n\nThe AI Deployment and Adoption team ensures the successful post-sales deployment and value realization of ChatGPT Enterprise and other OpenAI products for customers across industries. AI Deployment Managers collaborate closely with Sales, Technical Success, and Product teams to deliver exceptional AI experiences and measurable business results. Our customers include large enterprises, startups, and digital native organizations. As an AI Deployment Manager, you’ll help companies transform their business by adopting solutions that make use of our newest, most exciting models.\n\nAbout The Role\n\nWe are seeking an AI Deployment Manager to lead time-bound strategic implementations and drive adoption and value of ChatGPT Enterprise. You will be responsible for understanding our customer’s needs and delivering an excellent experience. Success will be measured by customer activation and adoption, live production deployments, and customer satisfaction. You will partner with Sales, Solutions Engineering, Solutions Architecture, and Product teams.\n\nThis role can be based in Delhi, Mumbai, or Bengaluru.\n\nIn This Role, You Will\n\nDeliver exceptional customer outcomes, as demonstrated by production customer deployments, increased adoption, and customer satisfaction.\nDefine and manage structured, time-bound onboarding and deployment projects across multiple OpenAI products to ensure seamless adoption and measurable success.\nGuide organizations through the adoption journey by providing change management expertise to maximize the impact of OpenAI solutions.\nTrain, educate and enable ChatGPT Enterprise users to drive adoption and value.\nOwn the technical deployment of ChatGPT, including connectors, Codex, custom GPTs, and other advanced capabilities.\nDesign and lead hackathons, workshops, and other hands on training and education for audiences ranging from senior executives to working teams.\nCodify best practices and playbooks based on interactions with customers.\nGather and relay customer feedback to internal stakeholders, and identify themes across customers to incorporate into product planning.\nPartner with the Sales team to ensure seamless handoff between pre- and post-sale and for ongoing relationship management.\n\nYou’ll Thrive In This Role If You\n\nHave 6+ years of experience in customer-facing roles, engaging C-level technical audiences with complex global organizations.\nHave led complex implementations of Generative AI/traditional ML solutions and can drive measurable business outcomes.\nPossess exceptional presentation and communication skills, particularly when engaging with executives and leaders.\nHave a humble attitude, an eagerness to help others, and a desire to pick up whatever knowledge you're missing to make both your team and our customers succeed.\nOperate with high horsepower, have strong problem-solving skills, are adept at frequent context switching, effectively manage working on multiple projects at once with expansive ownership, and ruthlessly prioritize.\nHave a solid track record of delivering and scaling an exceptional customer experience.\nAre personally committed to fostering the safe and ethical evolution of AI.\n\nAbout OpenAI\n\nOpenAI is an AI research and deployment company dedicated to ensuring that general-purpose artificial intelligence benefits all of humanity. We push the boundaries of the capabilities of AI systems and seek to safely deploy them to the world through our products. AI is an extremely powerful tool that must be created with safety and human needs at its core, and to achieve our mission, we must encompass and value the many different perspectives, voices, and experiences that form the full spectrum of humanity.\n\nWe are an equal opportunity employer, and we do not discriminate on the basis of race, religion, color, national origin, sex, sexual orientation, age, veteran status, disability, genetic information, or other applicable legally protected characteristic.\n\nFor additional information, please see OpenAI’s Affirmative Action and Equal Employment Opportunity Policy Statement.\n\nBackground checks for applicants will be administered in accordance with applicable law, and qualified applicants with arrest or conviction records will be considered for employment consistent with those laws, including the San Francisco Fair Chance Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, for US-based candidates. For unincorporated Los Angeles County workers: we reasonably believe that criminal history may have a direct, adverse and negative relationship with the following job duties, potentially resulting in the withdrawal of a conditional offer of employment: protect computer hardware entrusted to you from theft, loss or damage; return all computer hardware in your possession (including the data contained therein) upon termination of employment or end of assignment; and maintain the confidentiality of proprietary, confidential, and non-public information. In addition, job duties require access to secure and protected information technology systems and related data security obligations.\n\nTo notify OpenAI that you believe this job posting is non-compliant, please submit a report through this form. No response will be provided to inquiries unrelated to job posting compliance.\n\nWe are committed to providing reasonable accommodations to applicants with disabilities, and requests can be made via this link.\n\nOpenAI Global Applicant Privacy Policy\n\nAt OpenAI, we believe artificial intelligence has the potential to help people solve immense global challenges, and we want the upside of AI to be widely shared. Join us in shaping the future of technology.\n\nAbout the company\nOpenAI company logo\nOpenAI\n9,661,538 followers\n\nFollow\nResearch Services  201-500 employees  7,121 on LinkedIn\nOpenAI is an AI research and deployment company dedicated to ensuring that general-purpose artificial intelligence benefits all of humanity. AI is an extremely powerful tool that must be created with safety and human needs at its core. OpenAI is dedicated to putting that alignment of interests first — ahead of profit.\n\nTo achieve our mission, we must encompass and value the many different perspectives, voices, and experiences that form the full spectrum of humanity. Our investment in diversity, equity, and inclusion is ongoing, executed through a wide range of initiatives, and championed and supported by leadership.\n\nAt OpenAI, we believe artificial intelligence has the potential to help people solve immense global challenges, and we want the upside of AI to be widely shared. Join us in shaping the future of technology.\n…\nshow more\n\nInterested in working with us in the future?\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company",
      "timestamp": "2026-01-12T17:56:34.057628"
    },
    {
      "id": 44,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4361131871&keywords=Data%20Scientist",
      "raw_text": "Remote Software Engineer (C++) \nHyderabad, Telangana, India · 17 minutes ago · 0 applicants\nPromoted by hirer · No response insights available yet\n\n\nRemote\n\nContract\n\nEasy Apply\n\nSave\nSave Remote Software Engineer (C++)  at Turing\nRemote Software Engineer (C++)\nTuring · Hyderabad, Telangana, India (Remote)\n\nEasy Apply\n\nSave\nSave Remote Software Engineer (C++)  at Turing\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nAbout the projects: we are building LLM evaluation and training datasets to train LLM to work on realistic software engineering problems. One of our approaches, in this project, is to build verifiable SWE tasks based on public repository histories in a synthetic approach with human-in-the-loop; while expanding the dataset coverage to different types of tasks in terms of programming language, difficulty level, and etc.\n\n\nAbout the Role: \n\nWe are looking for experienced software engineers (tech lead level) who are familiar with high-quality public GitHub repositories and can contribute to this project. This role involves hands-on software engineering work, including development environment automation, issue triaging, and evaluating test coverage and quality\n\n\nWhy Join Us? \n\nTuring is one of the world’s fastest-growing AI companies accelerating the advancement and deployment of powerful AI systems. You’ll be at the forefront of evaluating how LLMs interact with real code, influencing the future of AI-assisted software development. This is a unique opportunity to blend practical software engineering with AI research.\n\n\nWhat does day-to-day look like:\n\nAnalyze and triage GitHub issues across trending open-source libraries.\nSet up and configure code repositories, including Dockerization and environment setup.\nEvaluating unit test coverage and quality.\nModify and run codebases locally to assess LLM performance in bug-fixing scenarios.\nCollaborate with researchers to design and identify repositories and issues that are challenging for LLMs.\nOpportunities to lead a team of junior engineers to collaborate on projects.\n\n\nRequired Skills:\n\nMinimum 3+ years of overall experience\nStrong experience with at least one of the following languages: C++\nProficiency with Git, Docker, and basic software pipeline setup.\nAbility to understand and navigate complex codebases.\nComfortable running, modifying, and testing real-world projects locally.\nExperience contributing to or evaluating open-source projects is a plus.\n\n\nNice to Have:\n\nPrevious participation in LLM research or evaluation projects.\nExperience building or testing developer tools or automation agents.\nPerks of Freelancing With Turing:\nWork in a fully remote environment.\nOpportunity to work on cutting-edge AI projects with leading LLM companies.\n\n\nOffer Details:\n\nCommitments Required: At least 4 hours per day and minimum 20 hours per week with overlap of 4 hours with PST. (We have 3 options of time commitment: 20 hrs/week, 30 hrs/week or 40 hrs/week)\nEmployment type: Contractor assignment (no medical/paid leave)\n\n\nAfter applying, you will receive an email with a login link. Please use that link to access the portal and complete your profile.\n\n\n\nKnow amazing talent? Refer them at turing.com/referrals, and earn money from your network.\n\nJob search faster with Premium\nAccess company insights like strategic priorities, headcount trends, and more\n\n\n\n\nMillions of members use Premium\n\nTry Premium for ₹0\n1 month free. Easy to cancel. No penalties or fees.\n\nAbout the company\nTuring company logo\nTuring\n1,547,744 followers\n\nFollow\nTechnology, Information and Internet  1,001-5,000 employees  6,006 on LinkedIn\nTuring is one of the world’s fastest-growing AI companies accelerating the advancement and deployment of powerful AI systems.\n\nTuring helps customers in two ways: Working with the world’s leading AI labs to advance frontier model capabilities in thinking, reasoning, coding, agentic behavior, multimodality, multilinguality, STEM and frontier knowledge; and leveraging that work to build real-world AI systems that solve mission-critical priorities for companies.\n\nPowering this growth is Turing’s talent cloud—an AI-vetted pool of 4M+ software engineers, data scientists, and STEM experts who can train models and build AI applications. All of this is orchestrated by ALAN—our AI-powered platform for matching and managing talent, and generating high-quality human and synthetic data to improve model performance. ALAN also accelerates workflows for model and agent evals, supervised fine-tuning, reinforcement learning, reinforcement learning with human feedback, preference-pair generation, benchmarking, data capture for pre-training, post-training, and building AI applications.\n\nTuring—based in San Francisco, California—was named #1 on The Information’s annual list of “Top 50 Most Promising B2B Companies,” and has been profiled by Fast Company, TechCrunch, Reuters, Semafor, VentureBeat, Entrepreneur, CNBC, Forbes, and many others. Turing’s leadership team includes AI technologists from Meta, Google, Microsoft, Apple, Amazon, X, Stanford, Caltech, and MIT.\n…\nshow more\n\nInterested in working with us in the future?\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company",
      "timestamp": "2026-01-12T17:57:27.893538"
    },
    {
      "id": 45,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4333707662&keywords=Data%20Scientist",
      "raw_text": "Team Lead , Team Lead \nGurgaon, Haryana, India · Reposted 1 day ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nFull-time\n\nApply\n\nSave\nSave Team Lead , Team Lead  at Amazon\n\nTeam Lead , Team Lead\nAmazon · Gurgaon, Haryana, India\n\nApply\n\nSave\nSave Team Lead , Team Lead  at Amazon\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nDescription\n\nAt Amazon, we're working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven people. Amazon is seeking Team leads for our transportation team. Amazon is one of the most recognizable brand names in the world and we distribute millions of products each year to our loyal customers\n\nWe're seeking a Team lead for our Delivery center. In this role you will be responsible for shift operations at our DCs and support the DC manager in performance management and driving the operational plan.\n\nBasic Qualifications\n\n Bachelor's degree\n Speak, write, and read fluently in English\n Experience with Microsoft Office products and applications\n\nPreferred Qualifications\n\n Knowledge of city topography and road network\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ATSPL - Haryana\n\nJob ID: A3119828\n\nJob search faster with Premium\nAccess company insights like strategic priorities, headcount trends, and more\n\n\n\n\nMillions of members use Premium\n\nTry Premium for ₹0\n1 month free. Easy to cancel. No penalties or fees.\n\nAbout the company\nAmazon company logo\nAmazon\n36,026,507 followers\n\nFollow\nSoftware Development  10,001+ employees  770,016 on LinkedIn\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. We are driven by the excitement of building technologies, inventing products, and providing services that change lives. We embrace new ways of doing things, make decisions quickly, and are not afraid to fail. We have the scope and capabilities of a large company, and the spirit and heart of a small one.\n\nTogether, Amazonians research and develop new technologies from Amazon Web Services to Alexa on behalf of our customers: shoppers, sellers, content creators, and developers around the world.\n\nOur mission is to be Earth's most customer-centric company. Our actions, goals, projects, programs, and inventions begin and end with the customer top of mind.\n\nYou'll also hear us say that at Amazon, it's always \"Day 1.\"​ What do we mean? That our approach remains the same as it was on Amazon's very first day - to make smart, fast decisions, stay nimble, invent, and focus on delighting our customers.\n…\nshow more\n\nCommitments\n\nCareer growth and learning\nWe offer a variety of career mobility and development opportunities that are designed to help employees move into higher-paying roles at Amazon or elsewhere. Our ten upskilling programs offer employees access to pre-paid education, technical and non-technical skills training, industry certifications, virtual and on-the-job learning and more to help them grow their skills. These programs, as well as career development opportunities like mentoring, internal transfers and promotions, are just one of the one we strive to be Earth's best employer.\n…\nShow more\nDiversity, equity, and inclusion\nAmazon’s ability to innovate on behalf of our customers relies on the perspectives and knowledge of people from all backgrounds. We actively recruit people from diverse backgrounds to build a supportive and inclusive workplace. Where possible, we provide unlimited gender transition benefits including gender affirmation. Amazon provides short-term and long-term disability coverage at no cost (available to employees working 30+ hours). Employees have opportunities to seek mentoring relationships, including company-sponsored mentoring programs and affinity group-organized mentor pairings focused on various communities. To support building our inclusive culture, Amazon’s 13 affinity groups lead in community-building, mentorship, and programs to build awareness around customer and employee inclusion.\n…\nShow more\nLearn more\nInterested in working with us in the future?\nMembers who share that they’re interested in a company may be 2x as likely to get a message from a recruiter than those who don’t. Learn moreLearn more about Interested in working for our company",
      "timestamp": "2026-01-12T17:57:49.482943"
    },
    {
      "id": 46,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4238707648&keywords=Data%20Scientist",
      "raw_text": "Vehicle Operator, Autopilot (Delhi) \nDelhi, India · 7 months ago · Over 100 people clicked apply\nResponses managed off LinkedIn\n\n\nOn-site\n\nFull-time\n\nApply\n\nSave\nSave Vehicle Operator, Autopilot (Delhi)  at Tesla\nVehicle Operator, Autopilot (Delhi)\nTesla · Delhi, India (On-site)\n\nApply\n\nSave\nSave Vehicle Operator, Autopilot (Delhi)  at Tesla\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nWhat To Expect\nWe are looking for a highly motivated self-starter to join our vehicle data collection team. As a Prototype Vehicle Operator, you will be responsible for driving an engineering vehicle for extended periods, conducting dynamic audio and camera data collection for testing and training purposes. Access to the data collected is limited to the applicable development team. This role requires a high level of flexibility, strong attention to detail, excellent driving skills, and the ability to thrive in a fast-paced, dynamic environment.\n\nThis opportunity will require the flexibility of traveling to domestic or international destinations, as necessary.\n\nAbility to work a flexible schedule that includes at least one of your normal working days be a weekend day.\n\nAble to work a Day, Afternoon, or Night shift. The Afternoon and Night shift pays 10% in addition to the hourly base pay for the role.\n\nWhat You’ll Do\n\nDrive an engineering vehicle for extended hours in a designated area for data collection, 5 to 8 hours daily\nStart/Stop recording devices and perform minor equipment/software debugging as needed\nAnalyze and report on the quality of data collected during each shift\nProvide feedback and suggest process improvements to optimize data collection\nWrite detailed daily drive reports documenting observations and issues\nEnsure the vehicle’s safety and operational status before every shift\nThis is a safety measure position which is subject to drug testing requirements per Tesla policy and in accordance with applicable law\n\n\nWhat You’ll Bring\n\nA valid driver’s license is required\nExcellent attention to detail and highly observant during data collection\nStrong written and verbal communication skills in English\nTech-savvy with experience managing tools for data collection and troubleshooting with advanced PC skills, particularly in Microsoft Office Suite\nFamiliarity with Advanced Driver Assistance Systems (ADAS) and Autonomous Driving Systems (ADS)\nOvertime is also typical for this position but not guaranteed",
      "timestamp": "2026-01-12T17:58:11.044728"
    },
    {
      "id": 47,
      "url": "https://www.linkedin.com/jobs/search/?currentJobId=4325362867&keywords=Data%20Scientist",
      "raw_text": "Tuition Teacher - Work From Home\nIndia · 1 month ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn\n\n\nRemote\n\nApply\n\nSave\nSave Tuition Teacher - Work From Home at UrbanPro.com\nTuition Teacher - Work From Home\nUrbanPro.com · India (Remote)\n\nApply\n\nSave\nSave Tuition Teacher - Work From Home at UrbanPro.com\nShow more options\nUpdate your profile to assess your job match\nUpdate profile\nAbout the job\nPassionate Tutors Wanted: Shape the Future with UrbanPro\n\n\nAre you a dedicated educator looking to make a difference?\nUrbanPro, India's largest learning marketplace, is seeking exceptional tutors to join our growing community. We're looking for passionate individuals who are committed to providing quality education and inspiring students to reach their full potential.\n\n\nAbout UrbanPro:\nUrbanPro is a platform that connects students with expert tutors for a wide range of subjects. We are committed to empowering learners and helping them achieve their goals. By joining our team, you will have the opportunity to reach thousands of students and build a successful tutoring career.\n\n\nResponsibilities:\nDeliver engaging and effective online or offline classes\nCreate a positive and supportive learning environment\nDevelop personalized lesson plans to meet students' needs\nUtilize UrbanPro's platform to manage your profile and student interactions\nBuild a strong reputation and attract new students\n\n\nRequirements:\nProven teaching experience\nStrong subject matter expertise\nExcellent communication and interpersonal skills\nPassion for education and student success\nAbility to adapt to different learning styles\n\n\nWhat we offer:\nFlexible work hours\nCompetitive earning potential\nOpportunity to build your brand\nAccess to a vast student base\nContinuous professional development\n\n\nIf you are a dedicated educator who is passionate about helping students succeed, we encourage you to apply. Join UrbanPro and make a lasting impact on the lives of your students.\n\n\nApply now to start your journey as an UrbanPro tutor!\n\n\n#UrbanPro #Tutor #Education #TeachingJob #OnlineTutoring #TeachingCareer #EducationJob #JobOpportunity #RemoteJob",
      "timestamp": "2026-01-12T17:58:32.628411"
    }
  ]
}